000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. BOM021.
000030*   FACTURACION - ANULA UNA FACTURA COMBUSTIBLES.
000040 ENVIRONMENT     DIVISION.
000050 INPUT-OUTPUT SECTION.
000060 FILE-CONTROL. 
000070
000080     SELECT MOVIMIENTO-DIARIO LOCK MODE IS AUTOMATIC
000081            ASSIGN NOM-MOV-W
000082            ORGANIZATION IS INDEXED;
000083            ACCESS MODE IS DYNAMIC
000084            RECORD KEY IS LLAVE-MOV
000085            ALTERNATE RECORD KEY SECUENCIA-MOV
000086            ALTERNATE RECORD KEY LLAVE-FEC
000087            ALTERNATE RECORD KEY LLAVE-DOC-MOV   WITH DUPLICATES
000088            ALTERNATE RECORD KEY COSTO-MOV       WITH DUPLICATES
000089            ALTERNATE RECORD KEY NRO-ORD-MOV     WITH DUPLICATES
000090            ALTERNATE RECORD KEY LLAVE-LIBRE-MOV WITH DUPLICATES
000091            FILE STATUS IS OTR-STAT.
000140 
000160 DATA DIVISION.
000170 FILE SECTION.
000190 COPY "P:\PROG\PROYECT\FUENTES\FD-MOVIM.CBL".
000200
000210 WORKING-STORAGE SECTION.
000220 COPY "P:\PROG\PROYECT\FUENTES\WEB-CARAC.CBL".
000230
000240 
000250 77 COMP-ANT                              PIC 9(6).
000260 77 NRO-ULT-COMP-W                        PIC 9(6).
000270 77 SW9                                   PIC 9.
000280 77 SEC-W                                 PIC X(50).
000290 77 ULT-NRO-W                             PIC 9(9).
000300 77 NOM-MOV-W                             PIC X(70).
000310 77 MES-ARCHIVO                           PIC X(4).
000320 77 LLAVE-W                               PIC X(8).
000350
000360 LINKAGE SECTION.
000370
000380 01 NOMBRE-LNK               PIC X(50).
000400 01 INVALID-007              PIC 99.
000401
000410 01 NRO-FACT-W               PIC 9(6).
000420 01 FECHA-FACT.
000430    02 ANO-FACT              PIC 99.
000440    02 MES-FACT              PIC 99.
000450    02 DIA-FACT              PIC 99.
000520
000530 01 MENSAJE-W                PIC X(30).
000540
000560 PROCEDURE DIVISION USING NOMBRE-LNK INVALID-007 NRO-FACT-W FECHA-FACT MENSAJE-W.
000570
000580 DECLARATIVES.                    
000590 I-O-TEST SECTION.
000600     USE AFTER EXCEPTION PROCEDURE ON MOVIMIENTO-DIARIO.
000610 ESCR-EXCEPTIONES.
000620     IF OTR-STAT = "00"
000630        CONTINUE
000640     ELSE
000650        MOVE OTR-STAT   TO INVALID-007  
000660        MOVE NOM-MOV-W  TO MENSAJE-W     
000670        GO TO SALIR.
000680
000800 END DECLARATIVES.
000810 PROCEDURAL SECTION.
000820                               	 	
000830 ASIGNAR-NOMBRE.
000840
001170     MOVE NOMBRE-LNK TO NOM-MOV-W
001180
001280     EVALUATE MES-FACT
001281         WHEN 01 MOVE "\ENE" TO MES-ARCHIVO 
001282         WHEN 02 MOVE "\FEB" TO MES-ARCHIVO 
001283         WHEN 03 MOVE "\MAR" TO MES-ARCHIVO 	
001284         WHEN 04 MOVE "\ABR" TO MES-ARCHIVO 
001285         WHEN 05 MOVE "\MAY" TO MES-ARCHIVO 
001286         WHEN 06 MOVE "\JUN" TO MES-ARCHIVO 
001287         WHEN 07 MOVE "\JUL" TO MES-ARCHIVO 
001288         WHEN 08 MOVE "\AGT" TO MES-ARCHIVO 
001289         WHEN 09 MOVE "\SEP" TO MES-ARCHIVO 
001290         WHEN 10 MOVE "\OCT" TO MES-ARCHIVO 
001291         WHEN 11 MOVE "\NOV" TO MES-ARCHIVO 
001293         WHEN 12 MOVE "\DIC" TO MES-ARCHIVO
001294     END-EVALUATE.
001295
001296     INSPECT NOM-MOV-W REPLACING FIRST "    "
001297                                    BY MES-ARCHIVO.
001298
001299     INSPECT NOM-MOV-W REPLACING FIRST "               "
001300                                    BY "\SC-ARCHMOV.DAT".
001301
001302
001310 ABRIR-MOVIMIENTO.
001311
001312     MOVE "1B"        TO LOTE-MOV
001313     MOVE NRO-FACT-W  TO COMPROB-MOV
001314
001315     MOVE LLAVE-COMP-MOV TO LLAVE-W
001320     OPEN I-O MOVIMIENTO-DIARIO.
001470
001480
001490     START MOVIMIENTO-DIARIO KEY = LLAVE-COMP-MOV
001500           INVALID KEY  
001501                   MOVE 08          TO INVALID-007
001502                   MOVE "No se encontro Mov. Diario" TO MENSAJE-W
001503                   GO TO CERRAR-ARCHIVOS
001510     END-START.
001520
001540 BORRAR-MOV.
001541     READ MOVIMIENTO-DIARIO NEXT WITH NO LOCK AT END GO TO FINALIZAR.
001542
001543     IF LLAVE-COMP-MOV = LLAVE-W
001544        CONTINUE
001545     ELSE
001546        GO TO FINALIZAR
001547     END-IF
001548
001549     IF MAYOR-MOV = "1105" 
001550        MOVE 0 TO VALOR-MOV
001551        MOVE "ANULADA" TO DETALLE-MOV
001552        REWRITE MOV-DIARIO
001553     ELSE
001554        DELETE MOVIMIENTO-DIARIO
001555     END-IF.
001556
001565
001803     GO TO BORRAR-MOV.
001804
001805 FINALIZAR.
001806     MOVE 00        TO INVALID-007.
001808
001810 CERRAR-ARCHIVOS.
001820     CLOSE MOVIMIENTO-DIARIO.
001821
001830
001840 SALIR.
001850     EXIT PROGRAM.
001860
