000012* FACTURACION - DESCARGA INVENTARIOS.
000020 IDENTIFICATION DIVISION.
000021* PROGRAM-ID. "BOM030".
000022
000023 PROGRAM-ID. "HttpExtensionProc".
000024 ENVIRONMENT DIVISION.
000025 CONFIGURATION SECTION.
000026 INPUT-OUTPUT SECTION.
000027 FILE-CONTROL.
000080 COPY "P:\PROG\PROYECT\FUENTES\FS-USUNET.CBL".
000150 COPY "P:\PROG\PROYECT\FUENTES\FS-SESION.CBL".


           SELECT ARCHIVO-USUARIOS LOCK MODE IS AUTOMATIC
                  ASSIGN TO NOM-USUAR-W
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC;
                  RECORD KEY IS NOMBRE-USU
                  ALTERNATE RECORD KEY IS CTL-USU     WITH DUPLICATES
                  ALTERNATE RECORD KEY IS CLAVE-USU   WITH DUPLICATES
                  ALTERNATE RECORD KEY IS CLAVE-2-USU WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.


           SELECT ARCHIVO-COMBUSTIBLES LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-COMBU-W
                  ORGANIZATION INDEXED;
                  ACCESS MODE DYNAMIC;
                  RECORD KEY IS LLAVE-COMB
                  ALTERNATE RECORD KEY IS FECHA-COMB WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.


           SELECT ARCHIVO-SURTIDORES LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-SURT-W
                  ORGANIZATION INDEXED;
                  ACCESS MODE  DYNAMIC;
                  RECORD KEY COD-SURTI
                  FILE STATUS  OTR-STAT.


           SELECT MOVIMIENTO-INVENT LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-INV-W
                  ORGANIZATION IS INDEXED;
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS LLAVE-INV
                  ALTERNATE RECORD KEY COD-ART-INV   WITH DUPLICATES
                  ALTERNATE RECORD KEY SECUENCIA-INV
                  ALTERNATE RECORD KEY NIT-INV           WITH DUPLICATES
                  ALTERNATE RECORD KEY FECHA-INV         WITH DUPLICATES
                  ALTERNATE RECORD KEY LLAVE-DOC-CTL-INV WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.


           SELECT ARCHIVO-SALDOS LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-SALDO-W
                  ORGANIZATION INDEXED;
                  ACCESS MODE  DYNAMIC;
                  RECORD KEY LLAVE-SAL
                  ALTERNATE RECORD KEY COD-ART-SAL  WITH DUPLICATES
                  ALTERNATE RECORD KEY COD-LOTE-SAL WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.

000400 DATA DIVISION.
000410 FILE SECTION.
000420 COPY "P:\PROG\PROYECT\FUENTES\FD-USUNET.CBL".
000421 COPY "P:\PROG\PROYECT\FUENTES\FD-SESION.CBL".
000450 COPY "P:\PROG\PROYECT\FUENTES\FD-USUAR.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-COMBU.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-SURTI.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-INVEN.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-SALDO.CBL".

000540 WORKING-STORAGE  SECTION.
000550 COPY "P:\PROG\PROYECT\FUENTES\COBW3.CBL".
000560 COPY "P:\PROG\PROYECT\FUENTES\WEB-CARAC.CBL".

000570 77 NOM-USUAR-W            PIC X(70).
       77 NOM-COMBU-W            PIC X(70).
       77 NOM-SURT-W             PIC X(70).
       77 NOM-INV-W              PIC X(70).
       77 NOM-SALDO-W            PIC X(70).
       77 LLAVE-W                PIC X(9).
       77 SECU-W                 PIC 9(3).
       77 MES-ARCHIVO            PIC X(19).
       77 CANT-EDIT              PIC ZZZZZZZZZZZZ.ZZZ.
       77 SDO-ACT-CANT           PIC 9(13)V999.
       77 SDO-ACT-VLR            PIC 9(13)V999.
       77 PROMEDIO-W             PIC S9(9)V99.


       01 ART-W.
          02 TIPO-ART-W          PIC 9.
          02 COD-ART-W           PIC X(15).
          02 RESTO-ART-W         PIC X(3).

       01 LINEA-LLEGAD-W             PIC X(100).

       01 DATO-LLEGADA-W.
          02 SESION-LLEGAD-W        PIC X(29).
          02 DIRECTORIO-LLEGAD-W    PIC X(30).
          02 CARPTA-LLEGAD-W        PIC X(9).
          02 NRO-COMB-LLEGAD-W      PIC X(6).


000791 LINKAGE SECTION.
000792 COPY "P:\PROG\PROYECT\FUENTES\ISAPICTX.CBL".
000793
000794 PROCEDURE DIVISION WITH stdcall LINKAGE USING ISAPI-CTX-CNT.
000795
000810 DECLARATIVES.
000811 I-O-TEST SECTION.
000812     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUNET.         
000813 ESCR-EXCEPTIONES.
000814     IF OTR-STAT = "00"
000815        CONTINUE 
000816     ELSE
000817        MOVE OTR-STAT                TO MSJ1-HTML
000818        MOVE NOM-USU-W               TO MSJ2-HTML
000819        MOVE "BOM030"                TO MSJ3-HTML
000820        GO TO ENVIAR2-ERROR
000821     END-IF.
001030
001040 I-O-TEST SECTION.
001050     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SESION.         
001060 ESCR-EXCEPTIONES.
001070     IF OTR-STAT = "00"
001080        CONTINUE
001090     ELSE
001100        MOVE OTR-STAT                TO MSJ1-HTML
001101        MOVE NOM-SESION-W            TO MSJ2-HTML
001102        MOVE "BOM030"                TO MSJ3-HTML
001103        GO TO ENVIAR2-ERROR
001104     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUARIOS.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-USUAR-W      TO MSJ2-HTML
006680        MOVE "BOM030"         TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-COMBUSTIBLES.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-COMBU-W      TO MSJ2-HTML
006680        MOVE "BOM030"         TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SURTIDORES.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-SURT-W       TO MSJ2-HTML
006680        MOVE "BOM030"         TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON MOVIMIENTO-INVENT.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-INV-W        TO MSJ2-HTML
006680        MOVE "BOM030"         TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SALDOS.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-SALDO-W      TO MSJ2-HTML
006680        MOVE "BOM030"         TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

001150 END DECLARATIVES.
001160
001161 INICIAR-IIS.
001162     MOVE LOW-VALUE TO COBW3.
001163     MOVE FUNCTION ADDR(ISAPI-CTX-CNT) TO COBW3-CONTEXT.
001164     CALL "COBW3_INIT" USING COBW3.
001220
001221 LEER-DATO-HTML.
001852     MOVE "datosh" TO COBW3-SEARCH-DATA.
001853     CALL "COBW3_GET_VALUE" USING COBW3.
001854     MOVE COBW3-GET-DATA    TO LINEA-LLEGAD-W.

           INITIALIZE DATO-LLEGADA-W

           UNSTRING LINEA-LLEGAD-W DELIMITED BY "|"
              INTO SESION-LLEGAD-W, DIRECTORIO-LLEGAD-W, CARPTA-LLEGAD-W, NRO-COMB-LLEGAD-W
           END-UNSTRING.

           MOVE SESION-LLEGAD-W   TO LLAVE-SESION-W.

001238 INICIAR-SESION.
001245     MOVE "D:\WEB\MAIN-ELECT\DATOS\SC-SESION.DAT" TO NOM-SESION-W
001246
000820     MOVE FUNCTION CURRENT-DATE TO FECHA-TOTAL.
000830     ACCEPT HORA-TOTAL FROM TIME.
000810     GO TO VALIDAR-SESION.
000850
000860 FIN-VALIDAR-SESION.

001303 ABRIR-USUARIO.
001304     MOVE "D:\WEB\MAIN-ELECT\DATOS\SC-ARCHUSU.DAT" TO NOM-USU-W
001305
001306     OPEN INPUT ARCHIVO-USUNET
001307     EVALUATE OTR-STAT
001308       WHEN "00"  CONTINUE
001309       WHEN "35"  OPEN OUTPUT ARCHIVO-USUNET
001310                  CLOSE       ARCHIVO-USUNET
001311                  OPEN I-O    ARCHIVO-USUNET
001312                  INITIALIZE REG-USUNET
001314                  WRITE REG-USUNET
001315                  CLOSE       ARCHIVO-USUNET
001316                  MOVE "Validacion de usuarios"      TO MSJ1-HTML
001317                  MOVE "Falta configurar usuario"    TO MSJ2-HTML
001318                  MOVE "Sc"                          TO MSJ3-HTML
001319                  GO TO ENVIAR2-ERROR
001320       WHEN OTHER GO TO CERRAR-SESION
001321     END-EVALUATE.
001322
001332     INITIALIZE REG-USUNET.

007110 LEER-USUARIO.
007120     READ ARCHIVO-USUNET NEXT AT END MOVE 0 TO SW-FIN.
007130
007140     CLOSE ARCHIVO-USUNET.
007200     
007210     IF NOMBRE-USUNET = SPACES
007220     OR NIT-USUNET = ZEROS
007230        MOVE "Validacion de Sesion"        TO MSJ1-HTML
007240        MOVE "Falta configurar usuarios"   TO MSJ2-HTML
007250        MOVE "Sc"                          TO MSJ3-HTML
007260        GO TO ENVIAR2-ERROR
007270     END-IF.

       INICIAR-RESTRICION.
      *     MOVE FUNCTION CURRENT-DATE TO FECHA-ACT-S
      *     ACCEPT ULT-FECHA-NUM FROM DATE.

           INSPECT IP-DATOS-USUNET REPLACING FIRST "/" BY "\"
001614     INITIALIZE NOM-USUAR-W NOM-COMBU-W NOM-SURT-W NOM-INV-W NOM-SALDO-W
001615     MOVE "\\" TO NOM-USUAR-W
001616
001617     INSPECT NOM-USUAR-W REPLACING FIRST "                    "
001618                                    BY IP-DATOS-USUNET
001621     INSPECT NOM-USUAR-W REPLACING FIRST " "
001624                                     BY "\"
007292     INSPECT NOM-USUAR-W REPLACING FIRST "                              "
007293                                     BY DIRECTORIO-LLEGAD-W

           MOVE NOM-USUAR-W  TO  NOM-COMBU-W NOM-SURT-W NOM-INV-W

007190     INSPECT NOM-USUAR-W   REPLACING FIRST "                       "
007200                                        BY "\CONTROL\SC-ARCHUSU.DAT".

           INSPECT NOM-COMBU-W REPLACING FIRST "                       "
                                            BY "\CONTROL\SC-ARCOMBU.DAT".

           INSPECT NOM-SURT-W   REPLACING FIRST "                       "
                                             BY "\CONTROL\SC-ARCHSUR.DAT".



       LEER-USUARIO.

           OPEN INPUT ARCHIVO-USUARIOS
           READ ARCHIVO-USUARIOS NEXT WITH NO LOCK AT END 
                CLOSE ARCHIVO-USUARIOS
           END-READ.

           OPEN INPUT ARCHIVO-COMBUSTIBLES
                      ARCHIVO-SURTIDORES.

       LEER-COMB.
           MOVE NRO-COMB-LLEGAD-W TO NRO-COMB.
           READ ARCHIVO-COMBUSTIBLES WITH NO LOCK
                INVALID KEY
                        MOVE "99"     TO MSJ1-HTML
                        MOVE "Movimiento no existe" TO MSJ2-HTML
                        MOVE "BOM030" TO MSJ3-HTML
                        GO TO ENVIAR2-ERROR
           END-READ.

           EVALUATE MES-COMB
               WHEN 01 MOVE "\ENE\SC-MOVINV.DAT" TO MES-ARCHIVO
               WHEN 02 MOVE "\FEB\SC-MOVINV.DAT" TO MES-ARCHIVO
               WHEN 03 MOVE "\MAR\SC-MOVINV.DAT" TO MES-ARCHIVO
               WHEN 04 MOVE "\ABR\SC-MOVINV.DAT" TO MES-ARCHIVO
               WHEN 05 MOVE "\MAY\SC-MOVINV.DAT" TO MES-ARCHIVO
               WHEN 06 MOVE "\JUN\SC-MOVINV.DAT" TO MES-ARCHIVO
               WHEN 07 MOVE "\JUL\SC-MOVINV.DAT" TO MES-ARCHIVO
               WHEN 08 MOVE "\AGT\SC-MOVINV.DAT" TO MES-ARCHIVO
               WHEN 09 MOVE "\SEP\SC-MOVINV.DAT" TO MES-ARCHIVO
               WHEN 10 MOVE "\OCT\SC-MOVINV.DAT" TO MES-ARCHIVO
               WHEN 11 MOVE "\NOV\SC-MOVINV.DAT" TO MES-ARCHIVO
               WHEN 12 MOVE "\DIC\SC-MOVINV.DAT" TO MES-ARCHIVO
           END-EVALUATE.

           INSPECT NOM-INV-W REPLACING FIRST "                   "
                                          BY MES-ARCHIVO.

           MOVE NOM-INV-W    TO NOM-SALDO-W

           INSPECT NOM-SALDO-W REPLACING FIRST "SC-MOVINV.DAT"
                                            BY "SC-SALDO.DAT ".

           OPEN I-O MOVIMIENTO-INVENT.
       ENCABEZAR.

           INITIALIZE REG-INVENT SECU-W.

           MOVE "ALM01"     TO ALMACEN-INV.
           MOVE "2B"        TO COD-TRANS-INV.

           MOVE NRO-COMB-LLEGAD-W  TO COMPROB-INV.
           IF ANO-COMB > 90
              COMPUTE ANO-INV = ANO-COMB + 1900
           ELSE
              COMPUTE ANO-INV = ANO-COMB + 2000
           END-IF.

           MOVE MES-COMB    TO MES-INV.
           MOVE DIA-COMB    TO DIA-INV.

           MOVE "FACT."     TO DOCUM-INV.
           MOVE 0           TO NIT-INV.

       BUSCAR-MOVIMIENTO.

           START MOVIMIENTO-INVENT KEY = LLAVE-SEC-INV
                 INVALID KEY GO TO FIN-BORRAR
           END-START

           MOVE LLAVE-SEC-INV TO LLAVE-W.

       LEER-INVENTARIOS.
           READ MOVIMIENTO-INVENT NEXT WITH NO LOCK AT END GO TO FIN-BORRAR.


           IF LLAVE-SEC-INV = LLAVE-W
              CONTINUE
           ELSE
              GO TO FIN-BORRAR
           END-IF.

           DELETE MOVIMIENTO-INVENT.
           PERFORM BORRAR-SALDO.

           GO TO LEER-INVENTARIOS.


       FIN-BORRAR.
           PERFORM CERRAR-ARCHIVOS.
           PERFORM ENCABEZAR.

       REVISAR-CODIGO.
           PERFORM REGISTRO-MOVIMIENTO	VARYING I FROM  1 BY 1
                                                  UNTIL I > 15.
           GO TO ENVIO-DATOS.

       REGISTRO-MOVIMIENTO.

           IF GRP1-COMB (I) = 9
              CONTINUE
           ELSE
              PERFORM LEER-SURTIDORES
              INITIALIZE ART-W
              MOVE ARTICULO-COMB (I)  TO COD-ART-W
              MOVE ART-W              TO COD-ART-INV
              MOVE CANTIDAD-COMB (I)  TO CANT-INV
              MOVE VALOR-COMB    (I)  TO VLR-VEN-INV
                
              IF CANT-INV IS NOT ZERO
                 PERFORM GRABAR-MOVIMIENTO
              END-IF

           END-IF.

       GRABAR-MOVIMIENTO.

           PERFORM CALCULAR-SALDO.

           ADD 1 TO SECU-W.
           MOVE SECU-W TO SECU-INV.
           OPEN I-O MOVIMIENTO-INVENT.
           WRITE REG-INVENT END-WRITE

           IF ALM1-INV  = "CN"
              MOVE "TP" TO ALM1-INV
              ADD 1     TO SECU-W              
              MOVE SECU-W TO SECU-INV
              WRITE REG-INVENT END-WRITE
           END-IF.

           CLOSE MOVIMIENTO-INVENT.
     
       CALCULAR-SALDO.
           INITIALIZE REG-SALDOS
           MOVE LLAVE-ART-INV TO LLAVE-SAL
           OPEN I-O ARCHIVO-SALDOS
           READ ARCHIVO-SALDOS WITH NO LOCK
                INVALID KEY
                        WRITE REG-SALDOS END-WRITE
           END-READ


           ADD CANT-INV TO ACUM-SAL-CANT (1).
           ADD VLR-INV  TO ACUM-SAL-VLR  (1).
           COMPUTE SDO-ACT-CANT = ACUM-ENT-CANT (32) + ACUM-ENT-CANT (1)
                                - ACUM-SAL-CANT (1).
           COMPUTE SDO-ACT-VLR  = ACUM-ENT-VLR  (32) + ACUM-ENT-VLR  (1)
                                - ACUM-SAL-VLR  (1). 

           COMPUTE PROMEDIO-W = SDO-ACT-VLR / SDO-ACT-CANT.

           COMPUTE VLR-INV = PROMEDIO-W * CANT-INV.
           REWRITE REG-SALDOS END-REWRITE
           CLOSE ARCHIVO-SALDOS.


       BORRAR-SALDO.
           INITIALIZE REG-SALDOS.
           MOVE LLAVE-ART-INV TO LLAVE-SAL.
           OPEN I-O ARCHIVO-SALDOS.
           READ ARCHIVO-SALDOS WITH NO LOCK
                INVALID KEY
                        WRITE REG-SALDOS END-WRITE
           END-READ

           SUBTRACT CANT-INV FROM ACUM-SAL-CANT (1).
           SUBTRACT VLR-INV  FROM ACUM-SAL-VLR  (1).

           REWRITE REG-SALDOS END-REWRITE.
           CLOSE       ARCHIVO-SALDOS.

       CERRAR-ARCHIVOS.
           CLOSE MOVIMIENTO-INVENT
                 ARCHIVO-COMBUSTIBLES.

002147 ENVIO-DATOS.
004378     MOVE "datosrecibidos"  TO COBW3-CNV-NAME
004393     MOVE 00            TO COBW3-CNV-VALUE
004403     CALL "COBW3_SET_CNV"   USING COBW3
004413     MOVE "../PAGINAS/RECIBIDOS.ASPX"  TO SALIDA-HTML
004430     PERFORM ABRIR-HTML.

002545 CERRAR-SESION.
002546     CALL "COBW3_FREE" USING COBW3.
002547     MOVE 1 TO PROGRAM-STATUS.
002548     EXIT PROGRAM.

       LEER-SURTIDORES.

           MOVE SURTIDOR-COMB (I) TO COD-SURTI.
           READ ARCHIVO-SURTIDORES WITH NO LOCK
                INVALID KEY
                        MOVE "ALM01" TO ALM-SURTI
                        MOVE SPACES  TO C-COSTO-SURTI
           END-READ.

           IF ALM-SURTI = SPACES
              MOVE "ALM01"   TO ALM-SURTI
           END-IF.

           IF C-COSTO-SURTI = SPACES
              MOVE "00" TO C-COSTO-SURTI
           END-IF.

           MOVE ALM-SURTI     TO ALMACEN-INV.
           MOVE C-COSTO-SURTI TO COSTO-INV.

002566 COPY "P:\PROG\PROYECT\FUENTES\SC-WEB.CBL".
002567
