000012* FACTURACION - CONTABILIZA LAS VENTAS DE COMBUSTIBLES.
000020 IDENTIFICATION DIVISION.
000021* PROGRAM-ID. "BOM020".
000022
000023 PROGRAM-ID. "HttpExtensionProc".
000024 ENVIRONMENT DIVISION.
000025 CONFIGURATION SECTION.
000026 INPUT-OUTPUT SECTION.
000027 FILE-CONTROL.
000080 COPY "P:\PROG\PROYECT\FUENTES\FS-USUNET.CBL".
000150 COPY "P:\PROG\PROYECT\FUENTES\FS-SESION.CBL".


           SELECT ARCHIVO-USUARIOS LOCK MODE IS AUTOMATIC
                  ASSIGN TO NOM-USUAR-W
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC;
                  RECORD KEY IS NOMBRE-USU
                  ALTERNATE RECORD KEY IS CTL-USU     WITH DUPLICATES
                  ALTERNATE RECORD KEY IS CLAVE-USU   WITH DUPLICATES
                  ALTERNATE RECORD KEY IS CLAVE-2-USU WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.



           SELECT ARCHIVO-COMBUSTIBLES LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-COMBU-W
                  ORGANIZATION INDEXED;
                  ACCESS MODE DYNAMIC;
                  RECORD KEY IS LLAVE-COMB
                  ALTERNATE RECORD KEY IS FECHA-COMB WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.


           SELECT ARCHIVO-SURTIDORES LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-SURT-W
                  ORGANIZATION INDEXED;
                  ACCESS MODE  DYNAMIC;
                  RECORD KEY COD-SURTI
                  FILE STATUS  OTR-STAT.


           SELECT MAESTRO-ARTICULOS LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-ART-W
                  ORGANIZATION INDEXED;
                  ACCESS MODE  DYNAMIC;
                  RECORD KEY COD-ART
                  ALTERNATE RECORD KEY CLASE-ART       WITH DUPLICATES
                  ALTERNATE RECORD KEY COD-BARRAS-ART  WITH DUPLICATES
                  ALTERNATE RECORD KEY DESCRIP-ART     WITH DUPLICATES
                  ALTERNATE RECORD KEY USO-ART         WITH DUPLICATES
                  ALTERNATE RECORD KEY CL-ROTAC-ART    WITH DUPLICATES
                  ALTERNATE RECORD KEY UBICAC-ART      WITH DUPLICATES
                  ALTERNATE RECORD KEY FECHA-VENCE-ART WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.


           SELECT ARCHIVO-SOBRETASAS LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-SOBRE-W
                  ORGANIZATION INDEXED;
                  ACCESS MODE  DYNAMIC;
                  RECORD KEY ART-SOBRE
                  FILE STATUS IS OTR-STAT.


           SELECT MOVIMIENTO-DIARIO LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-MOV-W
                  ORGANIZATION IS INDEXED;
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS LLAVE-MOV
                  ALTERNATE RECORD KEY SECUENCIA-MOV
                  ALTERNATE RECORD KEY LLAVE-FEC
                  ALTERNATE RECORD KEY LLAVE-DOC-MOV   WITH DUPLICATES
                  ALTERNATE RECORD KEY COSTO-MOV       WITH DUPLICATES
                  ALTERNATE RECORD KEY NRO-ORD-MOV     WITH DUPLICATES
                  ALTERNATE RECORD KEY LLAVE-LIBRE-MOV WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.


           SELECT ARCHIVO-PRINTER
                  ASSIGN TO NOM-PRINTER-W
                  ORGANIZATION IS LINE SEQUENTIAL
                  FILE STATUS OTR-STAT.



000400 DATA DIVISION.
000410 FILE SECTION.
000420 COPY "P:\PROG\PROYECT\FUENTES\FD-USUNET.CBL".
000421 COPY "P:\PROG\PROYECT\FUENTES\FD-SESION.CBL".
000450 COPY "P:\PROG\PROYECT\FUENTES\FD-USUAR.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-COMBU.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-SURTI.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-ARTIC.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-SOBRE.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-MOVIM.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-IMPRE.CBL".


000540 WORKING-STORAGE  SECTION.
000550 COPY "P:\PROG\PROYECT\FUENTES\COBW3.CBL".
000560 COPY "P:\PROG\PROYECT\FUENTES\WEB-CARAC.CBL".

000570 77 NOM-USUAR-W            PIC X(70).
       77 NOM-COMBU-W            PIC X(70).
       77 NOM-SURT-W             PIC X(70).
       77 NOM-ART-W              PIC X(70).
       77 NOM-SOBRE-W            PIC X(70).
       77 NOM-MOV-W              PIC X(70).
       77 NOM-PRINTER-W          PIC X(60).
       77 MES-ARCHIVO            PIC X(19).
       77 MAY-DEUD               PIC X(4).
       77 LLAVE-W                PIC X(8).
       77 SECU-W                 PIC 9(3).
       77 CANT-EDIT              PIC ZZZZZZZZZZZZ.ZZZ.
       77 VALOR-EDIT             PIC -ZZZZZZZZZZZZ.ZZ.

       01 ART-W.
          02 TIPO-ART-W          PIC 9.
          02 COD-ART-W           PIC X(15).
          02 RESTO-ART-W         PIC X(3).


       01 DETALLE-W.
          02 SURTIDOR-DET     PIC XX.
          02 FILLER           PIC X.
          02 ARTICULO-DET     PIC X(13).
          02 FILLER           PIC X.
          02 CANTIDAD-DET     PIC X(16).
          02 FILLER           PIC X.
          02 OTROS-DET        PIC X(4).
          02 FILLER           PIC X.
          02 PLACA-DET        PIC X(6).
          02 FILLER           PIC X(5).


       01 LINEA-LLEGAD-W             PIC X(100).

       01 DATO-LLEGADA-W.
          02 SESION-LLEGAD-W        PIC X(29).
          02 DIRECTORIO-LLEGAD-W    PIC X(30).
          02 CARPTA-LLEGAD-W        PIC X(9).
          02 NRO-COMB-LLEGAD-W      PIC X(6).
          02 SW-LIB                 PIC X.


       01 VARIABLES.
          02 TABLA-IMPTO OCCURS 5.
             05 CTA-SOBRE-TAB      PIC X(11).
             05 TOT-SOBRETASA      PIC S9(9).
             05 CTA-GLOBAL-TAB     PIC X(11).
             05 TOT-GLOBAL         PIC S9(9).



000791 LINKAGE SECTION.
000792 COPY "P:\PROG\PROYECT\FUENTES\ISAPICTX.CBL".
000793
000794 PROCEDURE DIVISION WITH stdcall LINKAGE USING ISAPI-CTX-CNT.
000795
000810 DECLARATIVES.
000811 I-O-TEST SECTION.
000812     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUNET.         
000813 ESCR-EXCEPTIONES.
000814     IF OTR-STAT = "00"
000815        CONTINUE 
000816     ELSE
000817        MOVE OTR-STAT                TO MSJ1-HTML
000818        MOVE NOM-USU-W               TO MSJ2-HTML
000819        MOVE "BOM020"                TO MSJ3-HTML
000820        GO TO ENVIAR2-ERROR
000821     END-IF.
001030
001040 I-O-TEST SECTION.
001050     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SESION.         
001060 ESCR-EXCEPTIONES.
001070     IF OTR-STAT = "00"
001080        CONTINUE
001090     ELSE
001100        MOVE OTR-STAT                TO MSJ1-HTML
001101        MOVE NOM-SESION-W            TO MSJ2-HTML
001102        MOVE "BOM020"                TO MSJ3-HTML
001103        GO TO ENVIAR2-ERROR
001104     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUARIOS.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-USUAR-W      TO MSJ2-HTML
006680        MOVE "BOM020"         TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-COMBUSTIBLES.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-COMBU-W      TO MSJ2-HTML
006680        MOVE "BOM020"         TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SURTIDORES.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-SURT-W       TO MSJ2-HTML
006680        MOVE "BOM020"         TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON MAESTRO-ARTICULOS.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-ART-W        TO MSJ2-HTML
006680        MOVE "BOM020"         TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SOBRETASAS.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-SOBRE-W      TO MSJ2-HTML
006680        MOVE "BOM020"         TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-PRINTER.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-PRINTER-W    TO MSJ2-HTML
006680        MOVE "BOM020"         TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON MOVIMIENTO-DIARIO.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-MOV-W        TO MSJ2-HTML
006680        MOVE "BOM020"         TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

001105
001150 END DECLARATIVES.
001160
001161 INICIAR-IIS.
001162     MOVE LOW-VALUE TO COBW3.
001163     MOVE FUNCTION ADDR(ISAPI-CTX-CNT) TO COBW3-CONTEXT.
001164     CALL "COBW3_INIT" USING COBW3.
001220
001221 LEER-DATO-HTML.
001852     MOVE "datosh" TO COBW3-SEARCH-DATA.
001853     CALL "COBW3_GET_VALUE" USING COBW3.
001854     MOVE COBW3-GET-DATA    TO LINEA-LLEGAD-W.

           INITIALIZE DATO-LLEGADA-W

           UNSTRING LINEA-LLEGAD-W DELIMITED BY "|"
              INTO SESION-LLEGAD-W, DIRECTORIO-LLEGAD-W, CARPTA-LLEGAD-W, NRO-COMB-LLEGAD-W, SW-LIB
           END-UNSTRING.

           MOVE SESION-LLEGAD-W   TO LLAVE-SESION-W.

001238 INICIAR-SESION.
001245     MOVE "D:\WEB\MAIN-ELECT\DATOS\SC-SESION.DAT" TO NOM-SESION-W
001246
000820     MOVE FUNCTION CURRENT-DATE TO FECHA-TOTAL.
000830     ACCEPT HORA-TOTAL FROM TIME.
000810     GO TO VALIDAR-SESION.
000850
000860 FIN-VALIDAR-SESION.

001303 ABRIR-USUARIO.
001304     MOVE "D:\WEB\MAIN-ELECT\DATOS\SC-ARCHUSU.DAT" TO NOM-USU-W
001305
001306     OPEN INPUT ARCHIVO-USUNET
001307     EVALUATE OTR-STAT
001308       WHEN "00"  CONTINUE
001309       WHEN "35"  OPEN OUTPUT ARCHIVO-USUNET
001310                  CLOSE       ARCHIVO-USUNET
001311                  OPEN I-O    ARCHIVO-USUNET
001312                  INITIALIZE REG-USUNET
001314                  WRITE REG-USUNET
001315                  CLOSE       ARCHIVO-USUNET
001316                  MOVE "Validacion de usuarios"      TO MSJ1-HTML
001317                  MOVE "Falta configurar usuario"    TO MSJ2-HTML
001318                  MOVE "Sc"                          TO MSJ3-HTML
001319                  GO TO ENVIAR2-ERROR
001320       WHEN OTHER GO TO CERRAR-SESION
001321     END-EVALUATE.
001322
001332     INITIALIZE REG-USUNET.

007110 LEER-USUARIO.
007120     READ ARCHIVO-USUNET NEXT AT END MOVE 0 TO SW-FIN.
007130
007140     CLOSE ARCHIVO-USUNET.
007200     
007210     IF NOMBRE-USUNET = SPACES
007220     OR NIT-USUNET = ZEROS
007230        MOVE "Validacion de Sesion"        TO MSJ1-HTML
007240        MOVE "Falta configurar usuarios"   TO MSJ2-HTML
007250        MOVE "Sc"                          TO MSJ3-HTML
007260        GO TO ENVIAR2-ERROR
007270     END-IF.

       INICIAR-RESTRICION.
           INSPECT IP-DATOS-USUNET REPLACING FIRST "/" BY "\"
001614     INITIALIZE NOM-USUAR-W NOM-COMBU-W NOM-SURT-W NOM-ART-W NOM-SOBRE-W NOM-MOV-W
001615     MOVE "\\" TO NOM-USUAR-W
001616
001617     INSPECT NOM-USUAR-W REPLACING FIRST "                    "
001618                                    BY IP-DATOS-USUNET
001621     INSPECT NOM-USUAR-W REPLACING FIRST " "
001624                                     BY "\"
007292     INSPECT NOM-USUAR-W REPLACING FIRST "                              "
007293                                     BY DIRECTORIO-LLEGAD-W

           MOVE NOM-USUAR-W  TO  NOM-COMBU-W NOM-SURT-W NOM-ART-W NOM-SOBRE-W NOM-MOV-W

007190     INSPECT NOM-USUAR-W   REPLACING FIRST "                       "
007200                                        BY "\CONTROL\SC-ARCHUSU.DAT".

           INSPECT NOM-COMBU-W REPLACING FIRST "                       "
                                            BY "\CONTROL\SC-ARCOMBU.DAT".

           INSPECT NOM-SURT-W   REPLACING FIRST "                       "
                                             BY "\CONTROL\SC-ARCHSUR.DAT".

           INSPECT NOM-ART-W    REPLACING FIRST "                       "
                                             BY "\CONTROL\SC-MAESART.DAT".

           INSPECT NOM-SOBRE-W  REPLACING FIRST "                       "
                                             BY "\CONTROL\SC-ARCHSOB.DAT".

       LEER-USUARIO.

           OPEN INPUT ARCHIVO-USUARIOS
           READ ARCHIVO-USUARIOS NEXT WITH NO LOCK AT END 
                CLOSE ARCHIVO-USUARIOS
           END-READ.

           EVALUATE PUC-USU
               WHEN 1 MOVE "1305" TO MAY-DEUD
               WHEN 2 MOVE "1505" TO MAY-DEUD
               WHEN 4 MOVE "1470" TO MAY-DEUD
           END-EVALUATE.

           MOVE "C:\PROSOFT\PRINTER.SC" TO NOM-PRINTER-W.
           OPEN INPUT ARCHIVO-PRINTER.

           READ ARCHIVO-PRINTER NEXT WITH NO LOCK AT END 
                CLOSE ARCHIVO-PRINTER
           END-READ.


           OPEN INPUT ARCHIVO-COMBUSTIBLES
                      ARCHIVO-SOBRETASAS
                      ARCHIVO-SURTIDORES
                      MAESTRO-ARTICULOS.

       LEER-FACTURA.
           MOVE NRO-COMB-LLEGAD-W  TO NRO-COMB.

           READ ARCHIVO-COMBUSTIBLES WITH NO LOCK 
                INVALID KEY 
                        MOVE "99"          TO MSJ1-HTML
                        MOVE "No existe "  TO MSJ2-HTML
                        MOVE "BOM020"      TO MSJ3-HTML
                        GO TO ENVIAR2-ERROR
           END-READ.

       DATOS-MOVIMIENTO.

           EVALUATE MES-COMB
               WHEN 01 MOVE "\ENE\SC-ARCHMOV.DAT" TO MES-ARCHIVO
               WHEN 02 MOVE "\FEB\SC-ARCHMOV.DAT" TO MES-ARCHIVO
               WHEN 03 MOVE "\MAR\SC-ARCHMOV.DAT" TO MES-ARCHIVO
               WHEN 04 MOVE "\ABR\SC-ARCHMOV.DAT" TO MES-ARCHIVO
               WHEN 05 MOVE "\MAY\SC-ARCHMOV.DAT" TO MES-ARCHIVO
               WHEN 06 MOVE "\JUN\SC-ARCHMOV.DAT" TO MES-ARCHIVO
               WHEN 07 MOVE "\JUL\SC-ARCHMOV.DAT" TO MES-ARCHIVO
               WHEN 08 MOVE "\AGT\SC-ARCHMOV.DAT" TO MES-ARCHIVO
               WHEN 09 MOVE "\SEP\SC-ARCHMOV.DAT" TO MES-ARCHIVO
               WHEN 10 MOVE "\OCT\SC-ARCHMOV.DAT" TO MES-ARCHIVO
               WHEN 11 MOVE "\NOV\SC-ARCHMOV.DAT" TO MES-ARCHIVO
               WHEN 12 MOVE "\DIC\SC-ARCHMOV.DAT" TO MES-ARCHIVO
           END-EVALUATE.

           INSPECT NOM-MOV-W REPLACING FIRST "                   "
                                          BY MES-ARCHIVO.


           MOVE "1B"       TO LOTE-MOV.
           MOVE NRO-COMB-LLEGAD-W TO COMPROB-MOV.
           MOVE LLAVE-COMP-MOV TO LLAVE-W.

           OPEN I-O MOVIMIENTO-DIARIO.

       BUSCAR-MOVIMIENTO.
           START MOVIMIENTO-DIARIO KEY = LLAVE-COMP-MOV
                 INVALID KEY GO TO FIN-BORRAR-MOV
           END-START.

       BORRAR-MOV.
           READ MOVIMIENTO-DIARIO NEXT WITH NO LOCK AT END GO TO FIN-BORRAR-MOV.

           IF LLAVE-COMP-MOV =  LLAVE-W
              CONTINUE
           ELSE
              GO TO FIN-BORRAR-MOV
           END-IF.

           IF MAYOR-MOV = MAY-DEUD AND VALOR-MOV > 0
              MOVE 0 TO SW-BUSCAR
              PERFORM BUSCAR-MARCA VARYING I FROM 1 BY 1
                                     UNTIL I > 200 OR SW-BUSCAR = 1
           END-IF.

           DELETE MOVIMIENTO-DIARIO

           GO TO BORRAR-MOV.

       FIN-BORRAR-MOV.
           CLOSE MOVIMIENTO-DIARIO.

       LLENAR-BASICOS.
           MOVE LLAVE-W          TO LLAVE-COMP-MOV.
           MOVE 6                TO ID-MOV
           MOVE 0                TO TIP-DOC-MOV.
           MOVE 0                TO SECU-W.
           MOVE COMPROB-MOV      TO NRO-DOC-MOV.
           MOVE FECHA-COMB       TO FECHA-MOV.
           MOVE "COMBUS"         TO REFER-MOV.

       REVISAR-CODIGO.
           INITIALIZE VARIABLES.
           PERFORM REGISTRO-MOVIMIENTO VARYING I FROM  1 BY 1
                                                 UNTIL I > 15.
           INITIALIZE DOCUM-MOV
           MOVE "STASA"  TO REFER-MOV
           MOVE "TOTAL SOBREATASA COBRADA" TO DETALLE-MOV

           PERFORM GRABAR-SOBRETASA VARYING J  FROM 1 BY 1
                                               UNTIL J > 5.





           MOVE "GLOB."  TO REFER-MOV
           MOVE "TOTAL IMP.GLOBAL COBRADO" TO DETALLE-MOV

           PERFORM GRABAR-GLOBAL VARYING J  FROM  1 BY 1
                                            UNTIL J > 5.


       LEER-DEUDORES.
           MOVE "VALE"   TO REFER-MOV.
           PERFORM TABLA-DEUDORES VARYING I FROM 1 BY 1
                                           UNTIL I > 200.


       GRABAR-FINANCIACION.
           IF VALOR-FINANC-COMB = 0
              GO TO TOTAL-FACTURA
           END-IF.

           MOVE "42109500001" TO CUENTA-MOV.
           MOVE "FINANC"      TO REFER-MOV.
           COMPUTE VALOR-MOV = VALOR-FINANC-COMB * -1.
           MOVE 6             TO ID-MOV.
           MOVE "VENTA"       TO REFER-MOV.
           MOVE "VALOR FINANCIACION" TO DETALLE-MOV.
           IF COSTO-DEUD-USU = "S"
              MOVE C-COSTO-SURTI     TO COSTO-MOV
           ELSE
              MOVE "00"              TO COSTO-MOV
           END-IF
           PERFORM GRABAR-MOVIMIENTO.

       TOTAL-FACTURA.
           MOVE "NETO"         TO REFER-MOV.

           EVALUATE NIT-USU
      * LUBRICOM
               WHEN 844004680
                    IF SUCURSAL-PRN = 05
                       MOVE "11050500002"  TO CUENTA-MOV
                    ELSE
                       MOVE "11050500001"  TO CUENTA-MOV
                    END-IF
      * TRANS UNIDOS
               WHEN 844003380 MOVE "11050500005" TO CUENTA-MOV
      * ESTACION LA LLANERITA
               WHEN 822007669 MOVE "11050500002" TO CUENTA-MOV
               WHEN OTHER     MOVE "11050500001" TO CUENTA-MOV
           END-EVALUATE.

           MOVE 6 TO ID-MOV.
           COMPUTE VALOR-MOV = VALOR-NETO-COMB + VALOR-CHEQUE.
           MOVE "VENTA DE CONTADO" TO DETALLE-MOV.
           IF COSTO-DEUD-USU = "S"
              MOVE C-COSTO-SURTI     TO COSTO-MOV
           ELSE
              MOVE "0000"            TO COSTO-MOV
           END-IF
           PERFORM GRABAR-MOVIMIENTO.

       CERRAR-ARCHIVOS.

           CLOSE ARCHIVO-COMBUSTIBLES
                 ARCHIVO-SOBRETASAS
                 ARCHIVO-SURTIDORES
                 MAESTRO-ARTICULOS.

002147 ENVIO-DATOS.
004378     MOVE "datosrecibidos"  TO COBW3-CNV-NAME
004393     MOVE 00            TO COBW3-CNV-VALUE
004403     CALL "COBW3_SET_CNV"   USING COBW3
004413     MOVE "../PAGINAS/RECIBIDOS.ASPX"  TO SALIDA-HTML
004430     PERFORM ABRIR-HTML.

002545 CERRAR-SESION.
002546     CALL "COBW3_FREE" USING COBW3.
002547     MOVE 1 TO PROGRAM-STATUS.
002548     EXIT PROGRAM.

       REGISTRO-MOVIMIENTO.
             IF VALOR-COMB (I) = ZERO
                CONTINUE
             ELSE
                PERFORM LEER-SURTIDOR
             END-IF.

       LEER-SURTIDOR.

           MOVE SURTIDOR-COMB (I)  TO COD-SURTI
           READ ARCHIVO-SURTIDORES WITH NO LOCK
                INVALID KEY MOVE SPACES TO C-COSTO-SURTI
           END-READ

           IF C-COSTO-SURTI = SPACES
              MOVE "0000"   TO C-COSTO-SURTI
           END-IF

           INITIALIZE ART-W.

           MOVE ARTICULO-COMB (I)  TO COD-ART-W.

           MOVE ART-W              TO COD-ART.
           READ MAESTRO-ARTICULOS WITH NO LOCK
                INVALID KEY MOVE ZEROS TO DATOS-ART
           END-READ

           MOVE GRUPO-ART    TO GRUPO-SOBRE.
           MOVE NUMERO-ART   TO COD-ART-SOBRE.
           READ ARCHIVO-SOBRETASAS WITH NO LOCK
                INVALID KEY 
                        MOVE SPACES TO CTA-SOBRE CTA-GLOBAL-SOBRE
           END-READ

           IF CTA-SOBRE = SPACES
              MOVE "28150500001" TO CTA-SOBRE
           END-IF

           MOVE 0 TO SW-BUSCAR.
           PERFORM ASIGNAR-SOBRETASA VARYING J FROM 1 BY 1
                                     UNTIL J > 5 OR SW-BUSCAR = 1.

           IF SW-BUSCAR = 0
              PERFORM CREAR-SOBRETASA VARYING J FROM 1 BY 1
                                     UNTIL J > 5 OR SW-BUSCAR = 1
           END-IF

           IF CTA-GLOBAL-SOBRE = SPACES
              MOVE "28150500020" TO CTA-GLOBAL-SOBRE
           END-IF

           MOVE 0 TO SW-BUSCAR.
           PERFORM ASIGNAR-GLOBAL VARYING J FROM 1 BY 1
                                  UNTIL J > 5 OR SW-BUSCAR = 1.
           IF SW-BUSCAR = 0
              PERFORM CREAR-GLOBAL VARYING J FROM 1 BY 1
                                   UNTIL J > 5 OR SW-BUSCAR = 1
           END-IF.

           MOVE CTA-ART TO CUENTA-MOV.
           COMPUTE VALOR-MOV = VALOR-COMB (I) * -1.

           MOVE VALOR-MOV TO VALOR-EDIT

           MOVE C-COSTO-SURTI     TO COSTO-MOV.
           MOVE SURTIDOR-COMB (I) TO SURTIDOR-DET
           MOVE ARTICULO-COMB (I) TO ARTICULO-DET
           MOVE CANTIDAD-COMB (I) TO CANT-EDIT
           MOVE CANT-EDIT         TO CANTIDAD-DET
           MOVE "GLNS"            TO OTROS-DET.
           MOVE PLACA-COMB    (I) TO PLACA-DET.


           IF VALOR-MOV IS NOT ZERO
              PERFORM GRABAR-MOVIMIENTO
           END-IF.


       GRABAR-MOVIMIENTO.
             OPEN I-O MOVIMIENTO-DIARIO.
             ADD 1 TO SECU-W.
             CALL "CON910" USING SECU-W SECU-MOV.

             WRITE MOV-DIARIO END-WRITE
             CLOSE MOVIMIENTO-DIARIO.


       TABLA-DEUDORES.
           IF VLR-DEU-COMB (I) IS NOT ZERO
              MOVE COD-DEU-COMB (I) TO CUENTA-MOV
              MOVE NIT-DEU-COMB (I) TO ID-MOV
              MOVE DOC-DEU-COMB (I) TO DOCUM-MOV
              MOVE VLR-DEU-COMB (I) TO VALOR-MOV
              IF ART-DEU-COMB (I) = SPACES
                 MOVE "VENTA A CREDITO" TO DETALLE-MOV
              ELSE
                 MOVE "VL"              TO SURTIDOR-DET
                 MOVE ART-DEU-COMB  (I) TO ARTICULO-DET
                 MOVE CANT-DEU-COMB (I) TO CANT-EDIT
                 MOVE CANT-EDIT         TO CANTIDAD-DET
                 MOVE "GLNS"            TO OTROS-DET
                 MOVE PLACA-COMB    (I) TO PLACA-DET
                 MOVE DETALLE-W         TO DETALLE-MOV
              END-IF
              IF SW-LIB = "S"
                 MOVE " " TO FLUJO1-MOV
              ELSE
                 MOVE MARCA-COMB (I) TO FLUJO1-MOV
              END-IF
              IF COSTO-DEUD-USU = "S"
                 MOVE C-COSTO-SURTI     TO COSTO-MOV
              ELSE
                 MOVE "0000"            TO COSTO-MOV
              END-IF
              PERFORM GRABAR-MOVIMIENTO
           END-IF.


       ASIGNAR-SOBRETASA.

           IF CTA-SOBRE = CTA-SOBRE-TAB (J)
              MOVE 1 TO SW-BUSCAR
              ADD SOBRET-COMB (I) TO TOT-SOBRETASA (J)
           END-IF.

       CREAR-SOBRETASA.

           IF CTA-SOBRE-TAB (J) = SPACES
              MOVE 1 TO SW-BUSCAR
              MOVE CTA-SOBRE TO CTA-SOBRE-TAB (J)
              MOVE SOBRET-COMB (I) TO TOT-SOBRETASA (J)
           END-IF.

       GRABAR-SOBRETASA.
           IF TOT-SOBRETASA (J) > 0
              MOVE CTA-SOBRE-TAB (J) TO CUENTA-MOV
              COMPUTE VALOR-MOV = TOT-SOBRETASA (J) * -1

              IF COSTO-DEUD-USU = "S"
                 MOVE C-COSTO-SURTI     TO COSTO-MOV
              ELSE
                 MOVE "0000"            TO COSTO-MOV
              END-IF

              MOVE VALOR-MOV    TO VALOR-EDIT
              PERFORM GRABAR-MOVIMIENTO
           END-IF.

       ASIGNAR-GLOBAL.

           IF CTA-GLOBAL-SOBRE = CTA-GLOBAL-TAB (J)
              MOVE 1 TO SW-BUSCAR
              ADD GLOBAL-COMB (I) TO TOT-GLOBAL (J)
           END-IF.

       CREAR-GLOBAL.

           IF CTA-GLOBAL-TAB (J) = SPACES
              MOVE 1 TO SW-BUSCAR
              MOVE CTA-GLOBAL-SOBRE TO CTA-GLOBAL-TAB  (J)
              MOVE GLOBAL-COMB (I)  TO TOT-GLOBAL      (J)
           END-IF.

       GRABAR-GLOBAL.
           IF TOT-GLOBAL (J) > 0
              MOVE CTA-GLOBAL-TAB (J) TO CUENTA-MOV
              COMPUTE VALOR-MOV = TOT-GLOBAL (J) * -1

              IF COSTO-DEUD-USU = "S"
                 MOVE C-COSTO-SURTI     TO COSTO-MOV
              ELSE
                 MOVE "0000"            TO COSTO-MOV
              END-IF

              PERFORM GRABAR-MOVIMIENTO
           END-IF.


       BUSCAR-MARCA.
           IF DOCUM-MOV = DOC-DEU-COMB (I) AND ID-MOV = NIT-DEU-COMB (I)
              MOVE 1 TO SW-BUSCAR
              MOVE FLUJO1-MOV TO MARCA-COMB (I)
           END-IF.

002566 COPY "P:\PROG\PROYECT\FUENTES\SC-WEB.CBL".
002567
