000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. BOM031.
000030*   FACTURACION - ANULA INVENTARIOS DE COMBUSTIBLES.
000040 ENVIRONMENT     DIVISION.
000050 INPUT-OUTPUT SECTION.
000060 FILE-CONTROL. 
000070
000080     SELECT MOVIMIENTO-INVENT LOCK MODE IS AUTOMATIC
000090            ASSIGN NOM-INV-W
000100            ORGANIZATION IS INDEXED;
000110            ACCESS MODE IS DYNAMIC
000120            RECORD KEY IS LLAVE-INV
000130            ALTERNATE RECORD KEY COD-ART-INV   WITH DUPLICATES
000140            ALTERNATE RECORD KEY SECUENCIA-INV
000150            ALTERNATE RECORD KEY NIT-INV           WITH DUPLICATES
000160            ALTERNATE RECORD KEY FECHA-INV         WITH DUPLICATES
000170            ALTERNATE RECORD KEY LLAVE-DOC-CTL-INV WITH DUPLICATES
000180            FILE STATUS IS OTR-STAT.
000190
000200
000210     SELECT ARCHIVO-SALDOS LOCK MODE IS AUTOMATIC
000220            ASSIGN NOM-SALD-W
000230            ORGANIZATION INDEXED;
000240            ACCESS MODE  DYNAMIC;
000250            RECORD KEY LLAVE-SAL
000260            ALTERNATE RECORD KEY COD-ART-SAL  WITH DUPLICATES
000270            ALTERNATE RECORD KEY COD-LOTE-SAL WITH DUPLICATES
000280            FILE STATUS IS OTR-STAT.
000290
000300 DATA DIVISION.
000310 FILE SECTION.
000320 COPY "P:\PROG\PROYECT\FUENTES\FD-INVEN.CBL".
000330 COPY "P:\PROG\PROYECT\FUENTES\FD-SALDO.CBL".
000340
000350 WORKING-STORAGE SECTION.
000360 COPY "P:\PROG\PROYECT\FUENTES\WEB-CARAC.CBL".
000370 
000380 77 NOM-INV-W               PIC X(70).
000390 77 NOM-SALD-W              PIC X(70).
000400 77 MES-ARCHIVO             PIC X(4).
000410 77 LLAVE-W                 PIC X(9).
000420
000430 LINKAGE SECTION.
000440
000450 01 NOMBRE-LNK               PIC X(50).
000460 01 INVALID-007              PIC 99.
000470
000480 01 NRO-FACT-W               PIC 9(6).
000490 01 FECHA-FACT.
000500    02 ANO-FACT              PIC 99.
000510    02 MES-FACT              PIC 99.
000520    02 DIA-FACT              PIC 99.
000530
000540 01 MENSAJE-W                PIC X(30).
000550
000560 PROCEDURE DIVISION USING NOMBRE-LNK INVALID-007 NRO-FACT-W FECHA-FACT MENSAJE-W.
000570
000580 DECLARATIVES.                    
000590 I-O-TEST SECTION.
000600     USE AFTER EXCEPTION PROCEDURE ON MOVIMIENTO-INVENT.
000610 ESCR-EXCEPTIONES.
000620     IF OTR-STAT = "00"
000630        CONTINUE
000640     ELSE
000650        MOVE OTR-STAT   TO INVALID-007  
000660        MOVE NOM-INV-W  TO MENSAJE-W     
000670        GO TO SALIR
000680     END-IF.
000690
000700 I-O-TEST SECTION.
000710     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SALDOS.
000720 ESCR-EXCEPTIONES.
000730     IF OTR-STAT = "00"
000740        CONTINUE
000750     ELSE
000760        MOVE OTR-STAT   TO INVALID-007  
000770        MOVE NOM-SALD-W TO MENSAJE-W     
000780        GO TO SALIR
000790     END-IF.
000800
000810
000820 END DECLARATIVES.
000830 PROCEDURAL SECTION.
000840                               	 	
000850 ASIGNAR-NOMBRE.
000860
000870     MOVE NOMBRE-LNK TO NOM-INV-W
000880
000890     EVALUATE MES-FACT
000900         WHEN 01 MOVE "\ENE" TO MES-ARCHIVO 
000910         WHEN 02 MOVE "\FEB" TO MES-ARCHIVO 
000920         WHEN 03 MOVE "\MAR" TO MES-ARCHIVO 	
000930         WHEN 04 MOVE "\ABR" TO MES-ARCHIVO 
000940         WHEN 05 MOVE "\MAY" TO MES-ARCHIVO 
000950         WHEN 06 MOVE "\JUN" TO MES-ARCHIVO 
000960         WHEN 07 MOVE "\JUL" TO MES-ARCHIVO 
000970         WHEN 08 MOVE "\AGT" TO MES-ARCHIVO 
000980         WHEN 09 MOVE "\SEP" TO MES-ARCHIVO 
000990         WHEN 10 MOVE "\OCT" TO MES-ARCHIVO 
001000         WHEN 11 MOVE "\NOV" TO MES-ARCHIVO 
001010         WHEN 12 MOVE "\DIC" TO MES-ARCHIVO
001020     END-EVALUATE.
001030
001040     INSPECT NOM-INV-W REPLACING FIRST "    "
001050                                    BY MES-ARCHIVO.
001060
001070     MOVE NOM-INV-W    TO NOM-SALD-W
001080     INSPECT NOM-INV-W REPLACING FIRST "              "
001090                                    BY "\SC-MOVINV.DAT".
001100
001110     INSPECT NOM-SALD-W REPLACING FIRST "             "
001120                                     BY "\SC-SALDO.DAT".
001130
001140
001150 ABRIR-ARCHIVOS.
001160     OPEN I-O   MOVIMIENTO-INVENT.
001170
001180 LEER-FACTURA.
001190     MOVE "2B"        TO COD-TRANS-INV.
001200     MOVE NRO-FACT-W  TO COMPROB-INV.
001210     MOVE "4"         TO SUC-TRANS-INV.
001220
001230 BUSCAR-MOVIMIENTO.
001240     MOVE FECHA-FACT  TO FECHA-INV
001250     START MOVIMIENTO-INVENT KEY >= FECHA-INV
001260           INVALID KEY 
001270                   MOVE "99"     TO INVALID-007
001280                   MOVE "No se encontro mov. invent" TO MENSAJE-W
001290                   GO TO SALIR
001300     END-START.
001310
001320     MOVE LLAVE-SEC-INV TO LLAVE-W.
001330
001340 LEER-INVENTARIOS.
001350     READ MOVIMIENTO-INVENT NEXT WITH NO LOCK AT END GO TO FINALIZAR.
001360
001370     IF LLAVE-SEC-INV = LLAVE-W
001380        CONTINUE
001390     ELSE
001400        GO TO FINALIZAR
001410     END-IF
001420
001430     DELETE MOVIMIENTO-INVENT
001440     PERFORM BORRAR-SALDO
001450
001460     GO TO LEER-INVENTARIOS.
001470
001480 BORRAR-SALDO.
001490     INITIALIZE REG-SALDOS
001500     MOVE LLAVE-ART-INV TO LLAVE-SAL
001510     OPEN I-O ARCHIVO-SALDOS.
001520
001530     READ ARCHIVO-SALDOS WITH NO LOCK
001540          INVALID KEY
001550                  WRITE REG-SALDOS
001560     END-READ
001570
001580     SUBTRACT CANT-INV FROM ACUM-SAL-CANT (1).
001590     SUBTRACT VLR-INV  FROM ACUM-SAL-VLR (1).
001600
001610     REWRITE REG-SALDOS.
001620     CLOSE   ARCHIVO-SALDOS.
001630
001640
001650 FINALIZAR.
001660     MOVE 00        TO INVALID-007.
001670
001680 CERRAR-ARCHIVOS.
001690     CLOSE MOVIMIENTO-INVENT.
001700
001710
001720 SALIR.
001730     EXIT PROGRAM.
001740
