000012*CONSULTA DATOS DEL USUARIO
000020 IDENTIFICATION DIVISION.
000021* PROGRAM-ID. "BOM000".
000022
000023 PROGRAM-ID. "HttpExtensionProc".
000024 ENVIRONMENT DIVISION.
000025 CONFIGURATION SECTION.
000026 INPUT-OUTPUT SECTION.
000027 FILE-CONTROL.
000080 COPY "P:\PROG\PROYECT\FUENTES\FS-USUNET.CBL".
000150 COPY "P:\PROG\PROYECT\FUENTES\FS-SESION.CBL".

           SELECT ARCHIVO-USUARIOS LOCK MODE IS AUTOMATIC
                  ASSIGN TO NOM-USUAR-W
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC;
                  RECORD KEY IS NOMBRE-USU
                  ALTERNATE RECORD KEY IS CTL-USU     WITH DUPLICATES
                  ALTERNATE RECORD KEY IS CLAVE-USU   WITH DUPLICATES
                  ALTERNATE RECORD KEY IS CLAVE-2-USU WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.



000400 DATA DIVISION.
000410 FILE SECTION.
000420 COPY "P:\PROG\PROYECT\FUENTES\FD-USUNET.CBL".
000421 COPY "P:\PROG\PROYECT\FUENTES\FD-SESION.CBL".
000450 COPY "P:\PROG\PROYECT\FUENTES\FD-USUAR.CBL".

000540 WORKING-STORAGE  SECTION.
000550 COPY "P:\PROG\PROYECT\FUENTES\COBW3.CBL".
000560 COPY "P:\PROG\PROYECT\FUENTES\WEB-CARAC.CBL".

000570 01 NOM-SURT-W            PIC X(70).
       01 NOM-USUAR-W            PIC X(70).

000590 01 EDITADO-W              PIC X(15).
000600 01 COD-USER-W             PIC X(15).
000622 01 CLAVE-CTL              PIC X(15).
000633 01  DATO-W.
000635     02 CLAVE-W            PIC X(15).


       77 GALONAJE-W             PIC ZZZZZZZZZZ,ZZZ.
       77 DESCTO-W               PIC ZZZZZZZZZZZZ,ZZZ.

       01 LINEA-LLEGAD-W             PIC X(100).

       01 DATO-LLEGADA-W.
          02 SESION-LLEGAD-W        PIC X(29).
          02 DIRECTORIO-LLEGAD-W    PIC X(30).
          02 CARPTA-LLEGAD-W        PIC X(9).

       01 DATOS-ENVIO.
          02 ESTADO-ENV         PIC XX.
          02 FILLER             PIC X VALUE "|".
          02 DETALLE-ENV        PIC X(50).
          02 FILLER             PIC X VALUE "|".
          02 NIT-ENV            PIC X(10).
          02 FILLER             PIC X VALUE "|".
          02 CLAVE-ENV          PIC X(6).
          02 FILLER             PIC X VALUE "|".
          02 CLAVE2-ENV         PIC X(6).
          02 FILLER             PIC X VALUE "|".
          02 PESOS-ENV          PIC X(12).
          02 FILLER             PIC X VALUE "|".
          02 ALM-ENV            PIC X(5).
          02 FILLER             PIC X VALUE "|".
          02 C-COST-ENV         PIC X(4).
          02 FILLER             PIC X VALUE "|".
          02 SUCURSAL-ENV       PIC X.
          02 FILLER             PIC X VALUE "|".
          02 INVENT-ENV         PIC X.
          02 FILLER             PIC X VALUE "|".
          02 NOMBRE-ALTE-ENV    PIC X(30).
          02 FILLER             PIC X VALUE "|".
          02 IVA-S-ENV          PIC X.
          02 FILLER             PIC X VALUE "|".
          02 IVA1-ENV           PIC XX.
          02 FILLER             PIC X VALUE "|".
          02 IVA2-ENV           PIC XX.
          02 FILLER             PIC X VALUE "|".
          02 IVA3-ENV           PIC XX.
          02 FILLER             PIC X VALUE "|".
          02 ASUME-IVA-ENV      PIC X.
          02 FILLER             PIC X VALUE "|".
          02 BARRAS-ENV         PIC X.
          02 FILLER             PIC X VALUE "|".
          02 RESTRIC-EX-ENV     PIC X.
          02 FILLER             PIC X VALUE "|".
          02 ASUME-VLR-ENV      PIC X.
          02 FILLER             PIC X VALUE "|".
          02 LIMIT-VENTA-ENV    PIC X.
          02 FILLER             PIC X VALUE "|".
          02 TIP-CAJ-ENV        PIC X.
          02 FILLER             PIC X VALUE "|".
          02 CUOTAS-ENV         PIC X.
          02 FILLER             PIC X VALUE "|".





000730 01 COD-TMP.
000740    02 SW-ALFA             PIC 9.
000750    02 TABLA-COD1.
000760       03 COD1-PAC         PIC X OCCURS 15.
000770    02 TABLA-COD2.
000780       03 COD2-PAC         PIC X OCCURS 15.
000790
000791 LINKAGE SECTION.
000792 COPY "P:\PROG\PROYECT\FUENTES\ISAPICTX.CBL".
000793
000794 PROCEDURE DIVISION WITH stdcall LINKAGE USING ISAPI-CTX-CNT.
000795
000810 DECLARATIVES.
000811 I-O-TEST SECTION.
000812     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUNET.         
000813 ESCR-EXCEPTIONES.
000814     IF OTR-STAT = "00" OR "35"
000815        CONTINUE 
000816     ELSE
000817        MOVE OTR-STAT                TO MSJ1-HTML
000818        MOVE NOM-USU-W               TO MSJ2-HTML
000819        MOVE "BOM000"                TO MSJ3-HTML
000820        GO TO ENVIAR2-ERROR
000821     END-IF.
001030
001040 I-O-TEST SECTION.
001050     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SESION.         
001060 ESCR-EXCEPTIONES.
001070     IF OTR-STAT = "00"
001080        CONTINUE
001090     ELSE
001100        MOVE OTR-STAT                TO MSJ1-HTML
001101        MOVE NOM-SESION-W            TO MSJ2-HTML
001102        MOVE "BOM000"                TO MSJ3-HTML
001103        GO TO ENVIAR2-ERROR
001104     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUARIOS.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-USUAR-W      TO MSJ2-HTML
006680        MOVE "BOM000"         TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

001105
001150 END DECLARATIVES.
001160
001161 INICIAR-IIS.
001162     MOVE LOW-VALUE TO COBW3.
001163     MOVE FUNCTION ADDR(ISAPI-CTX-CNT) TO COBW3-CONTEXT.
001164     CALL "COBW3_INIT" USING COBW3.
001220
001221 LEER-DATO-HTML.
001852     MOVE "datosh" TO COBW3-SEARCH-DATA.
001853     CALL "COBW3_GET_VALUE" USING COBW3.
001854     MOVE COBW3-GET-DATA    TO LINEA-LLEGAD-W.

           UNSTRING LINEA-LLEGAD-W DELIMITED BY "|"
              INTO SESION-LLEGAD-W, DIRECTORIO-LLEGAD-W, CARPTA-LLEGAD-W
           END-UNSTRING.

           MOVE SESION-LLEGAD-W    TO LLAVE-SESION-W.
           MOVE FUNCTION CURRENT-DATE TO FECHA-TOTAL.
           ACCEPT HORA-TOTAL FROM TIME.

001238 INICIAR-SESION.
001245     MOVE "D:\WEB\MAIN-ELECT\DATOS\SC-SESION.DAT" TO NOM-SESION-W
001246
000810     GO TO VALIDAR-SESION.
000850
000860 FIN-VALIDAR-SESION.

001303 ABRIR-USUARIO.
001304     MOVE "D:\WEB\MAIN-ELECT\DATOS\SC-ARCHUSU.DAT" TO NOM-USU-W
001305
001306     OPEN INPUT ARCHIVO-USUNET
001307     EVALUATE OTR-STAT
001308       WHEN "00"  CONTINUE
001309       WHEN "35"  OPEN OUTPUT ARCHIVO-USUNET
001310                  CLOSE       ARCHIVO-USUNET
001311                  OPEN I-O    ARCHIVO-USUNET
001312                  INITIALIZE REG-USUNET
001314                  WRITE REG-USUNET
001315                  CLOSE       ARCHIVO-USUNET
001316                  MOVE "Validacion de usuarios"      TO MSJ1-HTML
001317                  MOVE "Falta configurar usuario"    TO MSJ2-HTML
001318                  MOVE "Sc"                          TO MSJ3-HTML
001319                  GO TO ENVIAR2-ERROR
001320       WHEN OTHER GO TO CERRAR-SESION
001321     END-EVALUATE.
001322
001332     INITIALIZE REG-USUNET.

007110 LEER-USUARIO.
007120     READ ARCHIVO-USUNET NEXT AT END MOVE 0 TO SW-FIN.
007130
007140     CLOSE ARCHIVO-USUNET.
007200     
007210     IF NOMBRE-USUNET = SPACES
007220     OR NIT-USUNET = ZEROS
007230        MOVE "Validacion de Sesion"        TO MSJ1-HTML
007240        MOVE "Falta configurar usuarios"   TO MSJ2-HTML
007250        MOVE "Sc"                          TO MSJ3-HTML
007260        GO TO ENVIAR2-ERROR
007270     END-IF.

       INICIAR-RESTRICION.

           INSPECT IP-DATOS-USUNET REPLACING FIRST "/" BY "\"
001614     INITIALIZE NOM-USUAR-W
001615     MOVE "\\" TO NOM-USUAR-W
001616
001617     INSPECT NOM-USUAR-W REPLACING FIRST "                    "
001618                                    BY IP-DATOS-USUNET
001621     INSPECT NOM-USUAR-W REPLACING FIRST " "
001624                                     BY "\"
007292     INSPECT NOM-USUAR-W REPLACING FIRST "                              "
007293                                     BY DIRECTORIO-LLEGAD-W

007190     INSPECT NOM-USUAR-W   REPLACING FIRST "                       "
007200                                        BY "\CONTROL\SC-ARCHUSU.DAT".


        ABRIR-USUARIOS.
           OPEN INPUT ARCHIVO-USUARIOS.
           READ ARCHIVO-USUARIOS NEXT WITH NO LOCK AT END 
                CLOSE ARCHIVO-USUARIOS
           END-READ.


002147 ENVIO-DATOS.
           INITIALIZE DATOS-ENVIO

           IF NOMBRE-ALTERNO = SPACES OR NOMBRE-ALTERNO = NOMBRE-USU
                MOVE 1 TO SUCURSAL-ENV
           END-IF.

           MOVE 00               TO ESTADO-ENV
           MOVE NOMBRE-USU       TO DETALLE-ENV
           MOVE NIT-USU          TO NIT-ENV
           MOVE CLAVE-USU        TO CLAVE-ENV
           MOVE CLAVE-2-USU      TO CLAVE2-ENV
           MOVE INVENT-USU       TO INVENT-ENV
           MOVE NOMBRE-ALTERNO   TO NOMBRE-ALTE-ENV
           MOVE IVA-S-USU        TO IVA-S-ENV
           MOVE IVA-USU          TO IVA1-ENV
           MOVE IVA-2-USU        TO IVA2-ENV
           MOVE IVA-3-USU        TO IVA3-ENV
           MOVE ASUME-IVA-USU    TO ASUME-IVA-ENV
           MOVE BARRAS-USU       TO BARRAS-ENV
           MOVE RESTRIC-EX-USU   TO RESTRIC-EX-ENV
           MOVE ASUME-VLR-USU    TO ASUME-VLR-ENV
           MOVE LIMIT-VENTA-USU  TO LIMIT-VENTA-ENV
           MOVE TIP-CAJ-USU      TO TIP-CAJ-ENV
           MOVE CUOTAS-USU       TO CUOTAS-ENV.



004378     MOVE "datosrecibidos"  TO COBW3-CNV-NAME
004393     MOVE DATOS-ENVIO       TO COBW3-CNV-VALUE
004403     CALL "COBW3_SET_CNV"   USING COBW3
004413     MOVE "../PAGINAS/RECIBIDOS.ASPX"  TO SALIDA-HTML
004430     PERFORM ABRIR-HTML.

002545 CERRAR-SESION.
002546     CALL "COBW3_FREE" USING COBW3.
002547     MOVE 1 TO PROGRAM-STATUS.
002548     EXIT PROGRAM.
002549
002240 EDITAR-NUMERO.
002241     INSPECT EDITADO-W  CONVERTING  "ABCDEFGHIJKLMNOPQRSTUVWXYZ"
002242                                 TO "                          ".
002243
002244     MOVE EDITADO-W  TO TABLA-COD1.
002245     INITIALIZE    TABLA-COD2 SW-ALFA.
002246     MOVE 15 TO LP.
002247     PERFORM MOVER-COD VARYING LN FROM 15 BY -1
002248                         UNTIL LN < 1 OR LP < 1.
002249
002250     INSPECT TABLA-COD2 REPLACING ALL " " BY "0".
002251         
002252 MOVER-COD.
002253     IF COD1-PAC (LN) IS NUMERIC
002254     OR COD1-PAC (LN) = "-"     
002255        MOVE COD1-PAC (LN) TO COD2-PAC (LP)
002256        SUBTRACT 1 FROM LP
002257     END-IF.

002566 COPY "P:\PROG\PROYECT\FUENTES\SC-WEB.CBL".
002567
