000012* BOMBAS - CONSULTA DE DATOS DE SOBRETASAS
000020 IDENTIFICATION DIVISION.
000021* PROGRAM-ID. "BOM104_2".
000022
000023 PROGRAM-ID. "HttpExtensionProc".
000024 ENVIRONMENT DIVISION.
000025 CONFIGURATION SECTION.
000026 INPUT-OUTPUT SECTION.
000027 FILE-CONTROL.
000080 COPY "P:\PROG\PROYECT\FUENTES\FS-USUNET.CBL".
000150 COPY "P:\PROG\PROYECT\FUENTES\FS-SESION.CBL".


           SELECT ARCHIVO-USUARIOS LOCK MODE IS AUTOMATIC
                  ASSIGN TO NOM-USUAR-W
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC;
                  RECORD KEY IS NOMBRE-USU
                  ALTERNATE RECORD KEY IS CTL-USU     WITH DUPLICATES
                  ALTERNATE RECORD KEY IS CLAVE-USU   WITH DUPLICATES
                  ALTERNATE RECORD KEY IS CLAVE-2-USU WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.


           SELECT ARCHIVO-SURTIDORES LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-SURT-W
                  ORGANIZATION INDEXED;
                  ACCESS MODE  DYNAMIC;
                  RECORD KEY COD-SURTI
                  FILE STATUS  OTR-STAT.


           SELECT ARCHIVO-COMBUSTIBLES LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-COMBU-W
                  ORGANIZATION INDEXED;
                  ACCESS MODE DYNAMIC;
                  RECORD KEY IS LLAVE-COMB
                  ALTERNATE RECORD KEY IS FECHA-COMB WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.


           SELECT MAESTRO-ARTICULOS LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-ART-W
                  ORGANIZATION INDEXED;
                  ACCESS MODE  DYNAMIC;
                  RECORD KEY COD-ART
                  ALTERNATE RECORD KEY CLASE-ART       WITH DUPLICATES
                  ALTERNATE RECORD KEY COD-BARRAS-ART  WITH DUPLICATES
                  ALTERNATE RECORD KEY DESCRIP-ART     WITH DUPLICATES
                  ALTERNATE RECORD KEY USO-ART         WITH DUPLICATES
                  ALTERNATE RECORD KEY CL-ROTAC-ART    WITH DUPLICATES
                  ALTERNATE RECORD KEY UBICAC-ART      WITH DUPLICATES
                  ALTERNATE RECORD KEY FECHA-VENCE-ART WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.


           SELECT ARCHIVO-SOBRETASAS LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-SOBRE-W
                  ORGANIZATION INDEXED;
                  ACCESS MODE  DYNAMIC;
                  RECORD KEY ART-SOBRE
                  FILE STATUS IS OTR-STAT.


000400 DATA DIVISION.
000410 FILE SECTION.
000420 COPY "P:\PROG\PROYECT\FUENTES\FD-USUNET.CBL".
000421 COPY "P:\PROG\PROYECT\FUENTES\FD-SESION.CBL".
000450 COPY "P:\PROG\PROYECT\FUENTES\FD-USUAR.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-SURTI.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-COMBU.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-ARTIC.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-SOBRE.CBL".


000540 WORKING-STORAGE  SECTION.
000550 COPY "P:\PROG\PROYECT\FUENTES\COBW3.CBL".
000560 COPY "P:\PROG\PROYECT\FUENTES\WEB-CARAC.CBL".

000570 01 NOM-USUAR-W            PIC X(70).
       01 NOM-SURT-W             PIC X(70).
       01 NOM-COMBU-W            PIC X(70).
       01 NOM-ART-W              PIC X(70).
       01 NOM-SOBRE-W            PIC X(70).
       01 NUMERO-EDIT            PIC ZZZZZZZZZZ.ZZZ.
       01 NUM-EDIT               PIC ZZZZZZZZZZZZ.ZZ.

       01 ART-W.
          02 TIPO-ART-W          PIC 9.
          02 COD-ART-W.
             03 GRUPO-W          PIC XX.
             03 NUM-ART-W        PIC X(13).
          02 CLASE-W             PIC XX.

       01 LINEA-LLEGAD-W         PIC X(100).

       01 DATO-LLEGADA-W.
          02 SESION-LLEGAD-W     PIC X(29).
          02 DIRECTORIO-LLEGAD-W PIC X(30).
          02 CARPTA-LLEGAD-W     PIC X(9).
          02 COD-W               PIC XX.
          02 FECHA-LLEGAD-W      PIC X(6).



       01 DATOS-ENVIO.
          02 DAT0-ENV            PIC XX.
          02 FILLER              PIC X VALUE "|".
          02 CLASE-ENV           PIC XX.
          02 FILLER              PIC X VALUE "|".
          02 ARTICULO-ENV        PIC X(20).
          02 FILLER              PIC X VALUE "|".
          02 DESCRIP-ENV         PIC X(50).
          02 FILLER              PIC X VALUE "|".
          02 NUM-ANT-ENV         PIC X(20).
          02 FILLER              PIC X VALUE "|".
          02 PESOS-ENV           PIC X(20).
          02 FILLER              PIC X VALUE "|".
          02 VR-VENTA-ENV        PIC X(20).
          02 FILLER              PIC X VALUE "|".
          02 VALOR-SOBRE-ENV     PIC X(20).
          02 FILLER              PIC X VALUE "|".
          02 VALOR-GLOBAL-ENV    PIC X(20).


000791 LINKAGE SECTION.
000792 COPY "P:\PROG\PROYECT\FUENTES\ISAPICTX.CBL".
000793
000794 PROCEDURE DIVISION WITH stdcall LINKAGE USING ISAPI-CTX-CNT.
000795
000810 DECLARATIVES.
000811 I-O-TEST SECTION.
000812     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUNET.         
000813 ESCR-EXCEPTIONES.
000814     IF OTR-STAT = "00"
000815        CONTINUE 
000816     ELSE
000817        MOVE OTR-STAT                TO MSJ1-HTML
000818        MOVE NOM-USU-W               TO MSJ2-HTML
000819        MOVE "BOM104_2"              TO MSJ3-HTML
000820        GO TO ENVIAR2-ERROR
000821     END-IF.
001030
001040 I-O-TEST SECTION.
001050     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SESION.         
001060 ESCR-EXCEPTIONES.
001070     IF OTR-STAT = "00"
001080        CONTINUE
001090     ELSE
001100        MOVE OTR-STAT                TO MSJ1-HTML
001101        MOVE NOM-SESION-W            TO MSJ2-HTML
001102        MOVE "BOM104_2"              TO MSJ3-HTML
001103        GO TO ENVIAR2-ERROR
001104     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUARIOS.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-USUAR-W      TO MSJ2-HTML
006680        MOVE "BOM104_2"       TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SURTIDORES.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-SURT-W       TO MSJ2-HTML
006680        MOVE "BOM104_2"       TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-COMBUSTIBLES.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-COMBU-W      TO MSJ2-HTML
006680        MOVE "BOM104_2"       TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON MAESTRO-ARTICULOS.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-ART-W        TO MSJ2-HTML
006680        MOVE "BOM104_2"       TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SOBRETASAS.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-SOBRE-W      TO MSJ2-HTML
006680        MOVE "BOM104_2"       TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.
001105
001150 END DECLARATIVES.
001160
001161 INICIAR-IIS.
001162     MOVE LOW-VALUE TO COBW3.
001163     MOVE FUNCTION ADDR(ISAPI-CTX-CNT) TO COBW3-CONTEXT.
001164     CALL "COBW3_INIT" USING COBW3.
001220
001221 LEER-DATO-HTML.
001852     MOVE "datosh" TO COBW3-SEARCH-DATA.
001853     CALL "COBW3_GET_VALUE" USING COBW3.
001854     MOVE COBW3-GET-DATA    TO LINEA-LLEGAD-W.

           INITIALIZE DATO-LLEGADA-W

           UNSTRING LINEA-LLEGAD-W DELIMITED BY "|"
              INTO SESION-LLEGAD-W, DIRECTORIO-LLEGAD-W, CARPTA-LLEGAD-W, COD-W, FECHA-LLEGAD-W
           END-UNSTRING.

           MOVE SESION-LLEGAD-W   TO LLAVE-SESION-W.

001238 INICIAR-SESION.
001245     MOVE "D:\WEB\MAIN-ELECT\DATOS\SC-SESION.DAT" TO NOM-SESION-W
001246
000820     MOVE FUNCTION CURRENT-DATE TO FECHA-TOTAL.
000830     ACCEPT HORA-TOTAL FROM TIME.
000810     GO TO VALIDAR-SESION.
000850
000860 FIN-VALIDAR-SESION.

001303 ABRIR-USUARIO.
001304     MOVE "D:\WEB\MAIN-ELECT\DATOS\SC-ARCHUSU.DAT" TO NOM-USU-W
001305
001306     OPEN INPUT ARCHIVO-USUNET
001307     EVALUATE OTR-STAT
001308       WHEN "00"  CONTINUE
001309       WHEN "35"  OPEN OUTPUT ARCHIVO-USUNET
001310                  CLOSE       ARCHIVO-USUNET
001311                  OPEN I-O    ARCHIVO-USUNET
001312                  INITIALIZE REG-USUNET
001314                  WRITE REG-USUNET
001315                  CLOSE       ARCHIVO-USUNET
001316                  MOVE "Validacion de usuarios"      TO MSJ1-HTML
001317                  MOVE "Falta configurar usuario"    TO MSJ2-HTML
001318                  MOVE "Sc"                          TO MSJ3-HTML
001319                  GO TO ENVIAR2-ERROR
001320       WHEN OTHER GO TO CERRAR-SESION
001321     END-EVALUATE.
001322
001332     INITIALIZE REG-USUNET.

007110 LEER-USUARIO.
007120     READ ARCHIVO-USUNET NEXT AT END MOVE 0 TO SW-FIN.
007130
007140     CLOSE ARCHIVO-USUNET.
007200     
007210     IF NOMBRE-USUNET = SPACES
007220     OR NIT-USUNET = ZEROS
007230        MOVE "Validacion de Sesion"        TO MSJ1-HTML
007240        MOVE "Falta configurar usuarios"   TO MSJ2-HTML
007250        MOVE "Sc"                          TO MSJ3-HTML
007260        GO TO ENVIAR2-ERROR
007270     END-IF.

       INICIAR-RESTRICION.
           INSPECT IP-DATOS-USUNET REPLACING FIRST "/" BY "\"
001614     INITIALIZE NOM-USUAR-W NOM-SURT-W NOM-COMBU-W NOM-ART-W NOM-SOBRE-W
001615     MOVE "\\" TO NOM-USUAR-W
001616
001617     INSPECT NOM-USUAR-W REPLACING FIRST "                    "
001618                                    BY IP-DATOS-USUNET
001621     INSPECT NOM-USUAR-W REPLACING FIRST " "
001624                                     BY "\"
007292     INSPECT NOM-USUAR-W REPLACING FIRST "                              "
007293                                     BY DIRECTORIO-LLEGAD-W

           MOVE NOM-USUAR-W  TO  NOM-SURT-W NOM-COMBU-W NOM-ART-W NOM-SOBRE-W

007190     INSPECT NOM-USUAR-W  REPLACING FIRST "                       "
007200                                       BY "\CONTROL\SC-ARCHUSU.DAT".

           INSPECT NOM-SURT-W REPLACING FIRST "                       "
                                           BY "\CONTROL\SC-ARCHSUR.DAT".

           INSPECT NOM-COMBU-W REPLACING FIRST "                       "
                                            BY "\CONTROL\SC-ARCOMBU.DAT".

           INSPECT NOM-ART-W    REPLACING FIRST "                       "
                                             BY "\CONTROL\SC-MAESART.DAT".

           INSPECT NOM-SOBRE-W  REPLACING FIRST "                       "
                                             BY "\CONTROL\SC-ARCHSOB.DAT".

       LEER-USUARIO.

           OPEN INPUT ARCHIVO-USUARIOS
           READ ARCHIVO-USUARIOS NEXT WITH NO LOCK AT END 
                CLOSE ARCHIVO-USUARIOS
           END-READ.



        ACEPTAR-SURTIDOR.
           OPEN INPUT ARCHIVO-SURTIDORES.

           MOVE COD-W    TO COD-SURTI
           READ ARCHIVO-SURTIDORES WITH NO LOCK
                 INVALID KEY 
                         MOVE "99"       TO MSJ1-HTML
                         MOVE "01"       TO MSJ2-HTML
                         MOVE "BOM104_2" TO MSJ3-HTML
                         GO TO ENVIAR2-ERROR
           END-READ.
           CLOSE ARCHIVO-SURTIDORES.

       LEER-MAESTRO-ARTICULOS.
           OPEN INPUT MAESTRO-ARTICULOS
           INITIALIZE ART-W.
           MOVE PRODUCTO-SURTI TO COD-ART-W.
           MOVE ART-W          TO COD-ART.
           READ MAESTRO-ARTICULOS WITH NO LOCK
                INVALID KEY
                        MOVE "99"       TO MSJ1-HTML
                        MOVE "01"       TO MSJ2-HTML
                        MOVE "BOM104_2" TO MSJ3-HTML
                        GO TO ENVIAR2-ERROR
           END-READ.
           CLOSE MAESTRO-ARTICULOS.

           IF DESCTO-SURTI IS NUMERIC
                SUBTRACT DESCTO-SURTI FROM VR-VENTA1-ART (1).

       LEER-ARCHIVO-SOBRETASAS.
           MOVE FECHA-LLEGAD-W   TO FECHA-COMB
           OPEN INPUT ARCHIVO-SOBRETASAS.
           MOVE PRODUCTO-SURTI TO ART-SOBRE

           READ ARCHIVO-SOBRETASAS WITH NO LOCK
                INVALID KEY
                        MOVE 0 TO VALOR-SOBRE VALOR-GLOBAL-SOBRE
           END-READ.

           IF FEC-REST-SOBRE >= FECHA-COMB
              CONTINUE
           ELSE
              IF ANO-REST-SOBRE = ANO-COMB AND MES-REST-SOBRE = MES-COMB
                 CONTINUE
              ELSE
                 MOVE "99"       TO MSJ1-HTML
                 MOVE "6A"       TO MSJ2-HTML
                 MOVE "BOM104_2" TO MSJ3-HTML
                 GO TO ENVIAR2-ERROR
              END-IF
           END-IF
           CLOSE ARCHIVO-SOBRETASAS.
           MOVE 00                TO DAT0-ENV
           MOVE PRODUCTO-SURTI    TO ARTICULO-ENV
           MOVE DESCRIP-ART       TO DESCRIP-ENV

           MOVE GALONAJE-SURTI    TO NUMERO-EDIT
           MOVE NUMERO-EDIT       TO NUM-ANT-ENV

           MOVE PESOS-SURTI       TO PESOS-ENV

           MOVE VR-VENTA1-ART (1) TO NUM-EDIT
           MOVE NUM-EDIT          TO VR-VENTA-ENV

           MOVE VALOR-SOBRE       TO NUM-EDIT
           MOVE NUM-EDIT          TO VALOR-SOBRE-ENV

           MOVE VALOR-GLOBAL-SOBRE TO NUM-EDIT
           MOVE NUM-EDIT           TO VALOR-GLOBAL-ENV

           MOVE COD-W TO CLASE-ENV.



002147 ENVIO-DATOS.
004378     MOVE "datosrecibidos"  TO COBW3-CNV-NAME
004393     MOVE DATOS-ENVIO  TO COBW3-CNV-VALUE
004403     CALL "COBW3_SET_CNV"   USING COBW3
004413     MOVE "../PAGINAS/RECIBIDOS.ASPX"  TO SALIDA-HTML
004430     PERFORM ABRIR-HTML.

002545 CERRAR-SESION.
002546     CALL "COBW3_FREE" USING COBW3.
002547     MOVE 1 TO PROGRAM-STATUS.
002548     EXIT PROGRAM.

002566 COPY "P:\PROG\PROYECT\FUENTES\SC-WEB.CBL".
002567
