000012* GUARDA ACTUALIZACION DE SOBRETASAS
000020 IDENTIFICATION DIVISION.
000021* PROGRAM-ID. "BOM103".
000022
000023 PROGRAM-ID. "HttpExtensionProc".
000024 ENVIRONMENT DIVISION.
000025 CONFIGURATION SECTION.
000026 INPUT-OUTPUT SECTION.
000027 FILE-CONTROL.
000080 COPY "P:\PROG\PROYECT\FUENTES\FS-USUNET.CBL".
000150 COPY "P:\PROG\PROYECT\FUENTES\FS-SESION.CBL".


           SELECT ARCHIVO-USUARIOS LOCK MODE IS AUTOMATIC
                  ASSIGN TO NOM-USUAR-W
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC;
                  RECORD KEY IS NOMBRE-USU
                  ALTERNATE RECORD KEY IS CTL-USU     WITH DUPLICATES
                  ALTERNATE RECORD KEY IS CLAVE-USU   WITH DUPLICATES
                  ALTERNATE RECORD KEY IS CLAVE-2-USU WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.



000349     SELECT MAESTRO-ARTICULOS LOCK MODE IS AUTOMATIC
000350            ASSIGN NOM-ART-W
000351            ORGANIZATION INDEXED;
000352            ACCESS MODE  DYNAMIC;
000353            RECORD KEY COD-ART
000354            ALTERNATE RECORD KEY CLASE-ART       WITH DUPLICATES
000355            ALTERNATE RECORD KEY COD-BARRAS-ART  WITH DUPLICATES
000356            ALTERNATE RECORD KEY DESCRIP-ART     WITH DUPLICATES
000357            ALTERNATE RECORD KEY USO-ART         WITH DUPLICATES
000358            ALTERNATE RECORD KEY CL-ROTAC-ART    WITH DUPLICATES
000359            ALTERNATE RECORD KEY UBICAC-ART      WITH DUPLICATES
000360            ALTERNATE RECORD KEY FECHA-VENCE-ART WITH DUPLICATES
000361            FILE STATUS IS OTR-STAT.


           SELECT ARCHIVO-SOBRETASAS LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-SOBRE-W
                  ORGANIZATION INDEXED;
                  ACCESS MODE  DYNAMIC;
                  RECORD KEY ART-SOBRE
                  FILE STATUS IS OTR-STAT.

           SELECT ARCHIVO-MAESTROS LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-MAE-W
                  ORGANIZATION IS INDEXED;
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS LLAVE-MAE
                  ALTERNATE RECORD KEY IS NOMBRE-MAE    WITH DUPLICATES
                  ALTERNATE RECORD KEY IS CTA-INTER-MAE WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.


000400 DATA DIVISION.
000410 FILE SECTION.
000420 COPY "P:\PROG\PROYECT\FUENTES\FD-USUNET.CBL".
000421 COPY "P:\PROG\PROYECT\FUENTES\FD-SESION.CBL".
000450 COPY "P:\PROG\PROYECT\FUENTES\FD-SOBRE.CBL".
000450 COPY "P:\PROG\PROYECT\FUENTES\FD-USUAR.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-ARTIC.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-MAEST.CBL".


000540 WORKING-STORAGE  SECTION.
000550 COPY "P:\PROG\PROYECT\FUENTES\COBW3.CBL".
000560 COPY "P:\PROG\PROYECT\FUENTES\WEB-CARAC.CBL".

000570 01 NOM-USUAR-W            PIC X(70).
       01 NOM-SOBRE-W            PIC X(70).
       01 NOM-MAE-W              PIC X(70).
       01 NOM-ART-W              PIC X(70).

000590 01 EDITADO-W              PIC X(15).
000600 01 COD-USER-W             PIC X(15).
000622 01 CLAVE-CTL              PIC X(15).
000633 01  DATO-W.
000635     02 CLAVE-W            PIC X(15).

       77 GALONAJE-W             PIC ZZZZZZZZZZ.ZZZ.
       77 DESCTO-W               PIC ZZZZZZZZZZZZ.ZZZ.


       01 VALOR-GLOBAL-W              PIC ZZZZZZZZZZZZ.ZZ.


       01 LINEA-LLEGAD-W             PIC X(300).

       01 DATO-LLEGADA-W.
          02 SESION-LLEGAD-W        PIC X(29).
          02 DIRECTORIO-LLEGAD-W    PIC X(30).
          02 CARPTA-LLEGAD-W        PIC X(9).
          02 NOVEDAD-LLLEGAD-W      PIC X.


       01 COD-ART-W.
          02 LLAVE-NRO-ART-W.
             03 LLAVE-GRUPO-ART-W.
                05 TIPO-ART-W        PIC 9.
                05 GRUPO-ART-W.
                   07 GRUPO1-ART-W    PIC X.
                   07 GRUPO2-ART-W    PIC X.
             03 NUMERO-ART-W.
                05 NRO1-ART-W         PIC XX.
                05 NRO2-ART-W         PIC X(11).
          02 CLASE-ART-W              PIC XX.


       01 VALOR-SOBRE-EDIT.
          02 ENT-SOBRE-EDIT             PIC 9(12).
          02 DEC-SOBRE-EDIT             PIC 99.

       01 VALOR-GLOBAL-EDIT.
          02 ENT-GLOBAL-EDIT            PIC 9(12).
          02 DEC-GLOBAL-EDIT            PIC 99.


       01  REG-SOBRE-W.
           02 ART-SOBRE-W.
              05 GRUPO-SOBRE-W           PIC XX.
              05 COD-ART-SOBRE-W         PIC X(16).
           02 VALOR-SOBRE-W              PIC 9(12)V99.
           02 CTA-SOBRE-W                PIC X(11).
           02 VALOR-GLOBAL-SOBRE-W       PIC 9(12)V99.
           02 CTA-GLOBAL-SOBRE-W         PIC X(11).
           02 OPER-SOBRE-W               PIC X(4).
           02 FEC-REST-SOBRE-W.
              05 ANO-REST-SOBRE-W        PIC XX.
              05 MES-REST-SOBRE-W        PIC XX.
              05 DIA-REST-SOBRE-W        PIC XX.
           02 FILLER                     PIC X(2000).


000791 LINKAGE SECTION.
000792 COPY "P:\PROG\PROYECT\FUENTES\ISAPICTX.CBL".
000793
000794 PROCEDURE DIVISION WITH stdcall LINKAGE USING ISAPI-CTX-CNT.
000795
000810 DECLARATIVES.
000811 I-O-TEST SECTION.
000812     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUNET.         
000813 ESCR-EXCEPTIONES.
000814     IF OTR-STAT = "00"
000815        CONTINUE 
000816     ELSE
000817        MOVE OTR-STAT                TO MSJ1-HTML
000818        MOVE NOM-USU-W               TO MSJ2-HTML
000819        MOVE "BOM103"                TO MSJ3-HTML
000820        GO TO ENVIAR2-ERROR
000821     END-IF.
001030
001040 I-O-TEST SECTION.
001050     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SESION.         
001060 ESCR-EXCEPTIONES.
001070     IF OTR-STAT = "00"
001080        CONTINUE
001090     ELSE
001100        MOVE OTR-STAT                TO MSJ1-HTML
001101        MOVE NOM-SESION-W            TO MSJ2-HTML
001102        MOVE "BOM103"                TO MSJ3-HTML
001103        GO TO ENVIAR2-ERROR
001104     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUARIOS.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-USUAR-W      TO MSJ2-HTML
006680        MOVE "BOM103"         TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON MAESTRO-ARTICULOS.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-ART-W        TO MSJ2-HTML
006680        MOVE "BOM103"         TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SOBRETASAS.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-SOBRE-W      TO MSJ2-HTML
006680        MOVE "BOM103"         TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-MAESTROS.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-MAE-W        TO MSJ2-HTML
006680        MOVE "BOM103"         TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

001105
001150 END DECLARATIVES.
001160
001161 INICIAR-IIS.
001162     MOVE LOW-VALUE TO COBW3.
001163     MOVE FUNCTION ADDR(ISAPI-CTX-CNT) TO COBW3-CONTEXT.
001164     CALL "COBW3_INIT" USING COBW3.
001220
001221 LEER-DATO-HTML.
001852     MOVE "datosh" TO COBW3-SEARCH-DATA.
001853     CALL "COBW3_GET_VALUE" USING COBW3.
001854     MOVE COBW3-GET-DATA    TO LINEA-LLEGAD-W.

           INITIALIZE REG-SOBRE-W VALOR-SOBRE-EDIT VALOR-GLOBAL-EDIT DATO-LLEGADA-W.



           UNSTRING LINEA-LLEGAD-W DELIMITED BY "|"
              INTO SESION-LLEGAD-W, DIRECTORIO-LLEGAD-W, CARPTA-LLEGAD-W, NOVEDAD-LLLEGAD-W, GRUPO-SOBRE-W, 
                   COD-ART-SOBRE-W, VALOR-SOBRE-EDIT, CTA-SOBRE-W, VALOR-GLOBAL-EDIT, CTA-GLOBAL-SOBRE-W, OPER-SOBRE-W
           END-UNSTRING

           MOVE SESION-LLEGAD-W     TO LLAVE-SESION-W.

           MOVE VALOR-SOBRE-EDIT    TO VALOR-SOBRE-W
           MOVE VALOR-GLOBAL-EDIT   TO VALOR-GLOBAL-SOBRE-W
           ACCEPT FEC-REST-SOBRE-W FROM DATE.

001238 INICIAR-SESION.
001245     MOVE "D:\WEB\MAIN-ELECT\DATOS\SC-SESION.DAT" TO NOM-SESION-W
001246
000820     MOVE FUNCTION CURRENT-DATE TO FECHA-TOTAL.
000830     ACCEPT HORA-TOTAL FROM TIME.
000810     GO TO VALIDAR-SESION.
000850
000860 FIN-VALIDAR-SESION.

001303 ABRIR-USUARIO.
001304     MOVE "D:\WEB\MAIN-ELECT\DATOS\SC-ARCHUSU.DAT" TO NOM-USU-W
001305
001306     OPEN INPUT ARCHIVO-USUNET
001307     EVALUATE OTR-STAT
001308       WHEN "00"  CONTINUE
001309       WHEN "35"  OPEN OUTPUT ARCHIVO-USUNET
001310                  CLOSE       ARCHIVO-USUNET
001311                  OPEN I-O    ARCHIVO-USUNET
001312                  INITIALIZE REG-USUNET
001314                  WRITE REG-USUNET
001315                  CLOSE       ARCHIVO-USUNET
001316                  MOVE "Validacion de usuarios"      TO MSJ1-HTML
001317                  MOVE "Falta configurar usuario"    TO MSJ2-HTML
001318                  MOVE "Sc"                          TO MSJ3-HTML
001319                  GO TO ENVIAR2-ERROR
001320       WHEN OTHER GO TO CERRAR-SESION
001321     END-EVALUATE.
001322
001332     INITIALIZE REG-USUNET.

007110 LEER-USUARIO.
007120     READ ARCHIVO-USUNET NEXT AT END MOVE 0 TO SW-FIN.
007130
007140     CLOSE ARCHIVO-USUNET.
007200     
007210     IF NOMBRE-USUNET = SPACES
007220     OR NIT-USUNET = ZEROS
007230        MOVE "Validacion de Sesion"        TO MSJ1-HTML
007240        MOVE "Falta configurar usuarios"   TO MSJ2-HTML
007250        MOVE "Sc"                          TO MSJ3-HTML
007260        GO TO ENVIAR2-ERROR
007270     END-IF.

       INICIAR-RESTRICION.

           INSPECT IP-DATOS-USUNET REPLACING FIRST "/" BY "\"
001614     INITIALIZE NOM-USUAR-W NOM-SOBRE-W NOM-MAE-W NOM-ART-W
001615     MOVE "\\" TO NOM-USUAR-W
001616
001617     INSPECT NOM-USUAR-W REPLACING FIRST "                    "
001618                                    BY IP-DATOS-USUNET
001621     INSPECT NOM-USUAR-W REPLACING FIRST " "
001624                                     BY "\"
007292     INSPECT NOM-USUAR-W REPLACING FIRST "                              "
007293                                     BY DIRECTORIO-LLEGAD-W

           MOVE NOM-USUAR-W  TO  NOM-SOBRE-W NOM-MAE-W NOM-ART-W

007190     INSPECT NOM-USUAR-W   REPLACING FIRST "                       "
007200                                        BY "\CONTROL\SC-ARCHUSU.DAT".


           INSPECT NOM-SOBRE-W REPLACING FIRST "                       "
                                            BY "\CONTROL\SC-ARCHSOB.DAT".

           INSPECT NOM-MAE-W   REPLACING FIRST "                       "
                                            BY "\CONTROL\SC-ARCHMAE.DAT".

           INSPECT NOM-ART-W   REPLACING FIRST "                       "
                                            BY "\CONTROL\SC-MAESART.DAT".

       LEER-USUARIO.

           OPEN INPUT ARCHIVO-USUARIOS
           READ ARCHIVO-USUARIOS NEXT WITH NO LOCK AT END 
                CLOSE ARCHIVO-USUARIOS
           END-READ.



        LEER-ARTICULO.

           OPEN INPUT MAESTRO-ARTICULOS.

           MOVE 0                     TO TIPO-ART-W
           MOVE GRUPO-SOBRE-W         TO GRUPO-ART-W
           MOVE COD-ART-SOBRE-W       TO NUMERO-ART-W
           MOVE SPACES                TO CLASE-ART-W


           MOVE COD-ART-W          TO COD-ART
           READ MAESTRO-ARTICULOS WITH NO LOCK
                INVALID KEY
                        CLOSE MAESTRO-ARTICULOS
                        MOVE "99"             TO MSJ1-HTML
                        MOVE COD-ART-W        TO MSJ2-HTML
                        MOVE "BOM103"         TO MSJ3-HTML
                        GO TO ENVIAR2-ERROR
           END-READ.

           CLOSE MAESTRO-ARTICULOS.

       LEER-MAESTRO.

           OPEN INPUT ARCHIVO-MAESTROS.

           IF VALOR-SOBRE-W = ZEROS
              MOVE ZEROS TO CTA-SOBRE-W 
           ELSE
              MOVE CTA-SOBRE-W    TO CTA-MAE
              MOVE 4              TO TIPO-MAE

              READ ARCHIVO-MAESTROS WITH NO LOCK
                   INVALID KEY 
                           CLOSE ARCHIVO-MAESTROS
                           MOVE "99"     TO MSJ1-HTML
                           MOVE 01       TO MSJ2-HTML
                           MOVE "BOM103" TO MSJ3-HTML
                           GO TO ENVIAR2-ERROR
              END-READ
           END-IF.

           IF VALOR-GLOBAL-SOBRE-W = ZEROS 
              MOVE SPACES   TO CTA-GLOBAL-SOBRE-W
           ELSE
              MOVE CTA-GLOBAL-SOBRE-W  TO CTA-MAE
              MOVE 4   TO TIPO-MAE

              READ ARCHIVO-MAESTROS WITH NO LOCK
                   INVALID KEY 
                           CLOSE ARCHIVO-MAESTROS
                           MOVE "99"     TO MSJ1-HTML
                           MOVE 01       TO MSJ2-HTML
                           MOVE "BOM103" TO MSJ3-HTML
                           GO TO ENVIAR2-ERROR
              END-READ
           END-IF.


           CLOSE ARCHIVO-MAESTROS.



       LEER-SOBRETASA.

           OPEN INPUT ARCHIVO-SOBRETASAS.
           MOVE ART-SOBRE-W  TO ART-SOBRE
           READ ARCHIVO-SOBRETASAS WITH NO LOCK
                INVALID KEY
                           MOVE 01 TO SW-INVALID
           END-READ.

           CLOSE ARCHIVO-SOBRETASAS.

           MOVE NOVEDAD-LLLEGAD-W   TO NOVEDAD-W.

           IF NOVEDAD-W = 7 AND SW-INVALID = 01 GO TO NUEVO.
           IF NOVEDAD-W = 7 AND SW-INVALID = 00 GO TO ERROR-1.
           IF NOVEDAD-W = 8 AND SW-INVALID = 00 GO TO CAMBIO.
           IF NOVEDAD-W = 8 AND SW-INVALID = 01 GO TO ERROR-1.
           IF NOVEDAD-W = 9 AND SW-INVALID = 00 GO TO RETIRO.
           IF NOVEDAD-W = 9 AND SW-INVALID = 01 GO TO ERROR-1.


       NUEVO.

           OPEN I-O ARCHIVO-SOBRETASAS
           MOVE REG-SOBRE-W    TO REG-SOBRE
           WRITE REG-SOBRE END-WRITE
           CLOSE ARCHIVO-SOBRETASAS
           GO TO ENVIO-DATOS.

       CAMBIO.

           OPEN I-O ARCHIVO-SOBRETASAS
           MOVE REG-SOBRE-W    TO REG-SOBRE
           REWRITE REG-SOBRE END-REWRITE
           CLOSE ARCHIVO-SOBRETASAS
           GO TO ENVIO-DATOS.

       RETIRO.

           OPEN I-O ARCHIVO-SOBRETASAS
           DELETE   ARCHIVO-SOBRETASAS
           CLOSE ARCHIVO-SOBRETASAS.


002147 ENVIO-DATOS.
004378     MOVE "datosrecibidos"  TO COBW3-CNV-NAME
004393     MOVE 00       TO COBW3-CNV-VALUE
004403     CALL "COBW3_SET_CNV"   USING COBW3
004413     MOVE "../PAGINAS/RECIBIDOS.ASPX"  TO SALIDA-HTML
004430     PERFORM ABRIR-HTML.

002545 CERRAR-SESION.
002546     CALL "COBW3_FREE" USING COBW3.
002547     MOVE 1 TO PROGRAM-STATUS.
002548     EXIT PROGRAM.

        ERROR-1.

           MOVE "99"            TO MSJ1-HTML
           MOVE SW-INVALID      TO MSJ2-HTML
           MOVE "BOM103"        TO MSJ3-HTML
           GO TO ENVIAR2-ERROR.

002566 COPY "P:\PROG\PROYECT\FUENTES\SC-WEB.CBL".
002567
