000012* BOMBAS - CORRECCION  DE COMPROBANTE DE VENTAS DE COMBUSTIBLES.
000020 IDENTIFICATION DIVISION.
000021* PROGRAM-ID. "BOM104_3E".
000022
000023 PROGRAM-ID. "HttpExtensionProc".
000024 ENVIRONMENT DIVISION.
000025 CONFIGURATION SECTION.
000026 INPUT-OUTPUT SECTION.
000027 FILE-CONTROL.
000080 COPY "P:\PROG\PROYECT\FUENTES\FS-USUNET.CBL".
000150 COPY "P:\PROG\PROYECT\FUENTES\FS-SESION.CBL".


           SELECT ARCHIVO-USUARIOS LOCK MODE IS AUTOMATIC
                  ASSIGN TO NOM-USUAR-W
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC;
                  RECORD KEY IS NOMBRE-USU
                  ALTERNATE RECORD KEY IS CTL-USU     WITH DUPLICATES
                  ALTERNATE RECORD KEY IS CLAVE-USU   WITH DUPLICATES
                  ALTERNATE RECORD KEY IS CLAVE-2-USU WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.


           SELECT ARCHIVO-MAESTROS LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-MAE-W
                  ORGANIZATION IS INDEXED;
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS LLAVE-MAE
                  ALTERNATE RECORD KEY IS NOMBRE-MAE    WITH DUPLICATES
                  ALTERNATE RECORD KEY IS CTA-INTER-MAE WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.


           SELECT ARCHIVO-TERCEROS  LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-TER-W
                  ORGANIZATION IS INDEXED;
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS COD-TERCERO
                  ALTERNATE RECORD KEY DESCRIP-TER WITH DUPLICATES
                  ALTERNATE RECORD KEY ACT-TER     WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.


           SELECT MAESTRO-ARTICULOS LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-ART-W
                  ORGANIZATION INDEXED;
                  ACCESS MODE  DYNAMIC;
                  RECORD KEY COD-ART
                  ALTERNATE RECORD KEY CLASE-ART       WITH DUPLICATES
                  ALTERNATE RECORD KEY COD-BARRAS-ART  WITH DUPLICATES
                  ALTERNATE RECORD KEY DESCRIP-ART     WITH DUPLICATES
                  ALTERNATE RECORD KEY USO-ART         WITH DUPLICATES
                  ALTERNATE RECORD KEY CL-ROTAC-ART    WITH DUPLICATES
                  ALTERNATE RECORD KEY UBICAC-ART      WITH DUPLICATES
                  ALTERNATE RECORD KEY FECHA-VENCE-ART WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.


           SELECT ARCHIVO-SOBRETASAS LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-SOBRE-W
                  ORGANIZATION INDEXED;
                  ACCESS MODE  DYNAMIC;
                  RECORD KEY ART-SOBRE
                  FILE STATUS IS OTR-STAT.


           SELECT ARCHIVO-COMBUSTIBLES LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-COMBU-W
                  ORGANIZATION INDEXED;
                  ACCESS MODE DYNAMIC;
                  RECORD KEY IS LLAVE-COMB
                  ALTERNATE RECORD KEY IS FECHA-COMB WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.



           SELECT ARCHIVO-GALONAJES LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-GALON-W
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC;
                  RECORD KEY IS LLAVE-GALON
                  ALTERNATE RECORD KEY IS FECHA-GALON WITH DUPLICATES.


           SELECT ARCHIVO-SURTIDORES LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-SURT-W
                  ORGANIZATION INDEXED;
                  ACCESS MODE  DYNAMIC;
                  RECORD KEY COD-SURTI
                  FILE STATUS  OTR-STAT.


           SELECT ARCHIVO-VENDEDOR LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-VEND-W
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS COD-VEN
                  FILE STATUS IS OTR-STAT.


           SELECT ARCHIVO-TEXTO
                  ASSIGN NOM-PLANO-W
                  ORGANIZATION IS LINE SEQUENTIAL
                  FILE STATUS IS OTR-STAT.


000400 DATA DIVISION.
000410 FILE SECTION.
000420 COPY "P:\PROG\PROYECT\FUENTES\FD-USUNET.CBL".
000421 COPY "P:\PROG\PROYECT\FUENTES\FD-SESION.CBL".
000450 COPY "P:\PROG\PROYECT\FUENTES\FD-USUAR.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-MAEST.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-TERCE.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-ARTIC.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-SOBRE.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-COMBU.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-GALON.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-SURTI.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-VENDE.CBL".
       

       FD  ARCHIVO-TEXTO
           LABEL RECORD STANDARD.
       01  REG-PLANO.
           02 DATOS-PLANO            PIC X(150). 

000540 WORKING-STORAGE  SECTION.
000550 COPY "P:\PROG\PROYECT\FUENTES\COBW3.CBL".
000560 COPY "P:\PROG\PROYECT\FUENTES\WEB-CARAC.CBL".

       77 NOM-USUAR-W            PIC X(70).
       77 NOM-MAE-W              PIC X(70).
       77 NOM-TER-W              PIC X(70).
       77 NOM-ART-W              PIC X(70).
       77 NOM-SOBRE-W            PIC X(70).
       77 NOM-GALON-W            PIC X(70).
       77 NOM-VEND-W             PIC X(70).
       77 NOM-SURT-W             PIC X(70).
       77 NOM-COMBU-W            PIC X(70).
       77 NOM-PLANO-W            PIC X(90).
       77 SUCURSAL-W             PIC X.


       01 VARIABLES.
          02 LECTURA-ACTUAL OCCURS 15.
             05 VLR-ACT          PIC 9(12).


       01 CANTIDAD-EDIT.
          02 CANT-ENT-EDIT         PIC 9(12).
          02 CANT-DEC-EDIT         PIC 9(3).

       01 NUM-ANT-EDIT.
          02 ANT-ENT-EDIT          PIC 9(12).
          02 ANT-DEC-EDIT          PIC 9(3).

       01 NUM-ACT-EDIT.
          02 ACT-ENT-EDIT          PIC 9(12).
          02 ACT-DEC-EDIT          PIC 9(3).

       01 CANT-DEU-EDIT.
          02 CAN-DEUD-ENT-EDIT     PIC 9(12).
          02 CAN-DUED-DEC-EDIT     PIC 99.

       


       01 NOMBRE-LNK               PIC X(30).
       01 DIRECTORIO-W             PIC X(30).
       01 INVALID-007              PIC 99.
       01 DATO-ULT-MOV-LNK.
          02 LOTE-ULT-MOV-LNK.
             03 LOTE1-ULT-MOV-LNK  PIC X.
             03 LOTE2-ULT-MOV-LNK  PIC X.
          02 NRO-ULT-COMP-LNK.
             03 NRO1-ULT-COMP-LNK  PIC 9(3).
             03 NRO2-ULT-COMP-LNK  PIC 9(6).
          02 FECHA-ULT-MOV-LNK.
             03 ANO-ULT-MOV-LNK    PIC 99.
             03 MES-ULT-MOV-LNK    PIC 99.
             03 DIA-ULT-MOV-LNK    PIC 99.

       01 LINEA-LLEGAD-W           PIC X(200).

       01 DATO-LLEGADA-W.
          02 SESION-W.
             03 ID-LLEGAD-W       PIC X(15).
             03 FECHA-LLEGAD-W    PIC X(8).
             03 HORA-LLEGAD-W     PIC X(6).
          02 DIRECTORIO-LLEGAD-W  PIC X(30).
          02 CARPTA-LLEGAD-W      PIC X(9).
          02 ADMIN-LLEGAD-W       PIC X(4).
          02 COMP-W               PIC X(6).
          02 FECHA-W              PIC X(6).
          02 TURNO-W              PIC X.
          02 DETALLE-W            PIC X(20).
          02 VEND-W               PIC X(5).
          02 VLR-FINANC-W         PIC X(12).
          02 VLR-NETO-W           PIC X(12).
          02 VLR-CHEQUE-W         PIC X(12).


       01 DATOS-ENVIO.
          02 DAT0-ENV            PIC XX.

000791 LINKAGE SECTION.
000792 COPY "P:\PROG\PROYECT\FUENTES\ISAPICTX.CBL".
000793
000794 PROCEDURE DIVISION WITH stdcall LINKAGE USING ISAPI-CTX-CNT.
000795
000810 DECLARATIVES.
000811 I-O-TEST SECTION.
000812     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUNET.         
000813 ESCR-EXCEPTIONES.
000814     IF OTR-STAT = "00"
000815        CONTINUE 
000816     ELSE
000817        MOVE OTR-STAT                TO MSJ1-HTML
000818        MOVE NOM-USU-W               TO MSJ2-HTML
000819        MOVE "BOM104_3E"             TO MSJ3-HTML
000820        GO TO ENVIAR2-ERROR
000821     END-IF.
001030
001040 I-O-TEST SECTION.
001050     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SESION.         
001060 ESCR-EXCEPTIONES.
001070     IF OTR-STAT = "00"
001080        CONTINUE
001090     ELSE
001100        MOVE OTR-STAT                TO MSJ1-HTML
001101        MOVE NOM-SESION-W            TO MSJ2-HTML
001102        MOVE "BOM104_3E"             TO MSJ3-HTML
001103        GO TO ENVIAR2-ERROR
001104     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUARIOS.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-USUAR-W      TO MSJ2-HTML
006680        MOVE "BOM104_3E"      TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-MAESTROS.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-MAE-W        TO MSJ2-HTML
006680        MOVE "BOM104_3E"      TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-TERCEROS.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-TER-W        TO MSJ2-HTML
006680        MOVE "BOM104_3E"      TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON MAESTRO-ARTICULOS.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-ART-W        TO MSJ2-HTML
006680        MOVE "BOM104_3E"      TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SOBRETASAS.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-SOBRE-W      TO MSJ2-HTML
006680        MOVE "BOM104_3E"      TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-GALONAJES.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-GALON-W      TO MSJ2-HTML
006680        MOVE "BOM104_3E"      TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-VENDEDOR.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-VEND-W       TO MSJ2-HTML
006680        MOVE "BOM104_3E"      TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SURTIDORES.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-SURT-W       TO MSJ2-HTML
006680        MOVE "BOM104_3E"      TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-COMBUSTIBLES.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-COMBU-W      TO MSJ2-HTML
006680        MOVE "BOM104_3E"      TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-TEXTO.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-PLANO-W      TO MSJ2-HTML
006680        MOVE "BOM104_3E"      TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.
001105
001150 END DECLARATIVES.
001160
001161 INICIAR-IIS.
001162     MOVE LOW-VALUE TO COBW3.
001163     MOVE FUNCTION ADDR(ISAPI-CTX-CNT) TO COBW3-CONTEXT.
001164     CALL "COBW3_INIT" USING COBW3.
001220
001221 LEER-DATO-HTML.
001852     MOVE "datosh" TO COBW3-SEARCH-DATA.
001853     CALL "COBW3_GET_VALUE" USING COBW3.
001854     MOVE COBW3-GET-DATA    TO LINEA-LLEGAD-W.

           INITIALIZE DATO-LLEGADA-W

           UNSTRING LINEA-LLEGAD-W DELIMITED BY "|"
               INTO SESION-W, DIRECTORIO-LLEGAD-W, CARPTA-LLEGAD-W, ADMIN-LLEGAD-W, COMP-W, 
                    FECHA-W, TURNO-W, DETALLE-W, VEND-W, VLR-FINANC-W, VLR-NETO-W, VLR-CHEQUE-W
           END-UNSTRING.
           MOVE SESION-W   TO LLAVE-SESION-W.

001238 INICIAR-SESION.
001245     MOVE "D:\WEB\MAIN-ELECT\DATOS\SC-SESION.DAT" TO NOM-SESION-W
001246
000820     MOVE FUNCTION CURRENT-DATE TO FECHA-TOTAL.
000830     ACCEPT HORA-TOTAL FROM TIME.
000810     GO TO VALIDAR-SESION.
000850
000860 FIN-VALIDAR-SESION.

001303 ABRIR-USUARIO.
001304     MOVE "D:\WEB\MAIN-ELECT\DATOS\SC-ARCHUSU.DAT" TO NOM-USU-W
001305
001306     OPEN INPUT ARCHIVO-USUNET
001307     EVALUATE OTR-STAT
001308       WHEN "00"  CONTINUE
001309       WHEN "35"  OPEN OUTPUT ARCHIVO-USUNET
001310                  CLOSE       ARCHIVO-USUNET
001311                  OPEN I-O    ARCHIVO-USUNET
001312                  INITIALIZE REG-USUNET
001314                  WRITE REG-USUNET
001315                  CLOSE       ARCHIVO-USUNET
001316                  MOVE "Validacion de usuarios"      TO MSJ1-HTML
001317                  MOVE "Falta configurar usuario"    TO MSJ2-HTML
001318                  MOVE "Sc"                          TO MSJ3-HTML
001319                  GO TO ENVIAR2-ERROR
001320       WHEN OTHER GO TO CERRAR-SESION
001321     END-EVALUATE.
001322
001332     INITIALIZE REG-USUNET.

007110 LEER-USUARIO.
007120     READ ARCHIVO-USUNET NEXT AT END MOVE 0 TO SW-FIN.
007130
007140     CLOSE ARCHIVO-USUNET.
007200     
007210     IF NOMBRE-USUNET = SPACES
007220     OR NIT-USUNET = ZEROS
007230        MOVE "Validacion de Sesion"        TO MSJ1-HTML
007240        MOVE "Falta configurar usuarios"   TO MSJ2-HTML
007250        MOVE "Sc"                          TO MSJ3-HTML
007260        GO TO ENVIAR2-ERROR
007270     END-IF.

       INICIAR-RESTRICION.
           INSPECT IP-DATOS-USUNET REPLACING FIRST "/" BY "\"
001614     INITIALIZE NOM-USUAR-W NOM-SURT-W NOM-COMBU-W NOM-PLANO-W NOM-MAE-W 
                      NOM-TER-W NOM-ART-W NOM-SOBRE-W NOM-GALON-W NOM-VEND-W

           MOVE DIRECTORIO-LLEGAD-W  TO DIRECTORIO-W.

001615     MOVE "\\" TO NOM-USUAR-W NOMBRE-LNK

005410     INSPECT NOMBRE-LNK   REPLACING FIRST "                    "
005420                                          BY IP-DATOS-USUNET
           INSPECT NOMBRE-LNK   REPLACING FIRST " "
005420                                       BY "\".

001617     INSPECT NOM-USUAR-W REPLACING FIRST "                    "
001618                                    BY IP-DATOS-USUNET
001621     INSPECT NOM-USUAR-W REPLACING FIRST " "
001624                                     BY "\"
007292     INSPECT NOM-USUAR-W REPLACING FIRST "                              "
007293                                     BY DIRECTORIO-LLEGAD-W

           MOVE NOM-USUAR-W  TO  NOM-SURT-W NOM-COMBU-W NOM-MAE-W NOM-TER-W 
                                 NOM-ART-W NOM-SOBRE-W NOM-GALON-W NOM-VEND-W

007190     INSPECT NOM-USUAR-W  REPLACING FIRST "                       "
007200                                       BY "\CONTROL\SC-ARCHUSU.DAT".

           INSPECT NOM-SURT-W REPLACING FIRST "                       "
                                           BY "\CONTROL\SC-ARCHSUR.DAT".

           INSPECT NOM-COMBU-W REPLACING FIRST "                       "
                                            BY "\CONTROL\SC-ARCOMBU.DAT".

           INSPECT NOM-MAE-W   REPLACING FIRST "                       "
                                            BY "\CONTROL\SC-ARCHMAE.DAT".

           INSPECT NOM-TER-W   REPLACING FIRST "                       "
                                            BY "\CONTROL\SC-ARCHTER.DAT".

           INSPECT NOM-ART-W   REPLACING FIRST "                       "
                                            BY "\CONTROL\SC-MAESART.DAT".

           INSPECT NOM-SOBRE-W REPLACING FIRST "                       "
                                            BY "\CONTROL\SC-ARCHSOB.DAT".

           INSPECT NOM-GALON-W REPLACING FIRST "                       "
                                            BY "\CONTROL\SC-ARCHGAL.DAT".

           INSPECT NOM-VEND-W  REPLACING FIRST "                       "
                                            BY "\CONTROL\SC-ARCHVEN.DAT".


       LEER-USUARIO.

           OPEN INPUT ARCHIVO-USUARIOS
           READ ARCHIVO-USUARIOS NEXT WITH NO LOCK AT END 
                CLOSE ARCHIVO-USUARIOS
           END-READ.


       LEER-COMBUSTIBBLES.
           OPEN I-O ARCHIVO-COMBUSTIBLES.

           MOVE COMP-W   TO NRO-COMB
           READ ARCHIVO-COMBUSTIBLES WITH NO LOCK
                INVALID KEY 
                        MOVE "99"        TO MSJ1-HTML
                        MOVE "ERROR EN CONSECUTIVO" TO MSJ2-HTML
                        MOVE "BOM104_3E" TO MSJ3-HTML
                        GO TO ENVIAR2-ERROR
           END-READ.

           MOVE FECHA-W           TO FECHA-COMB
           MOVE TURNO-W           TO TURNO-COMB
           MOVE DETALLE-W         TO DETALLE-COMB
           MOVE VEND-W            TO VEND-COMB
           MOVE ADMIN-LLEGAD-W    TO OPER-COMB
           MOVE VLR-FINANC-W      TO VALOR-FINANC-COMB
           MOVE VLR-NETO-W        TO VALOR-NETO-COMB
           MOVE VLR-CHEQUE-W      TO VALOR-CHEQUE

           ACCEPT FEC-REST-COMB FROM DATE.


       ABRIR-TABLA1.
           MOVE "C:\PROSOFT\TEMP\COMP-TBL1-XXXXXXXXXXXXXXXXXXXXXXXXXXXXX.TXT"  TO NOM-PLANO-W

           INSPECT NOM-PLANO-W REPLACING FIRST "XXXXXXXXXXXXXXXXXXXXXXXXXXXXX"
                                            BY SESION-W.

           OPEN INPUT ARCHIVO-TEXTO.
           INITIALIZE I.
       LEER-TABLA1.
           READ ARCHIVO-TEXTO NEXT WITH NO LOCK AT END GO TO ABRIR-TABLA2.

           IF DATOS-PLANO = SPACES 
              CONTINUE
           ELSE
               ADD 1 TO I

               IF I > 15
                  GO TO ABRIR-TABLA2
               END-IF

               UNSTRING DATOS-PLANO  DELIMITED BY "|"
                   INTO SURTIDOR-COMB (I), ARTICULO-COMB (I),  CANTIDAD-EDIT, 
                        VALOR-COMB (I), SOBRET-COMB (I), GLOBAL-COMB (I), 
                        NUM-ANT-EDIT, NUM-ACT-EDIT, VLR-ACT (I)
               END-UNSTRING

               MOVE CANTIDAD-EDIT     TO CANTIDAD-COMB (I)
               MOVE NUM-ANT-EDIT      TO NUM-ANT-COMB (I)
               MOVE NUM-ACT-EDIT      TO NUM-ACT-COMB (I)

           END-IF.

           GO TO LEER-TABLA1.

       ABRIR-TABLA2.

           CLOSE ARCHIVO-TEXTO.

           INSPECT NOM-PLANO-W REPLACING FIRST "TBL1"
                                            BY "TBL2".

           OPEN INPUT ARCHIVO-TEXTO.
           INITIALIZE I.
       LEER-TABLA2.
           READ ARCHIVO-TEXTO NEXT WITH NO LOCK AT END GO TO CERRAR-TABLA.

           IF DATOS-PLANO = SPACES 
              CONTINUE
           ELSE
               ADD 1 TO I

               IF I > 200
                  GO TO CERRAR-TABLA
               END-IF

               UNSTRING DATOS-PLANO DELIMITED BY "|"
                   INTO COD-DEU-COMB (I), NIT-DEU-COMB (I), DOC-DEU-COMB (I), VLR-DEU-COMB (I), 
                        ART-DEU-COMB (I), CANT-DEU-EDIT, PLACA-COMB (I)
               END-UNSTRING

               MOVE CANT-DEU-EDIT   TO CANT-DEU-COMB (I)

           END-IF.

           GO TO LEER-TABLA2.

       CERRAR-TABLA.
           CLOSE ARCHIVO-TEXTO.


       GRABAR.
           MOVE 1 TO SUCURSAL-W
           MOVE SUCURSAL-W      TO SUCURSAL-COMB.

           REWRITE REG-COMB END-REWRITE.
           CLOSE ARCHIVO-COMBUSTIBLES.

       GRABAR-SURTIDOR.

           OPEN I-O ARCHIVO-GALONAJES.

           MOVE TURNO-COMB     TO TURNO-GALON.
           INITIALIZE I.

           PERFORM LEER-LECTURAS VARYING I FROM  1 BY 1
                                           UNTIL I > 15.

           GO TO CERRAR-ARCHIVO.

       LEER-LECTURAS.
           IF VALOR-COMB (I) > 0
              PERFORM GRABAR-LECTURAS
           END-IF.
       GRABAR-LECTURAS.

           MOVE NRO-COMB          TO COMP-GALON.
           MOVE SURTIDOR-COMB (I) TO SURTI-GALON.
           MOVE GALONAJE-SURTI    TO GALONAJE-GALON.
           MOVE VALOR-COMB    (I) TO VENTA-GALON.
           MOVE CANTIDAD-COMB (I) TO CANT-GALON.
           READ ARCHIVO-GALONAJES  WITH NO LOCK
                INVALID KEY
                        MOVE TURNO-COMB        TO TURNO-GALON
                        MOVE GALONAJE-SURTI    TO GALONAJE-GALON
                        MOVE VALOR-COMB    (I) TO VENTA-GALON
                        MOVE CANTIDAD-COMB (I) TO CANT-GALON
                        MOVE VEND-COMB         TO VEND-GALON
                        WRITE REG-GALON END-WRITE
                NOT INVALID KEY
                        MOVE TURNO-COMB        TO TURNO-GALON
                        MOVE GALONAJE-SURTI    TO GALONAJE-GALON
                        MOVE VALOR-COMB    (I) TO VENTA-GALON
                        MOVE CANTIDAD-COMB (I) TO CANT-GALON
                        MOVE VEND-COMB         TO VEND-GALON
                        REWRITE REG-GALON END-REWRITE
           END-READ.


       CERRAR-ARCHIVO.

           MOVE 00    TO DAT0-ENV
           CLOSE ARCHIVO-GALONAJES.

002147 ENVIO-DATOS.
004378     MOVE "datosrecibidos"  TO COBW3-CNV-NAME
004393     MOVE DATOS-ENVIO  TO COBW3-CNV-VALUE
004403     CALL "COBW3_SET_CNV"   USING COBW3
004413     MOVE "../PAGINAS/RECIBIDOS.ASPX"  TO SALIDA-HTML
004430     PERFORM ABRIR-HTML.

002545 CERRAR-SESION.
002546     CALL "COBW3_FREE" USING COBW3.
002547     MOVE 1 TO PROGRAM-STATUS.
002548     EXIT PROGRAM.

002566 COPY "P:\PROG\PROYECT\FUENTES\SC-WEB.CBL".
002567
