000012* GUARDA ACTUALIZACION DE SURTIDORES
000020 IDENTIFICATION DIVISION.
000021* PROGRAM-ID. "BOM101_R".
000022
000023 PROGRAM-ID. "HttpExtensionProc".
000024 ENVIRONMENT DIVISION.
000025 CONFIGURATION SECTION.
000026 INPUT-OUTPUT SECTION.
000027 FILE-CONTROL.
000080 COPY "P:\PROG\PROYECT\FUENTES\FS-USUNET.CBL".
000150 COPY "P:\PROG\PROYECT\FUENTES\FS-SESION.CBL".

000010     SELECT ARCHIVO-RESTRICCION LOCK MODE IS AUTOMATIC
000020            ASSIGN TO NOM-REST-W
000030            ORGANIZATION INDEXED;
000040            ACCESS MODE DYNAMIC;
000050            RECORD KEY LLAVE-REST
000060            ALTERNATE RECORD KEY NOMBRE-REST WITH DUPLICATES
000070            FILE STATUS OTR-STAT.

           SELECT ARCHIVO-USUARIOS LOCK MODE IS AUTOMATIC
                  ASSIGN TO NOM-USUAR-W
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC;
                  RECORD KEY IS NOMBRE-USU
                  ALTERNATE RECORD KEY IS CTL-USU     WITH DUPLICATES
                  ALTERNATE RECORD KEY IS CLAVE-USU   WITH DUPLICATES
                  ALTERNATE RECORD KEY IS CLAVE-2-USU WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.

           SELECT ARCHIVO-SURTIDORES LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-SURT-W
                  ORGANIZATION INDEXED;
                  ACCESS MODE  DYNAMIC;
                  RECORD KEY COD-SURTI
                  FILE STATUS  OTR-STAT.



           SELECT MAESTRO-ARTICULOS LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-ART-W
                  ORGANIZATION INDEXED;
                  ACCESS MODE  DYNAMIC;
                  RECORD KEY COD-ART
                  ALTERNATE RECORD KEY CLASE-ART       WITH DUPLICATES
                  ALTERNATE RECORD KEY COD-BARRAS-ART  WITH DUPLICATES
                  ALTERNATE RECORD KEY DESCRIP-ART     WITH DUPLICATES
                  ALTERNATE RECORD KEY USO-ART         WITH DUPLICATES
                  ALTERNATE RECORD KEY CL-ROTAC-ART    WITH DUPLICATES
                  ALTERNATE RECORD KEY UBICAC-ART      WITH DUPLICATES
                  ALTERNATE RECORD KEY FECHA-VENCE-ART WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.


           SELECT ARCHIVO-LOCALIZACION LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-LOCAL-W
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC;
                  RECORD KEY IS COD-LOCAL
                  ALTERNATE RECORD KEY IS LLAVE-ALT1-LOCAL WITH DUPLICATES
                  ALTERNATE RECORD KEY IS LLAVE-ALT2-LOCAL WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.

           SELECT ARCHIVO-COSTO LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-COSTO-W
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC;
                  RECORD KEY IS COD-COSTO
                  FILE STATUS IS OTR-STAT.


000400 DATA DIVISION.
000410 FILE SECTION.
000420 COPY "P:\PROG\PROYECT\FUENTES\FD-USUNET.CBL".
000421 COPY "P:\PROG\PROYECT\FUENTES\FD-SESION.CBL".
000450 COPY "P:\PROG\PROYECT\FUENTES\FD-RESTR.CBL".
000450 COPY "P:\PROG\PROYECT\FUENTES\FD-USUAR.CBL".
000450 COPY "P:\PROG\PROYECT\FUENTES\FD-SURTI.CBL".
000450 COPY "P:\PROG\PROYECT\FUENTES\FD-ARTIC.CBL".
000450 COPY "P:\PROG\PROYECT\FUENTES\FD-LOCAL.CBL".
000450 COPY "P:\PROG\PROYECT\FUENTES\FD-COSTO.CBL".

000470
000540 WORKING-STORAGE  SECTION.
000550 COPY "P:\PROG\PROYECT\FUENTES\COBW3.CBL".
000560 COPY "P:\PROG\PROYECT\FUENTES\WEB-CARAC.CBL".

000570 01 NOM-SURT-W             PIC X(70).
       01 NOM-ART-W              PIC X(70).
       01 NOM-LOCAL-W            PIC X(70).
       01 NOM-COSTO-W            PIC X(70).
000590 01 EDITADO-W              PIC X(15).
000600 01 COD-USER-W             PIC X(15).

       01 GALONAJE-W.
          02 GAL-ENT-W           PIC 9(10).
          02 GAL-DEC-W           PIC 999.

       01 DESCTO-W               PIC 9(12)V999.
       01 VARIABLE-EDIT          PIC ZZZZZZZZZZ.ZZZ.

       01 COD-ART-W.
          02 LLAVE-NRO-ART-W.
             03 LLAVE-GRUPO-ART-W.
                05 TIPO-ART-W         PIC 9.
                05 GRUPO-ART-W.
                   07 GRUPO1-ART-W    PIC X.
                   07 GRUPO2-ART-W    PIC X.
             03 NUMERO-ART-W.
                05 NRO1-ART-W         PIC XX.
                05 NRO2-ART-W         PIC X(11).
          02 CLASE-ART-W              PIC XX.


       01 LLAVE-SUT-W.
          02 GRP-W               PIC XX.
          02 NUMERO-W            PIC X(13).
          02 CLASE-W             PIC X(2).
          02 FILLER              PIC X VALUES SPACES.



 00622 01 CLAVE-CTL              PIC X(15).
000633 01  DATO-W.
000635     02 CLAVE-W            PIC X(15).


       01 LINEA-LLEGAD-W         PIC X(200).

       01 DATO-LLEGADA-W.
          02 SESION-LLEGAD-W     PIC X(29).
          02 DIRECTORIO-LLEGAD-W PIC X(30).
          02 CARPTA-LLEGAD-W     PIC X(9).
          02 NOVEDAD-LLEGAD-W    PIC X.
          02 ISLAS-LLEGAD-W      PIC X.
          02 REGISTRADORA-LLEGAD-W PIC X.
          02 NOMBR-LLEGAD-W      PIC X(20).
          02 NUMERO-LLEGAD-W.
             03 GRP-LLEGAD-W     PIC XX.
             03 NUMER-ART-LLEGAD-W PIC X(13).
             03 CLASE-LLEGAD-W   PIC XX.
          02 GALONAJE-LLEGAD-W.
             03 ENTERO-W         PIC X(10).
             03 DECIMAL-W        PIC X(3).
          02 PESOS-LLEGAD-W      PIC X(12).
          02 DESCTO-LLEGAD-W     PIC X(15).
          02 COSTO-LLEGAD-W      PIC X(4).
          02 ALM-LLEGAD-W        PIC X(5).
          02 OPER-LLEGAD-W       PIC X(4).
          02 FEC-REST-LLEGAD-W   PIC X(6).



       01  REG-SURTI-W.
           02 COD-SURTI-W.
              05 ISLA-SURTI-W    PIC X.
              05 NRO-SURTI-W     PIC X.
	   02 NOMBRE-SURTI-W     PIC X(20).
           02 PRODUCTO-SURTI-W   PIC X(18).
           02 GALONAJE-SURTI-W   PIC 9(10)V999.
           02 PESOS-SURTI-W      PIC 9(12).
           02 DESCTO-SURTI-W     PIC 9(12)V999.
           02 C-COSTO-SURTI-W    PIC X(4).
           02 ALM-SURTI-W        PIC X(5).
           02 OPER-SURTI-W       PIC X(4).
           02 FEC-REST-SURTI-W   PIC X(6).
           02 FILLER             PIC X(2000).


       01 DATOS-ENVIO.
          02 ESTADO-ENV          PIC XX.
          02 FILLER              PIC X VALUE "|".
          02 DETALLE-ENV         PIC X(20).
          02 FILLER              PIC X VALUE "|".


000730 01 COD-TMP.
000740    02 SW-ALFA             PIC 9.
000750    02 TABLA-COD1.
000760       03 COD1-PAC         PIC X OCCURS 15.
000770    02 TABLA-COD2.
000780       03 COD2-PAC         PIC X OCCURS 15.
000790
000791 LINKAGE SECTION.
000792 COPY "P:\PROG\PROYECT\FUENTES\ISAPICTX.CBL".
000793
000794 PROCEDURE DIVISION WITH stdcall LINKAGE USING ISAPI-CTX-CNT.
000795
000810 DECLARATIVES.
000811 I-O-TEST SECTION.
000812     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUNET.         
000813 ESCR-EXCEPTIONES.
000814     IF OTR-STAT = "00" OR "35"
000815        CONTINUE 
000816     ELSE
000817        MOVE OTR-STAT                TO MSJ1-HTML
000818        MOVE NOM-USU-W               TO MSJ2-HTML
000819        MOVE "BOM101_R"              TO MSJ3-HTML
000820        GO TO ENVIAR2-ERROR
000821     END-IF.
001030
001040 I-O-TEST SECTION.
001050     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SESION.         
001060 ESCR-EXCEPTIONES.
001070     IF OTR-STAT = "00" 
001080        CONTINUE
001090     ELSE
001100        MOVE OTR-STAT                TO MSJ1-HTML
001101        MOVE NOM-SESION-W            TO MSJ2-HTML
001102        MOVE "BOM101_R"              TO MSJ3-HTML
001103        GO TO ENVIAR2-ERROR
001104     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SURTIDORES.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT                TO MSJ1-HTML
006670        MOVE NOM-SURT-W              TO MSJ2-HTML
006680        MOVE "BOM101_R"              TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON MAESTRO-ARTICULOS.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT                TO MSJ1-HTML
006670        MOVE NOM-ART-W               TO MSJ2-HTML
006680        MOVE "BOM101_R"              TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-LOCALIZACION.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT                TO MSJ1-HTML
006670        MOVE NOM-LOCAL-W             TO MSJ2-HTML
006680        MOVE "BOM101_R"              TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-COSTO.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT                TO MSJ1-HTML
006670        MOVE NOM-COSTO-W             TO MSJ2-HTML
006680        MOVE "BOM101_R"              TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

001105
001150 END DECLARATIVES.
001160
001161 INICIAR-IIS.
001162     MOVE LOW-VALUE TO COBW3.
001163     MOVE FUNCTION ADDR(ISAPI-CTX-CNT) TO COBW3-CONTEXT.
001164     CALL "COBW3_INIT" USING COBW3.
001220
001221 LEER-DATO-HTML.
001852     MOVE "datosh" TO COBW3-SEARCH-DATA.
001853     CALL "COBW3_GET_VALUE" USING COBW3.
001854     MOVE COBW3-GET-DATA    TO LINEA-LLEGAD-W.

           INITIALIZE DATO-LLEGADA-W

           UNSTRING LINEA-LLEGAD-W DELIMITED BY "|"
              INTO SESION-LLEGAD-W, DIRECTORIO-LLEGAD-W, CARPTA-LLEGAD-W, NOVEDAD-LLEGAD-W, ISLAS-LLEGAD-W, REGISTRADORA-LLEGAD-W, NOMBR-LLEGAD-W
                   GRP-LLEGAD-W, NUMER-ART-LLEGAD-W, CLASE-LLEGAD-W, GALONAJE-LLEGAD-W, PESOS-LLEGAD-W, DESCTO-LLEGAD-W, COSTO-LLEGAD-W, ALM-LLEGAD-W,
                   OPER-LLEGAD-W, FEC-REST-LLEGAD-W
           END-UNSTRING.

           MOVE SESION-LLEGAD-W      TO LLAVE-SESION-W.

001238 INICIAR-SESION.
001245     MOVE "D:\WEB\MAIN-ELECT\DATOS\SC-SESION.DAT" TO NOM-SESION-W
001246
000820     MOVE FUNCTION CURRENT-DATE TO FECHA-TOTAL.
000830     ACCEPT HORA-TOTAL FROM TIME.
000810     GO TO VALIDAR-SESION.
000850
000860 FIN-VALIDAR-SESION.

001303 ABRIR-USUARIO.
001304     MOVE "D:\WEB\MAIN-ELECT\DATOS\SC-ARCHUSU.DAT" TO NOM-USU-W
001305
001306     OPEN INPUT ARCHIVO-USUNET
001307     EVALUATE OTR-STAT
001308       WHEN "00"  CONTINUE
001309       WHEN "35"  OPEN OUTPUT ARCHIVO-USUNET
001310                  CLOSE       ARCHIVO-USUNET
001311                  OPEN I-O    ARCHIVO-USUNET
001312                  INITIALIZE REG-USUNET
001314                  WRITE REG-USUNET
001315                  CLOSE       ARCHIVO-USUNET
001316                  MOVE "Validacion de usuarios"      TO MSJ1-HTML
001317                  MOVE "Falta configurar usuario"    TO MSJ2-HTML
001318                  MOVE "Sc"                          TO MSJ3-HTML
001319                  GO TO ENVIAR2-ERROR
001320       WHEN OTHER GO TO CERRAR-SESION
001321     END-EVALUATE.
001322
001332     INITIALIZE REG-USUNET.

007110 LEER-USUARIO.
007120     READ ARCHIVO-USUNET NEXT AT END MOVE 0 TO SW-FIN.
007130
007140     CLOSE ARCHIVO-USUNET.
007200     
007210     IF NOMBRE-USUNET = SPACES
007220     OR NIT-USUNET = ZEROS
007230        MOVE "Validacion de Sesion"        TO MSJ1-HTML
007240        MOVE "Falta configurar usuarios"   TO MSJ2-HTML
007250        MOVE "Sc"                          TO MSJ3-HTML
007260        GO TO ENVIAR2-ERROR
007270     END-IF.

       INICIAR-RESTRICION.

           INSPECT IP-DATOS-USUNET REPLACING FIRST "/" BY "\"
001614     INITIALIZE NOM-SURT-W NOM-ART-W NOM-LOCAL-W NOM-COSTO-W
001615     MOVE "\\" TO NOM-SURT-W
001616
001617     INSPECT NOM-SURT-W REPLACING FIRST "                    "
001618                                    BY IP-DATOS-USUNET
001621     INSPECT NOM-SURT-W REPLACING FIRST " "
001624                                     BY "\"
007292     INSPECT NOM-SURT-W REPLACING FIRST "                              "
007293                                     BY DIRECTORIO-LLEGAD-W

007190     INSPECT NOM-SURT-W   REPLACING FIRST "                       "
007200                                       BY "\CONTROL\SC-ARCHSUR.DAT".

           MOVE NOM-SURT-W    TO NOM-ART-W NOM-LOCAL-W NOM-COSTO-W

           INSPECT NOM-ART-W  REPLACING FIRST "SC-ARCHSUR.DAT"
                                           BY "SC-MAESART.DAT".

           INSPECT NOM-LOCAL-W REPLACING FIRST "SC-ARCHSUR.DAT"
                                            BY "SC-ALMAC.DAT  ".

           INSPECT NOM-COSTO-W REPLACING FIRST "SC-ARCHSUR.DAT"
                                            BY "SC-ARCHCOS.DAT".

       ABRIR-SURTIDORES.

           OPEN INPUT ARCHIVO-SURTIDORES
                      MAESTRO-ARTICULOS
                      ARCHIVO-LOCALIZACION
                      ARCHIVO-COSTO.

           MOVE ISLAS-LLEGAD-W          TO ISLA-SURTI
           MOVE REGISTRADORA-LLEGAD-W   TO NRO-SURTI

           READ ARCHIVO-SURTIDORES WITH NO LOCK
                INVALID KEY MOVE 1  TO SW-INVALID 
           END-READ.


           INITIALIZE REG-SURTI-W.


           MOVE NOVEDAD-LLEGAD-W       TO NOVEDAD-W

           MOVE ISLAS-LLEGAD-W         TO ISLA-SURTI-W
           MOVE REGISTRADORA-LLEGAD-W  TO NRO-SURTI-W
           MOVE NOMBR-LLEGAD-W         TO NOMBRE-SURTI-W


           MOVE 0                      TO TIPO-ART-W
           MOVE GRP-LLEGAD-W           TO GRUPO-ART-W
           MOVE NUMER-ART-LLEGAD-W     TO NUMERO-ART-W
           MOVE CLASE-LLEGAD-W         TO CLASE-ART-W


           MOVE GRP-LLEGAD-W           TO GRP-W
           MOVE NUMER-ART-LLEGAD-W     TO NUMERO-W
           MOVE CLASE-LLEGAD-W         TO CLASE-W
           MOVE LLAVE-SUT-W            TO PRODUCTO-SURTI-W

           MOVE ENTERO-W               TO GAL-ENT-W
           MOVE DECIMAL-W              TO GAL-DEC-W

           MOVE GALONAJE-W             TO GALONAJE-SURTI-W

           MOVE PESOS-LLEGAD-W         TO PESOS-SURTI-W

           MOVE DESCTO-LLEGAD-W        TO DESCTO-W
           MOVE DESCTO-W               TO DESCTO-SURTI-W

           MOVE COSTO-LLEGAD-W         TO C-COSTO-SURTI-W
           MOVE ALM-LLEGAD-W           TO ALM-SURTI-W
           MOVE OPER-LLEGAD-W          TO OPER-SURTI-W.


           IF NOVEDAD-W = 7 AND SW-INVALID = 1 GO TO NUEVO.
           IF NOVEDAD-W = 7 AND SW-INVALID = 0 GO TO ERROR-1.
           IF NOVEDAD-W = 8 AND SW-INVALID = 0 GO TO CAMBIO.
           IF NOVEDAD-W = 8 AND SW-INVALID = 1 GO TO ERROR-1.
           IF NOVEDAD-W = 9 AND SW-INVALID = 0 GO TO RETIRO.
           IF NOVEDAD-W = 9 AND SW-INVALID = 1 GO TO ERROR-1.

       NUEVO.
           PERFORM LEER-ARTICULO.
           PERFORM LEER-ALMACEN.

           IF C-COSTO-SURTI-W IS NOT = SPACES
              CONTINUE
           ELSE
              PERFORM LEER-COSTO
           END-IF

           MOVE FUNCTION CURRENT-DATE TO FEC-REST-SURTI-W
           MOVE REG-SURTI-W TO REG-SURTI
           CLOSE ARCHIVO-SURTIDORES
           OPEN I-O ARCHIVO-SURTIDORES
           WRITE REG-SURTI
           GO TO CERRAR-ARCHIVOS.

       CAMBIO.
           IF REG-SURTI-W = REG-SURTI GO TO CERRAR-ARCHIVOS.

           PERFORM LEER-ARTICULO.
           PERFORM LEER-ALMACEN.

           IF C-COSTO-SURTI-W IS NOT = SPACES
              PERFORM LEER-COSTO
           END-IF

           MOVE FUNCTION CURRENT-DATE TO FEC-REST-SURTI-W
           MOVE REG-SURTI-W TO REG-SURTI
           CLOSE ARCHIVO-SURTIDORES
           OPEN I-O ARCHIVO-SURTIDORES
           REWRITE REG-SURTI

           GO TO CERRAR-ARCHIVOS.

       RETIRO.
           CLOSE ARCHIVO-SURTIDORES.
           OPEN I-O   ARCHIVO-SURTIDORES
           DELETE     ARCHIVO-SURTIDORES

           GO TO CERRAR-ARCHIVOS.



       CERRAR-ARCHIVOS.

           CLOSE ARCHIVO-SURTIDORES
                 MAESTRO-ARTICULOS
                 ARCHIVO-LOCALIZACION
                 ARCHIVO-COSTO.

002147 ENVIO-DATOS.
004378     MOVE "datosrecibidos"  TO COBW3-CNV-NAME
004393     MOVE 00                TO COBW3-CNV-VALUE
004403     CALL "COBW3_SET_CNV"   USING COBW3
004413     MOVE "../PAGINAS/RECIBIDOS.ASPX"  TO SALIDA-HTML
004430     PERFORM ABRIR-HTML.

002545 CERRAR-SESION.
002546     CALL "COBW3_FREE" USING COBW3.
002547     MOVE 1 TO PROGRAM-STATUS.
002548     EXIT PROGRAM.


       LEER-ARTICULO.
      
           MOVE COD-ART-W  TO COD-ART
           READ MAESTRO-ARTICULOS WITH NO LOCK
                INVALID KEY MOVE 01 TO SW-INVALID
                            PERFORM CERRAR-ARCHIVOS
                            MOVE "99"       TO MSJ1-HTML
                            MOVE "Articulo invalido!" TO MSJ2-HTML
                            MOVE "BOM101_R" TO MSJ3-HTML
                            GO TO ENVIAR2-ERROR
           END-READ.

       LEER-ALMACEN.

           MOVE ALM-SURTI-W TO COD-LOCAL
           READ ARCHIVO-LOCALIZACION WITH NO LOCK
                INVALID KEY MOVE 01 TO SW-INVALID
                            PERFORM CERRAR-ARCHIVOS
                            MOVE "99"       TO MSJ1-HTML
                            MOVE "Almacen invalido!"  TO MSJ2-HTML
                            MOVE "BOM101_R" TO MSJ3-HTML
                            GO TO ENVIAR2-ERROR
           END-READ.

       LEER-COSTO.

           MOVE C-COSTO-SURTI-W TO COD-COSTO
           READ ARCHIVO-COSTO 
                INVALID KEY MOVE 01 TO SW-INVALID
                            PERFORM CERRAR-ARCHIVOS
                            MOVE "99"       TO MSJ1-HTML
                            MOVE "C-Costo invalido!" TO MSJ2-HTML
                            MOVE "BOM101_R" TO MSJ3-HTML
                            GO TO ENVIAR2-ERROR
           END-READ.


       ERROR-1.
           MOVE "99"            TO MSJ1-HTML
           MOVE SW-INVALID      TO MSJ2-HTML
           MOVE "BOM101_R"      TO MSJ3-HTML
           GO TO ENVIAR2-ERROR.

002549
002240 EDITAR-NUMERO.
002241     INSPECT EDITADO-W  CONVERTING  "ABCDEFGHIJKLMNOPQRSTUVWXYZ"
002242                                 TO "                          ".
002243
002244     MOVE EDITADO-W  TO TABLA-COD1.
002245     INITIALIZE    TABLA-COD2 SW-ALFA.
002246     MOVE 15 TO LP.
002247     PERFORM MOVER-COD VARYING LN FROM 15 BY -1
002248                         UNTIL LN < 1 OR LP < 1.
002249
002250     INSPECT TABLA-COD2 REPLACING ALL " " BY "0".
002251         
002252 MOVER-COD.
002253     IF COD1-PAC (LN) IS NUMERIC
002254     OR COD1-PAC (LN) = "-"     
002255        MOVE COD1-PAC (LN) TO COD2-PAC (LP)
002256        SUBTRACT 1 FROM LP
002257     END-IF.

002566 COPY "P:\PROG\PROYECT\FUENTES\SC-WEB.CBL".
002567
