004820*=================================================================
004830* CONSULTA DATOS DE SOBRETASA
004840*=================================================================
004850 IDENTIFICATION DIVISION.
004860 PROGRAM-ID. "HttpExtensionProc".
004870 ENVIRONMENT DIVISION.
004880 CONFIGURATION SECTION.
004890 INPUT-OUTPUT SECTION.
004900 FILE-CONTROL.
004910     COPY "P:\PROG\PROYECT\FUENTES\FS-USUNET.CBL".
004920     COPY "P:\PROG\PROYECT\FUENTES\FS-SESION.CBL".
004930
000170     SELECT ARCHIVO-USUARIOS LOCK MODE IS AUTOMATIC
000180            ASSIGN NOM-USUAR-W
000190            ORGANIZATION IS INDEXED
000200            ACCESS MODE IS DYNAMIC;
000210            RECORD KEY IS NOMBRE-USU
000220            ALTERNATE RECORD KEY IS CTL-USU     WITH DUPLICATES
000230            ALTERNATE RECORD KEY IS CLAVE-USU   WITH DUPLICATES
000240            ALTERNATE RECORD KEY IS CLAVE-2-USU WITH DUPLICATES
000250            FILE STATUS IS OTR-STAT.


           SELECT ARCHIVO-SOBRETASAS LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-SOBRE-W
                  ORGANIZATION INDEXED;
                  ACCESS MODE  DYNAMIC;
                  RECORD KEY ART-SOBRE
                  FILE STATUS IS OTR-STAT.


005080 DATA DIVISION.
005090 FILE SECTION.
005100 COPY "P:\PROG\PROYECT\FUENTES\FD-USUNET.CBL".
005110 COPY "P:\PROG\PROYECT\FUENTES\FD-SESION.CBL".
000690 COPY "P:\PROG\PROYECT\FUENTES\FD-USUAR.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-SOBRE.CBL".


005190 WORKING-STORAGE SECTION.
005200 COPY "P:\PROG\PROYECT\FUENTES\COBW3.CBL".
005210 COPY "P:\PROG\PROYECT\FUENTES\WEB-CARAC.CBL".
005220 

       77 NOM-USUAR-W               PIC X(70).
       77 NOM-SOBRE-W               PIC X(70).


001067 77  SUC-TMP                   PIC X.
005230 77  SW-VAR                    PIC 9.
005240 77  K                         PIC 99.
001252 77  MES-SAL-W                 PIC X(4).
001240 77  TAR-W                     PIC 99V9.
001250 77  VALOR-VENTA               PIC 9(12).
001251 77  IVA-TMP                   PIC 9(12).
001253 77  EXISTENCIAS-TMP           PIC S9(12)V99.
       77  NRO-EDIT                  PIC ZZZZZZZZZZZZ.
       77  PROCENTAJE-EDIT           PIC ZZ.Z.
       77  SW-USO                    PIC XX.


       01 LINEA-LLEGAD-W             PIC X(100).

       01 DATO-LLEGADA-W.
          02 SESION-LLEGAD-W         PIC X(29).
          02 DIRECTORIO-LLEGAD-W     PIC X(30).
          02 CARPTA-LLEGAD-W         PIC X(9).
          02 COD-SOBRE-LLEGAD-W.
             03 GRUPO-LLEGAD-W      PIC XX.
             03 NUMERO-LLEGAD-W     PIC X(15).
             03 FILLER              PIC X VALUE SPACE.


       01 DATOS-ENVIO.
          02 DAT0-ENV                PIC XX.
          02 FILLER                  PIC X VALUE "|".
          02 COD-ART-ENV             PIC X(18).
          02 FILLER                  PIC X VALUE "|".
          02 VALOR-SOBRE-ENV         PIC X(15).
          02 FILLER                  PIC X VALUE "|".
          02 CTA-SOBRE-ENV           PIC X(11).
          02 FILLER                  PIC X VALUE "|".
          02 VALOR-GLOBAL-ENV        PIC X(15).
          02 FILLER                  PIC X VALUE "|".
          02 CTA-GLOBAL-ENV          PIC X(11).


       01 VALOR-GLOBAL-W              PIC ZZZZZZZZZZZZ.ZZ.


006310 LINKAGE SECTION.
006320 COPY "P:\PROG\PROYECT\FUENTES\ISAPICTX.CBL".
006330 PROCEDURE DIVISION WITH stdcall LINKAGE USING ISAPI-CTX-CNT.
006340
006350 DECLARATIVES.
002570 I-O-TEST SECTION.
002580     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUARIOS.         
002590 ESCR-EXCEPTIONES.
002600     IF OTR-STAT = "00" 
002610        CONTINUE 
002620     ELSE
002630        MOVE OTR-STAT         TO MSJ1-HTML
002640        MOVE NOM-USUAR-W      TO MSJ2-HTML
002650        MOVE "BOMSOB"         TO MSJ3-HTML
002660        GO TO ENVIAR2-ERROR
002670     END-IF.

006360 I-O-TEST SECTION.
006370     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUNET.         
006380 ESCR-EXCEPTIONES.
006390     IF OTR-STAT = "00"
006400        CONTINUE 
006410     ELSE
006420        MOVE OTR-STAT         TO MSJ1-HTML
006430        MOVE NOM-USU-W        TO MSJ2-HTML
006440        MOVE "BOMSOB"         TO MSJ3-HTML
006450        GO TO ENVIAR2-ERROR
006460     END-IF.
006470
006480 I-O-TEST SECTION.
006490     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SESION.
006500 ESCR-EXCEPTIONES.
006510     IF OTR-STAT = "00" 
006520        CONTINUE 
006530     ELSE
006540        MOVE OTR-STAT         TO MSJ1-HTML
006550        MOVE NOM-SESION-W     TO MSJ2-HTML
006560        MOVE "BOMSOB"         TO MSJ3-HTML
006570        GO TO ENVIAR2-ERROR
006580     END-IF.
006590  
006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SOBRETASAS.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-SOBRE-W      TO MSJ2-HTML
006680        MOVE "BOMSOB"         TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.
006590  
006720  END DECLARATIVES.
006730
006740 INICIAR-IIS.
006750     MOVE LOW-VALUE TO COBW3.
006760     MOVE FUNCTION ADDR(ISAPI-CTX-CNT) TO COBW3-CONTEXT.
006770     CALL "COBW3_INIT" USING COBW3.
006780
006790 LEER-DATO-HTML.
006800     MOVE "datosh" TO COBW3-SEARCH-DATA.
006810     CALL "COBW3_GET_VALUE" USING COBW3.
006820     MOVE COBW3-GET-DATA    TO LINEA-LLEGAD-W.

           INITIALIZE DATO-LLEGADA-W

           UNSTRING LINEA-LLEGAD-W DELIMITED BY "|"
              INTO SESION-LLEGAD-W, DIRECTORIO-LLEGAD-W, CARPTA-LLEGAD-W, GRUPO-LLEGAD-W, NUMERO-LLEGAD-W
           END-UNSTRING.

001855     MOVE SESION-LLEGAD-W    TO LLAVE-SESION-W.
           MOVE FUNCTION CURRENT-DATE TO FECHA-TOTAL.
000830     ACCEPT HORA-TOTAL FROM TIME.
           
000797 INICIAR-SESION.
000806     MOVE "D:\WEB\MAIN-ELECT\DATOS\SC-SESION.DAT" TO NOM-SESION-W
000810     GO TO VALIDAR-SESION.
000850
000860 FIN-VALIDAR-SESION.
006840     
006900 ABRIR-USUARIO.
006910     INITIALIZE OTR-STAT.
006920     MOVE "D:\WEB\MAIN-ELECT\DATOS\SC-ARCHUSU.DAT" TO NOM-USU-W
006930
006940     OPEN INPUT ARCHIVO-USUNET
006950     EVALUATE OTR-STAT
006960       WHEN "00"  CONTINUE
006970       WHEN "35"  OPEN OUTPUT ARCHIVO-USUNET
006980                  INITIALIZE REG-USUNET
006990                  WRITE REG-USUNET
007000                  CLOSE ARCHIVO-USUNET
007010                  MOVE "Validacion de Usuario"       TO MSJ1-HTML
007020                  MOVE "Falta configurar usuarios"   TO MSJ2-HTML
007030                  MOVE "Sc"                          TO MSJ3-HTML
007040                  GO TO ENVIAR2-ERROR
007050       WHEN OTHER GO TO CERRAR-SESION
007060     END-EVALUATE.
007070
007080     INITIALIZE LLAVE-USUNET.

007110 LEER-USUARIO.
007120     READ ARCHIVO-USUNET NEXT AT END MOVE 0 TO SW-FIN.
007130
007140     CLOSE ARCHIVO-USUNET.
007200     
007210     IF NOMBRE-USUNET = SPACES
007220     OR NIT-USUNET = ZEROS
007230        MOVE "Validacion de Sesion"        TO MSJ1-HTML
007240        MOVE "Falta configurar usuarios"   TO MSJ2-HTML
007250        MOVE "Sc"                          TO MSJ3-HTML
007260        GO TO ENVIAR2-ERROR
007270     END-IF.
007280 
007350
       ASIGNAR-NOMBRES.

           INITIALIZE NOM-USUAR-W NOM-SOBRE-W

           INSPECT IP-DATOS-USUNET REPLACING FIRST "/" BY "\"
007287     MOVE "\\" TO NOM-SOBRE-W
007288     INSPECT NOM-SOBRE-W REPLACING FIRST "                    "
007289                                    BY IP-DATOS-USUNET
007290     INSPECT NOM-SOBRE-W REPLACING FIRST " "
007291                                    BY "\"
007292     INSPECT NOM-SOBRE-W REPLACING FIRST "                              "
007293                                    BY DIRECTORIO-LLEGAD-W
007294     INSPECT NOM-SOBRE-W REPLACING FIRST "                       "
007295                                    BY   "\CONTROL\SC-ARCHSOB.DAT".

           MOVE NOM-SOBRE-W    TO NOM-USUAR-W
           INSPECT NOM-USUAR-W REPLACING FIRST "SC-ARCHSOB.DAT"
                                            BY "SC-ARCHUSU.DAT".


        ABRIR-USUARIOS.

           OPEN INPUT ARCHIVO-USUARIOS
           READ ARCHIVO-USUARIOS NEXT WITH NO LOCK AT END 
                CLOSE ARCHIVO-USUARIOS
           END-READ.

       ABRIR-COSTO.

           OPEN INPUT ARCHIVO-SOBRETASAS.

           MOVE GRUPO-LLEGAD-W    TO GRUPO-SOBRE
           MOVE NUMERO-LLEGAD-W   TO COD-ART-SOBRE
           READ ARCHIVO-SOBRETASAS WITH NO LOCK
                INVALID KEY
                        MOVE "99"       TO MSJ1-HTML
                        MOVE 01         TO MSJ2-HTML
                        MOVE "BOMSOB"   TO MSJ3-HTML
                        GO TO ENVIAR2-ERROR
           END-READ.

           MOVE 00                 TO DAT0-ENV
           MOVE ART-SOBRE          TO COD-ART-ENV

           MOVE VALOR-SOBRE        TO VALOR-GLOBAL-W
           MOVE VALOR-GLOBAL-W     TO VALOR-SOBRE-ENV
                                  
           MOVE CTA-SOBRE          TO CTA-SOBRE-ENV

           MOVE VALOR-GLOBAL-SOBRE TO VALOR-GLOBAL-W
           MOVE VALOR-GLOBAL-W     TO VALOR-GLOBAL-ENV

           MOVE CTA-GLOBAL-SOBRE   TO CTA-GLOBAL-ENV


008950     CLOSE ARCHIVO-SOBRETASAS.

010700 PAGINA-CONFIG.  
010720     MOVE "datosrecibidos" TO COBW3-CNV-NAME
010730     MOVE DATOS-ENVIO      TO COBW3-CNV-VALUE
010740     CALL "COBW3_SET_CNV" USING COBW3
010750
010760     MOVE "..\PAGINAS\RECIBIDOS.ASPX" TO SALIDA-HTML  
010770     PERFORM ABRIR-HTML.

007980   
007990 CERRAR-SESION.
008000     CALL "COBW3_FREE" USING COBW3.
008010     MOVE 1 TO PROGRAM-STATUS.
008020     EXIT PROGRAM.

008040 COPY "P:\PROG\PROYECT\FUENTES\SC-WEB.CBL".
