000012* CREA JSON MAESTRO VEHICULOS
000020 IDENTIFICATION DIVISION.
000021* PROGRAM-ID. "CER101_R".
000022
000023 PROGRAM-ID. "HttpExtensionProc".
000024 ENVIRONMENT DIVISION.
000025 CONFIGURATION SECTION.
000026 INPUT-OUTPUT SECTION.
000027 FILE-CONTROL.
000080 COPY "P:\PROG\PROYECT\FUENTES\FS-USUNET.CBL".
000150 COPY "P:\PROG\PROYECT\FUENTES\FS-SESION.CBL".


           SELECT ARCHIVO-USUARIOS LOCK MODE IS AUTOMATIC
                  ASSIGN TO NOM-USUAR-W
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC;
                  RECORD KEY IS NOMBRE-USU
                  ALTERNATE RECORD KEY IS CTL-USU     WITH DUPLICATES
                  ALTERNATE RECORD KEY IS CLAVE-USU   WITH DUPLICATES
                  ALTERNATE RECORD KEY IS CLAVE-2-USU WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.


           SELECT ARCHIVO-TERCEROS  LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-TER-W
                  ORGANIZATION IS INDEXED;
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS COD-TERCERO
                  ALTERNATE RECORD KEY DESCRIP-TER WITH DUPLICATES
                  ALTERNATE RECORD KEY ACT-TER     WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.


           SELECT ARCHIVO-CARROS LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-CAR-W
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS PLACA-CAR
                  ALTERNATE RECORD KEY IS PRO-TPROP-CAR WITH DUPLICATES
                  ALTERNATE RECORD KEY IS TIT-TPROP-CAR WITH DUPLICATES
                  ALTERNATE RECORD KEY IS COND-CAR      WITH DUPLICATES
                  ALTERNATE RECORD KEY IS RELEV-CAR     WITH DUPLICATES
                  ALTERNATE RECORD KEY EMPRESA-CAR      WITH DUPLICATES
                  ALTERNATE RECORD KEY CHASIS-CAR       WITH DUPLICATES
                  ALTERNATE RECORD KEY IS INTERNO-CAR   WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.


000400 DATA DIVISION.
000410 FILE SECTION.
000420 COPY "P:\PROG\PROYECT\FUENTES\FD-USUNET.CBL".
000421 COPY "P:\PROG\PROYECT\FUENTES\FD-SESION.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-USUAR.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-TERCE.CBL".
000450 COPY "P:\PROG\PROYECT\FUENTES\FD-CARRO.CBL".


000540 WORKING-STORAGE  SECTION.
000550 COPY "P:\PROG\PROYECT\FUENTES\COBW3.CBL".
000560 COPY "P:\PROG\PROYECT\FUENTES\WEB-CARAC.CBL".

       01 NOM-USUAR-W            PIC X(70).
000570 01 NOM-CAR-W              PIC X(70).
       01 NOM-TER-W              PIC X(70).
000590 01 EDITADO-W              PIC X(15).
000600 01 COD-USER-W             PIC X(15).
000622 01 CLAVE-CTL              PIC X(15).
000633 01  DATO-W.
000635     02 CLAVE-W            PIC X(15).


       01 LINEA-LLEGAD-W         PIC X(100).

       01 DATO-LLEGADA-W.
          02 SESION-LLEGAD-W     PIC X(29).
          02 DIRECTORIO-LLEGAD-W PIC X(30).
          02 CARPTA-LLEGAD-W     PIC X(9).
          02 NOVEDAD-LLEGAD-W    PIC X.
          02 PLACA-CAR-W         PIC X(6).
          02 MARCA-CAR-W         PIC X(15).
          02 MODELO-CAR-W        PIC X(4).
          02 AVALUO-CAR-W        PIC X(9).
          02 TIPO-CAR-W          PIC X(15).
          02 COND-CAR-W          PIC X(10).
          02 EMPRESA-CAR-W       PIC X(30).
          02 COLOR-CAR-W         PIC X(15).
          02 MOTOR-CAR-W         PIC X(15).
          02 CHASIS-CAR-W        PIC X(15).
          02 PRO-TPROP-CAR-W     PIC X(10).
          02 TEL-CAR-W           PIC X(20).


000730 01 COD-TMP.
000740    02 SW-ALFA             PIC 9.
000750    02 TABLA-COD1.
000760       03 COD1-PAC         PIC X OCCURS 15.
000770    02 TABLA-COD2.
000780       03 COD2-PAC         PIC X OCCURS 15.
000790
000791 LINKAGE SECTION.
000792 COPY "P:\PROG\PROYECT\FUENTES\ISAPICTX.CBL".
000793
000794 PROCEDURE DIVISION WITH stdcall LINKAGE USING ISAPI-CTX-CNT.
000795
000810 DECLARATIVES.
000811 I-O-TEST SECTION.
000812     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUNET.         
000813 ESCR-EXCEPTIONES.
000814     IF OTR-STAT = "00"
000815        CONTINUE 
000816     ELSE
000817        MOVE OTR-STAT                TO MSJ1-HTML
000818        MOVE NOM-USU-W               TO MSJ2-HTML
000819        MOVE "CER101"                TO MSJ3-HTML
000820        GO TO ENVIAR2-ERROR
000821     END-IF.
001030
001040 I-O-TEST SECTION.
001050     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SESION.         
001060 ESCR-EXCEPTIONES.
001070     IF OTR-STAT = "00"
001080        CONTINUE
001090     ELSE
001100        MOVE OTR-STAT                TO MSJ1-HTML
001101        MOVE NOM-SESION-W            TO MSJ2-HTML
001102        MOVE "CER101"                TO MSJ3-HTML
001103        GO TO ENVIAR2-ERROR
001104     END-IF.

001040 I-O-TEST SECTION.
001050     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUARIOS.
001060 ESCR-EXCEPTIONES.
001070     IF OTR-STAT = "00"
001080        CONTINUE
001090     ELSE
001100        MOVE OTR-STAT                TO MSJ1-HTML
001101        MOVE NOM-USUAR-W             TO MSJ2-HTML
001102        MOVE "CER101"                TO MSJ3-HTML
001103        GO TO ENVIAR2-ERROR
001104     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-CARROS.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT                TO MSJ1-HTML
006670        MOVE NOM-CAR-W               TO MSJ2-HTML
006680        MOVE "CER101"                TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-TERCEROS.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT                TO MSJ1-HTML
006670        MOVE NOM-TER-W               TO MSJ2-HTML
006680        MOVE "CER101"                TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

001150 END DECLARATIVES.
001160
001161 INICIAR-IIS.
001162     MOVE LOW-VALUE TO COBW3.
001163     MOVE FUNCTION ADDR(ISAPI-CTX-CNT) TO COBW3-CONTEXT.
001164     CALL "COBW3_INIT" USING COBW3.
001220
001221 LEER-DATO-HTML.
001852     MOVE "datosh" TO COBW3-SEARCH-DATA.
001853     CALL "COBW3_GET_VALUE" USING COBW3.
001854     MOVE COBW3-GET-DATA    TO LINEA-LLEGAD-W.

           INITIALIZE DATO-LLEGADA-W

           UNSTRING LINEA-LLEGAD-W DELIMITED BY "|"
              INTO SESION-LLEGAD-W, DIRECTORIO-LLEGAD-W, CARPTA-LLEGAD-W, NOVEDAD-LLEGAD-W, ADMIN-W, PLACA-CAR-W, 
                   MARCA-CAR-W, MODELO-CAR-W, AVALUO-CAR-W, TIPO-CAR-W, COND-CAR-W, EMPRESA-CAR-W, COLOR-CAR-W, 
                   MOTOR-CAR-W, CHASIS-CAR-W, PRO-TPROP-CAR-W, TEL-CAR-W
           END-UNSTRING.

001855     MOVE SESION-LLEGAD-W    TO LLAVE-SESION-W.
           MOVE FUNCTION CURRENT-DATE TO FECHA-TOTAL.
000830     ACCEPT HORA-TOTAL FROM TIME.

001238 INICIAR-SESION.
001245     MOVE "D:\WEB\MAIN-ELECT\DATOS\SC-SESION.DAT" TO NOM-SESION-W
001246
000820     MOVE FUNCTION CURRENT-DATE TO FECHA-TOTAL.
000830     ACCEPT HORA-TOTAL FROM TIME.
000810     GO TO VALIDAR-SESION.
000850
000860 FIN-VALIDAR-SESION.

001303 ABRIR-USUARIO.
001304     MOVE "D:\WEB\MAIN-ELECT\DATOS\SC-ARCHUSU.DAT" TO NOM-USU-W
001305
001306     OPEN INPUT ARCHIVO-USUNET
001307     EVALUATE OTR-STAT
001308       WHEN "00"  CONTINUE
001309       WHEN "35"  OPEN OUTPUT ARCHIVO-USUNET
001310                  CLOSE       ARCHIVO-USUNET
001311                  OPEN I-O    ARCHIVO-USUNET
001312                  INITIALIZE REG-USUNET
001314                  WRITE REG-USUNET
001315                  CLOSE       ARCHIVO-USUNET
001316                  MOVE "Validacion de usuarios"      TO MSJ1-HTML
001317                  MOVE "Falta configurar usuario"    TO MSJ2-HTML
001318                  MOVE "Sc"                          TO MSJ3-HTML
001319                  GO TO ENVIAR2-ERROR
001320       WHEN OTHER GO TO CERRAR-SESION
001321     END-EVALUATE.
001322
001332     INITIALIZE REG-USUNET.

007110 LEER-USUARIO.
007120     READ ARCHIVO-USUNET NEXT AT END MOVE 0 TO SW-FIN.
007130
007140     CLOSE ARCHIVO-USUNET.
007200     
007210     IF NOMBRE-USUNET = SPACES
007220     OR NIT-USUNET = ZEROS
007230        MOVE "Validacion de Sesion"        TO MSJ1-HTML
007240        MOVE "Falta configurar usuarios"   TO MSJ2-HTML
007250        MOVE "Sc"                          TO MSJ3-HTML
007260        GO TO ENVIAR2-ERROR
007270     END-IF.

       INICIAR-RESTRICION.

           INSPECT IP-DATOS-USUNET REPLACING FIRST "/" BY "\"
001614     INITIALIZE NOM-USUAR-W NOM-CAR-W
001615     MOVE "\\" TO NOM-USUAR-W NOM-CAR-W
001616
001617     INSPECT NOM-USUAR-W REPLACING FIRST "                    "
001618                                    BY IP-DATOS-USUNET
001621     INSPECT NOM-USUAR-W REPLACING FIRST " "
001624                                     BY "\"
007292     INSPECT NOM-USUAR-W REPLACING FIRST "                              "
007293                                     BY DIRECTORIO-LLEGAD-W

           MOVE NOM-USUAR-W TO NOM-TER-w

           INSPECT NOM-USUAR-W REPLACING FIRST "                       "
                                            BY "\CONTROL\SC-ARCHUSU.DAT".

           INSPECT NOM-TER-W REPLACING FIRST "                       "
                                          BY "\CONTROL\SC-ARCHTER.DAT".


           INSPECT NOM-CAR-W REPLACING FIRST "                    "
                                          BY IP-DATOS-USUNET

           INSPECT NOM-CAR-W REPLACING FIRST "                         "
                                          BY "\PROG\DATOS\SC-CARROS.DAT".

       ABRIR-USUARIO.

           OPEN INPUT ARCHIVO-USUARIOS.
           READ ARCHIVO-USUARIOS NEXT WITH NO LOCK AT END 
                CLOSE ARCHIVO-USUARIOS
           END-READ.


       ABRIR-ARCHIVOS.

           OPEN INPUT ARCHIVO-CARROS
                      ARCHIVO-TERCEROS.


           MOVE PLACA-CAR-W     TO PLACA-CAR
           READ ARCHIVO-CARROS WITH NO LOCK
                INVALID KEY MOVE 1 TO SW-INVALID
           END-READ.

           MOVE COND-CAR-W        TO COD-TER
           PERFORM LEER-TERCERO

           MOVE PRO-TPROP-CAR-W   TO COD-TER
           PERFORM LEER-TERCERO

           MOVE NOVEDAD-LLEGAD-W       TO NOVEDAD-W

           IF NOVEDAD-W = 7 AND SW-INVALID = 1 GO TO NUEVO.
           IF NOVEDAD-W = 7 AND SW-INVALID = 0 GO TO ERROR-1.
           IF NOVEDAD-W = 8 AND SW-INVALID = 0 GO TO CAMBIO.
           IF NOVEDAD-W = 8 AND SW-INVALID = 1 GO TO ERROR-1.
           IF NOVEDAD-W = 9 AND SW-INVALID = 0 GO TO RETIRO.
           IF NOVEDAD-W = 9 AND SW-INVALID = 1 GO TO ERROR-1.

       NUEVO.

           CLOSE ARCHIVO-CARROS
           OPEN I-O ARCHIVO-CARROS

           MOVE PLACA-CAR-W         TO PLACA-CAR
           MOVE MARCA-CAR-W         TO MARCA-CAR
           MOVE MODELO-CAR-W        TO MODELO-CAR
           MOVE AVALUO-CAR-W        TO AVALUO-CAR
           MOVE TIPO-CAR-W          TO TIPO-CAR
           MOVE COND-CAR-W          TO COND-CAR
           MOVE EMPRESA-CAR-W       TO EMPRESA-CAR
           MOVE COLOR-CAR-W         TO COLOR-CAR
           MOVE MOTOR-CAR-W         TO MOTOR-CAR
           MOVE CHASIS-CAR-W        TO CHASIS-CAR
           MOVE PRO-TPROP-CAR-W     TO PRO-TPROP-CAR
           MOVE TEL-CAR-W           TO TEL-CAR

           MOVE ADMIN-W             TO OPER-CRE-CAR
           MOVE FUNCTION CURRENT-DATE TO FECHA-CRE-CAR
           ACCEPT HORA-CRE-CAR FROM TIME

           WRITE REG-CARROS END-WRITE
           GO TO CERRAR-ARCHIVOS.


       CAMBIO.

           CLOSE ARCHIVO-CARROS
           OPEN I-O ARCHIVO-CARROS

           MOVE PLACA-CAR-W         TO PLACA-CAR
           MOVE MARCA-CAR-W         TO MARCA-CAR
           MOVE MODELO-CAR-W        TO MODELO-CAR
           MOVE AVALUO-CAR-W        TO AVALUO-CAR
           MOVE TIPO-CAR-W          TO TIPO-CAR
           MOVE COND-CAR-W          TO COND-CAR
           MOVE EMPRESA-CAR-W       TO EMPRESA-CAR
           MOVE COLOR-CAR-W         TO COLOR-CAR
           MOVE MOTOR-CAR-W         TO MOTOR-CAR
           MOVE CHASIS-CAR-W        TO CHASIS-CAR
           MOVE PRO-TPROP-CAR-W     TO PRO-TPROP-CAR
           MOVE TEL-CAR-W           TO TEL-CAR

           MOVE ADMIN-W             TO OPER-MOD-CAR
           MOVE FUNCTION CURRENT-DATE TO FECHA-MOD-CAR
           ACCEPT HORA-MOD-CAR FROM TIME

           REWRITE REG-CARROS END-REWRITE
           GO TO CERRAR-ARCHIVOS.

       RETIRO.
           CLOSE ARCHIVO-CARROS
           OPEN I-O   ARCHIVO-CARROS
           DELETE     ARCHIVO-CARROS.

       CERRAR-ARCHIVOS.
           CLOSE ARCHIVO-CARROS
                 ARCHIVO-TERCEROS.


002147 ENVIO-DATOS.
004378     MOVE "datosrecibidos"  TO COBW3-CNV-NAME
004393     MOVE 00       TO COBW3-CNV-VALUE
004403     CALL "COBW3_SET_CNV"   USING COBW3
004413     MOVE "../PAGINAS/RECIBIDOS.ASPX"  TO SALIDA-HTML
004430     PERFORM ABRIR-HTML.

002545 CERRAR-SESION.
002546     CALL "COBW3_FREE" USING COBW3.
002547     MOVE 1 TO PROGRAM-STATUS.
002548     EXIT PROGRAM.
002549
002240 EDITAR-NUMERO.
002241     INSPECT EDITADO-W  CONVERTING  "ABCDEFGHIJKLMNOPQRSTUVWXYZ"
002242                                 TO "                          ".
002243
002244     MOVE EDITADO-W  TO TABLA-COD1.
002245     INITIALIZE    TABLA-COD2 SW-ALFA.
002246     MOVE 15 TO LP.
002247     PERFORM MOVER-COD VARYING LN FROM 15 BY -1
002248                         UNTIL LN < 1 OR LP < 1.
002249
002250     INSPECT TABLA-COD2 REPLACING ALL " " BY "0".
002251         
002252 MOVER-COD.
002253     IF COD1-PAC (LN) IS NUMERIC
002254     OR COD1-PAC (LN) = "-"     
002255        MOVE COD1-PAC (LN) TO COD2-PAC (LP)
002256        SUBTRACT 1 FROM LP
002257     END-IF.

       ERROR-1.
           MOVE "99"            TO MSJ1-HTML
           MOVE SW-INVALID      TO MSJ2-HTML
           MOVE "BOM101_R"      TO MSJ3-HTML
           GO TO ENVIAR2-ERROR.

       LEER-TERCERO.

           READ ARCHIVO-TERCEROS WITH NO LOCK
                INVALID KEY
                        CLOSE ARCHIVO-CARROS
                        CLOSE ARCHIVO-TERCEROS
                        MOVE "99"       TO MSJ1-HTML
                        MOVE "Tercero no existe" TO MSJ2-HTML
                        MOVE "CER101_R" TO MSJ3-HTML
                        GO TO ENVIAR2-ERROR
           END-READ.

002566 COPY "P:\PROG\PROYECT\FUENTES\SC-WEB.CBL".
002567
