000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. CON007.
000030*   CONTABILIDAD - BUSCA EL ULTIMO NUMERO DE UNA SECUENCIA.
000040 ENVIRONMENT     DIVISION.
000050 INPUT-OUTPUT SECTION.
000060 FILE-CONTROL. 
000070     SELECT ARCHIVO-LOTES LOCK MODE IS AUTOMATIC
000080	          ASSIGN NOM-LOTE-LNK
000090            ORGANIZATION IS INDEXED;
000100            ACCESS MODE  IS DYNAMIC
000110            RECORD KEY   IS COD-LOTE
000120            ALTERNATE RECORD KEY IS NOMBRE-LOTE WITH DUPLICATES
000130            FILE STATUS IS OTR-STAT.
000140 COPY "P:\PROG\PROYECT\FUENTES\FS-MOVIM.CBL".
000150
000160 DATA DIVISION.
000170 FILE SECTION.
000180 COPY "P:\PROG\PROYECT\FUENTES\FD-LOTES.CBL".
000190 COPY "P:\PROG\PROYECT\FUENTES\FD-MOVIM.CBL".
000200
000210 WORKING-STORAGE SECTION.
000220 COPY "P:\PROG\PROYECT\FUENTES\WEB-CARAC.CBL".
000230
000240 
000250 77 COMP-ANT                              PIC 9(6).
000260 77 NRO-ULT-COMP-W                        PIC 9(6).
000270 77 SW9                                   PIC 9.
000280 77 SEC-W                                 PIC X(50).
000290 77 ULT-NRO-W                             PIC 9(9).
000300 01 DIR-CAJ-W                             PIC X(30).
000310
000320 01 SECUENC-EDIT.
000330    02 SEC1-EDIT                          PIC 9.
000340    02 SEC2-EDIT                          PIC XX.
000350
000360 LINKAGE SECTION.
000370
000380 01 NOMBRE-LNK               PIC X(30).
000390 01 DIRECTORIO-W             PIC X(35).
000400 01 INVALID-007              PIC X(80).
000410 01 DATO-ULT-MOV-LNK.
000420    02 LOTE-ULT-MOV-LNK.
000430       03 LOTE1-ULT-MOV-LNK  PIC X.
000440       03 LOTE2-ULT-MOV-LNK  PIC X.
000441       03 LOTE3-ULT-MOV-LNK  PIC X.
000450    02 NRO-ULT-COMP-LNK.
000460       03 NRO1-ULT-COMP-LNK  PIC 9(3).
000470       03 NRO2-ULT-COMP-LNK  PIC 9(6).
000480    02 FECHA-ULT-MOV-LNK.
000490       03 ANO-ULT-MOV-LNK    PIC 99.
000500       03 MES-ULT-MOV-LNK    PIC 99.
000510       03 DIA-ULT-MOV-LNK    PIC 99.
000520
000530 01 SW-INVALID-W               PIC 99.
000540 01 MENSAJE-W                  PIC X(70).
000550
000560 PROCEDURE DIVISION USING NOMBRE-LNK DIRECTORIO-W INVALID-007 DATO-ULT-MOV-LNK SW-INVALID-W MENSAJE-W.
000570
000580 DECLARATIVES.                    
000590 I-O-TEST SECTION.
000600     USE AFTER EXCEPTION PROCEDURE ON MOVIMIENTO-DIARIO.
000610 ESCR-EXCEPTIONES.
000620     IF OTR-STAT = "00"
000630        CONTINUE
000640     ELSE
000650        MOVE OTR-STAT TO INVALID-007  
000660        MOVE NOM-MOV  TO MENSAJE-W     
000670        GO TO SALIR.
000680
000690 I-O-TEST SECTION.
000700     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-LOTES.         
000710 ESCR-EXCEPTIONES.
000720     IF OTR-STAT = "00" 
000730        CONTINUE 
000740     ELSE
000750        MOVE OTR-STAT TO INVALID-007 
000760        MOVE NOM-LOTE-LNK TO MENSAJE-W      
000770        GO TO SALIR   
000780     END-IF.
000790
000800 END DECLARATIVES.
000810 PROCEDURAL SECTION.
000820
000830 ASIGNAR-NOMBRE.
000840
000850     MOVE NOMBRE-LNK TO NOM-LOTE-LNK
000860     INSPECT NOM-LOTE-LNK   REPLACING FIRST "                           "
000870                                         BY "\PROG\DATOS\SC-ARCHLOTE.DAT".
000880
000890     OPEN INPUT ARCHIVO-LOTES
000900     MOVE LOTE-ULT-MOV-LNK   TO COD-LOTE
000910     READ ARCHIVO-LOTES WITH NO LOCK
000920          INVALID KEY
000930            IF LOTE2-ULT-MOV-LNK = "Q"
000940               MOVE 0 TO CONSEC-LOTE
000950            ELSE
000960               MOVE 1 TO CONSEC-LOTE 
000970            END-IF
000980     END-READ
000990     CLOSE ARCHIVO-LOTES.
001000
001010     MOVE DIRECTORIO-W   TO DIR-CAJ-W.
001020
001030     INSPECT DIR-CAJ-W REPLACING FIRST "\ENE "  BY    "     ".
001040     INSPECT DIR-CAJ-W REPLACING FIRST "\FEB "  BY    "     ".
001050     INSPECT DIR-CAJ-W REPLACING FIRST "\MAR "  BY    "     ".
001060     INSPECT DIR-CAJ-W REPLACING FIRST "\ABR "  BY    "     ".
001070     INSPECT DIR-CAJ-W REPLACING FIRST "\MAY "  BY    "     ".
001080     INSPECT DIR-CAJ-W REPLACING FIRST "\JUN "  BY    "     ".
001090     INSPECT DIR-CAJ-W REPLACING FIRST "\JUL "  BY    "     ".
001100     INSPECT DIR-CAJ-W REPLACING FIRST "\AGT "  BY    "     ".
001110     INSPECT DIR-CAJ-W REPLACING FIRST "\SEP "  BY    "     ".
001120     INSPECT DIR-CAJ-W REPLACING FIRST "\OCT "  BY    "     ".
001130     INSPECT DIR-CAJ-W REPLACING FIRST "\NOV "  BY    "     ".
001140     INSPECT DIR-CAJ-W REPLACING FIRST "\DIC "  BY    "     ".
001150     INSPECT DIR-CAJ-W REPLACING FIRST "\CIE "  BY    "     ".
001160
001170     MOVE NOMBRE-LNK TO NOM-MOV
001180     IF CONSEC-LOTE = 1
001190        INSPECT NOM-MOV REPLACING FIRST "                              "
001200                                     BY DIR-CAJ-W
001210        INSPECT NOM-MOV REPLACING FIRST "                       "
001220                                     BY "\CONTROL\SC-ARCHMOV.DAT"
001230     ELSE
001240        INSPECT NOM-MOV REPLACING FIRST "                                   "
001250                                     BY DIRECTORIO-W
001260        INSPECT NOM-MOV REPLACING FIRST "               "
001270                                     BY "\SC-ARCHMOV.DAT"
001280     END-IF.
001290
001293
001294
001300
001310 ABRIR-MOVIMIENTO.
001320     OPEN INPUT MOVIMIENTO-DIARIO.
001321
001340     EVALUATE OTR-STAT
001350        WHEN "00"  GO TO LEER-NUMERACION
001360        WHEN "35"  OPEN OUTPUT MOVIMIENTO-DIARIO
001370                   CLOSE       MOVIMIENTO-DIARIO
001380                   GO TO ABRIR-MOVIMIENTO
001390        WHEN OTHER GO TO CERRAR-ARCHIVOS
001400     END-EVALUATE.
001410
001420 LEER-NUMERACION.
001430     INITIALIZE MOV-DIARIO.
001440     MOVE "99999999" TO LLAVE-COMP-MOV.
001450     MOVE LOTE-ULT-MOV-LNK TO SECU-MOV.
001480
001490     READ MOVIMIENTO-DIARIO RECORD KEY IS SECUENCIA-MOV
001500          INVALID KEY  CLOSE    MOVIMIENTO-DIARIO
001510                       OPEN I-O MOVIMIENTO-DIARIO
001520                       INITIALIZE ULT-NRO-MOV CONSEC-LTF-MOV 
001530                       MOVE "ULTIMO COMPROBANTE" TO DETALLE-MOV
001540                       WRITE MOV-DIARIO END-WRITE
001542     END-READ.
001543
001560     IF ULT-NRO-MOV IS NOT NUMERIC
001570        INITIALIZE ULT-NRO-MOV
001580     END-IF.
001590
001600     IF CONSEC-LTF-MOV  IS NOT NUMERIC
001610        INITIALIZE CONSEC-LTF-MOV 
001620     END-IF.
001630
001640     MOVE FECHA-VENCE-MOV  TO FECHA-ULT-MOV-LNK.
001650
001660     IF LOTE2-ULT-MOV-LNK = "Q"
001670        MOVE ULT-NROPQ-MOV TO ULT-NRO-W
001680        ADD  1             TO ULT-NRO-W
001690        MOVE ULT-NRO-W     TO NRO-ULT-COMP-LNK
001700     ELSE
001710        INITIALIZE            NRO-ULT-COMP-LNK
001720        MOVE ULT-NRO-MOV   TO NRO2-ULT-COMP-LNK
001730        ADD  1             TO NRO2-ULT-COMP-LNK
001740     END-IF.
001750
001760     IF LOTE-ULT-MOV-LNK = "LT"
001770        MOVE CONSEC-LTF-MOV TO NRO-ULT-COMP-LNK
001780        ADD  1              TO NRO2-ULT-COMP-LNK
001790     END-IF.
001800
001810 CERRAR-ARCHIVOS.
001820     CLOSE MOVIMIENTO-DIARIO.
001830
001840 SALIR.
001850     EXIT PROGRAM.
001860
