004820*=================================================================
004830* CONSULTA DE FACTURAS PARA EVITAR DOBLE CAUSACION.
      *                        BUSCA EN LA CUENTAS 13
004840*=================================================================
004850 IDENTIFICATION DIVISION.
004860 PROGRAM-ID. "HttpExtensionProc".
004870 ENVIRONMENT DIVISION.
004880 CONFIGURATION SECTION.
004890 INPUT-OUTPUT SECTION.
004900 FILE-CONTROL.
004910     COPY "P:\PROG\PROYECT\FUENTES\FS-USUNET.CBL".
004920     COPY "P:\PROG\PROYECT\FUENTES\FS-SESION.CBL".
004930
000170     SELECT ARCHIVO-USUARIOS LOCK MODE IS AUTOMATIC
000180            ASSIGN NOM-USUAR-W
000190            ORGANIZATION IS INDEXED
000200            ACCESS MODE IS DYNAMIC;
000210            RECORD KEY IS NOMBRE-USU
000220            ALTERNATE RECORD KEY IS CTL-USU     WITH DUPLICATES
000230            ALTERNATE RECORD KEY IS CLAVE-USU   WITH DUPLICATES
000240            ALTERNATE RECORD KEY IS CLAVE-2-USU WITH DUPLICATES
000250            FILE STATUS IS OTR-STAT.


           SELECT MOVIMIENTO-DIARIO LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-MOV-W
                  ORGANIZATION IS INDEXED;
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS LLAVE-MOV
                  ALTERNATE RECORD KEY SECUENCIA-MOV
                  ALTERNATE RECORD KEY LLAVE-FEC
                  ALTERNATE RECORD KEY LLAVE-DOC-MOV   WITH DUPLICATES
                  ALTERNATE RECORD KEY COSTO-MOV       WITH DUPLICATES
                  ALTERNATE RECORD KEY NRO-ORD-MOV     WITH DUPLICATES
                  ALTERNATE RECORD KEY LLAVE-LIBRE-MOV WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.

005070
005080 DATA DIVISION.
005090 FILE SECTION.
005100 COPY "P:\PROG\PROYECT\FUENTES\FD-USUNET.CBL".
005110 COPY "P:\PROG\PROYECT\FUENTES\FD-SESION.CBL".
000690 COPY "P:\PROG\PROYECT\FUENTES\FD-USUAR.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-MOVIM.CBL".

005190 WORKING-STORAGE SECTION.
005200 COPY "P:\PROG\PROYECT\FUENTES\COBW3.CBL".
005210 COPY "P:\PROG\PROYECT\FUENTES\WEB-CARAC.CBL".
005220 

       77 NOM-USUAR-W                PIC X(70).
       77 NOM-MOV-W                  PIC X(70).
       77 SW-MES                     PIC 99.
       77 NOM-EDIT                   PIC X(25).
       77 DIRECTORIO-EDIT            PIC X(70).
       77 ANO-SIG                    PIC 9(4).
       77 ANO-CTL                    PIC 99.

       01 LINEA-LLEGAD-W             PIC X(100).

       01 DATO-LLEGADA-W.
          02 SESION-LLEGAD-W        PIC X(29).
          02 DIRECTORIO-LLEGAD-W    PIC X(30).
          02 CARPTA-LLEGAD-W        PIC X(5).
          02 FECHA-LLEGAD-W         PIC X(6).
          02 NIT-LLEGAD-W           PIC X(10).
          02 DOCUM-LLEGAD-W.
             03 TIPO-W              PIC X.
             03 NRO-DOC-W           PIC X(5).

       01 DOCUM-MOV-TMP.
          02 TIPO-DOC-MOV-TMP        PIC X.
          02 NRO-DOC-MOV-TMP         PIC 9(5).


       01 FECHA-LNK.
          02 ANO-LNK           PIC 99.
          02 MES-LNK           PIC 99.
          02 DIA-LNK           PIC 99.

       01  ANO-DIR.
           02 ANO1-DIR        PIC 9.
           02 ANO2-DIR        PIC 9.


       01 DIR-W.
          02 CAR-DIR           PIC X OCCURS 20.

       01 FECHA-W.
          02 ANO-W             PIC 99.
          02 MES-W             PIC 99.
          02 DIA-W             PIC 99.


006310 LINKAGE SECTION.
006320 COPY "P:\PROG\PROYECT\FUENTES\ISAPICTX.CBL".
006330 PROCEDURE DIVISION WITH stdcall LINKAGE USING ISAPI-CTX-CNT.
006340
006350 DECLARATIVES.
002570 I-O-TEST SECTION.
002580     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUARIOS.         
002590 ESCR-EXCEPTIONES.
002600     IF OTR-STAT = "00" 
002610        CONTINUE 
002620     ELSE
002630        MOVE OTR-STAT         TO MENSAJE1-HTML
002640        MOVE NOM-USUAR-W      TO MENSAJE2-HTML
002650        MOVE "CON807B"        TO MENSAJE3-HTML
002660        GO TO MOSTRAR-ERROR
002670     END-IF.

006360 I-O-TEST SECTION.
006370     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUNET.         
006380 ESCR-EXCEPTIONES.
006390     IF OTR-STAT = "00"
006400        CONTINUE 
006410     ELSE
006420        MOVE OTR-STAT         TO MENSAJE1-HTML
006430        MOVE NOM-USU-W        TO MENSAJE2-HTML
006440        MOVE "CON807B"        TO MENSAJE3-HTML
006450        GO TO ENVIAR-ERROR
006460     END-IF.
006470
006480 I-O-TEST SECTION.
006490     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SESION.
006500 ESCR-EXCEPTIONES.
006510     IF OTR-STAT = "00" 
006520        CONTINUE 
006530     ELSE
006540        MOVE OTR-STAT         TO MENSAJE1-HTML
006550        MOVE NOM-SESION-W     TO MENSAJE2-HTML
006560        MOVE "CON807B"        TO MENSAJE3-HTML
006570        GO TO ENVIAR-ERROR
006580     END-IF.
006590  
006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON MOVIMIENTO-DIARIO.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MENSAJE1-HTML
006670        MOVE NOM-MOV-W        TO MENSAJE2-HTML
006680        MOVE "CON807B"        TO MENSAJE3-HTML
006690        GO TO ENVIAR-ERROR
006700     END-IF.
006590  
006720  END DECLARATIVES.
006730
006740 INICIAR-IIS.
006750     MOVE LOW-VALUE TO COBW3.
006760     MOVE FUNCTION ADDR(ISAPI-CTX-CNT) TO COBW3-CONTEXT.
006770     CALL "COBW3_INIT" USING COBW3.
006780
006790 LEER-DATO-HTML.
006800     MOVE "datosh" TO COBW3-SEARCH-DATA.
006810     CALL "COBW3_GET_VALUE" USING COBW3.
006820     MOVE COBW3-GET-DATA    TO LINEA-LLEGAD-W.

           INITIALIZE DATO-LLEGADA-W

           UNSTRING LINEA-LLEGAD-W DELIMITED BY "|"
              INTO SESION-LLEGAD-W, DIRECTORIO-LLEGAD-W, CARPTA-LLEGAD-W, FECHA-LLEGAD-W, NIT-LLEGAD-W, DOCUM-LLEGAD-W
           END-UNSTRING.

001855     MOVE SESION-LLEGAD-W    TO LLAVE-SESION-W.
           MOVE FUNCTION CURRENT-DATE TO FECHA-TOTAL.
000830     ACCEPT HORA-TOTAL FROM TIME.

           
000797 INICIAR-SESION.
000806     MOVE "D:\WEB\MAIN-ELECT\DATOS\SC-SESION.DAT" TO NOM-SESION-W
000810     GO TO VALIDAR-SESION.
000850
000860 FIN-VALIDAR-SESION.
006840     
006900 ABRIR-USUARIO.
006910     INITIALIZE OTR-STAT.
006920     MOVE "D:\WEB\MAIN-ELECT\DATOS\SC-ARCHUSU.DAT" TO NOM-USU-W
006930
006940     OPEN INPUT ARCHIVO-USUNET
006950     EVALUATE OTR-STAT
006960       WHEN "00"  CONTINUE
006970       WHEN "35"  OPEN OUTPUT ARCHIVO-USUNET
006980                  INITIALIZE REG-USUNET
006990                  WRITE REG-USUNET
007000                  CLOSE ARCHIVO-USUNET
007010                  MOVE "Validacion de Usuario"       TO MENSAJE1-HTML
007020                  MOVE "Falta configurar usuarios"   TO MENSAJE2-HTML
007030                  MOVE "Sc"                          TO MENSAJE3-HTML
007040                  GO TO ENVIAR-ERROR
007050       WHEN OTHER GO TO CERRAR-SESION
007060     END-EVALUATE.
007070
007080     INITIALIZE LLAVE-USUNET.

007110 LEER-USUARIO.
007120     READ ARCHIVO-USUNET NEXT AT END MOVE 0 TO SW-FIN.
007130
007140     CLOSE ARCHIVO-USUNET.
007200     
007210     IF NOMBRE-USUNET = SPACES
007220     OR NIT-USUNET = ZEROS
007230        MOVE "Validacion de Sesion"        TO MENSAJE1-HTML
007240        MOVE "Falta configurar usuarios"   TO MENSAJE2-HTML
007250        MOVE "Sc"                          TO MENSAJE3-HTML
007260        GO TO ENVIAR-ERROR
007270     END-IF.
007280 
007350
       ASIGNAR-NOMBRES.

           INITIALIZE NOM-USUAR-W NOM-MOV-W

           INSPECT IP-DATOS-USUNET REPLACING FIRST "/" BY "\"
007287     MOVE "\\" TO NOM-USUAR-W
007288     INSPECT NOM-USUAR-W REPLACING FIRST "                    "
007289                                    BY IP-DATOS-USUNET
007290     INSPECT NOM-USUAR-W REPLACING FIRST " "
007291                                    BY "\"
007292     INSPECT NOM-USUAR-W REPLACING FIRST "                              "
007293                                    BY DIRECTORIO-LLEGAD-W

           MOVE NOM-USUAR-W    TO DIRECTORIO-EDIT
007294     INSPECT NOM-USUAR-W REPLACING FIRST "                       "
007295                                      BY "\CONTROL\SC-ARCHUSU.DAT".

        ABRIR-USUARIOS.

           OPEN INPUT ARCHIVO-USUARIOS
           READ ARCHIVO-USUARIOS NEXT WITH NO LOCK AT END 
                CLOSE ARCHIVO-USUARIOS
           END-READ.
                
           MOVE FECHA-LLEGAD-W  TO FECHA-LNK


           MOVE DIRECTORIO-USU TO DIR-W.
           MOVE ANO-LNK        TO ANO-DIR.
           MOVE 0 TO SW-BUSCAR.
           PERFORM BUSCAR-CAMPO VARYING J FROM 20 BY -1
                                UNTIL J < 2 OR SW-BUSCAR = 1.

           COMPUTE J = I + 1.
           MOVE 0  TO SW-MES.

       ABRIR-MOVIMIENTO.

           IF ANO-LNK > 95
              COMPUTE ANO-SIG = ANO-LNK + 1900
           ELSE
              COMPUTE ANO-SIG = ANO-LNK + 2000
           END-IF.

           MOVE SPACES           TO NOM-EDIT


           ADD 1 TO SW-MES.
           EVALUATE SW-MES
               WHEN 1 MOVE "\CONTROL\SC-ARCHMOV.DAT" TO NOM-EDIT
               WHEN 2 IF MES-LNK = 01
                         IF SW-BUSCAR = 0
                            GO TO ABRIR-MOVIMIENTO
                          ELSE
                            SUBTRACT 1 FROM ANO-SIG
                            MOVE ANO-SIG  TO ANO-CTL
                            MOVE ANO-CTL  TO ANO-DIR
                            MOVE ANO1-DIR TO CAR-DIR (I)
                            MOVE ANO2-DIR TO CAR-DIR (J)
                            MOVE DIR-W TO NOM-EDIT
                          END-IF
                      ELSE
                         EVALUATE MES-LNK
                             WHEN 02 MOVE "\ENE\SC-ARCHMOV.DAT" TO NOM-EDIT
                             WHEN 03 MOVE "\FEB\SC-ARCHMOV.DAT" TO NOM-EDIT
                             WHEN 04 MOVE "\MAR\SC-ARCHMOV.DAT" TO NOM-EDIT
                             WHEN 05 MOVE "\ABR\SC-ARCHMOV.DAT" TO NOM-EDIT
                             WHEN 06 MOVE "\MAY\SC-ARCHMOV.DAT" TO NOM-EDIT
                             WHEN 07 MOVE "\JUN\SC-ARCHMOV.DAT" TO NOM-EDIT
                             WHEN 08 MOVE "\JUL\SC-ARCHMOV.DAT" TO NOM-EDIT
                             WHEN 09 MOVE "\AGT\SC-ARCHMOV.DAT" TO NOM-EDIT
                             WHEN 10 MOVE "\SEP\SC-ARCHMOV.DAT" TO NOM-EDIT
                             WHEN 11 MOVE "\OCT\SC-ARCHMOV.DAT" TO NOM-EDIT
                             WHEN 12 MOVE "\NOV\SC-ARCHMOV.DAT" TO NOM-EDIT
                         END-EVALUATE
                      END-IF
               WHEN 3 IF MES-LNK = 12
                         GO TO ABRIR-MOVIMIENTO
                      ELSE
                         EVALUATE MES-LNK
                             WHEN 01 MOVE "\FEB\SC-ARCHMOV.DAT" TO NOM-EDIT
                             WHEN 02 MOVE "\MAR\SC-ARCHMOV.DAT" TO NOM-EDIT
                             WHEN 03 MOVE "\ABR\SC-ARCHMOV.DAT" TO NOM-EDIT
                             WHEN 04 MOVE "\MAY\SC-ARCHMOV.DAT" TO NOM-EDIT
                             WHEN 05 MOVE "\JUN\SC-ARCHMOV.DAT" TO NOM-EDIT
                             WHEN 06 MOVE "\JUL\SC-ARCHMOV.DAT" TO NOM-EDIT
                             WHEN 07 MOVE "\AGT\SC-ARCHMOV.DAT" TO NOM-EDIT
                             WHEN 08 MOVE "\SEP\SC-ARCHMOV.DAT" TO NOM-EDIT
                             WHEN 09 MOVE "\OCT\SC-ARCHMOV.DAT" TO NOM-EDIT
                             WHEN 10 MOVE "\NOV\SC-ARCHMOV.DAT" TO NOM-EDIT
                             WHEN 11 MOVE "\DIC\SC-ARCHMOV.DAT" TO NOM-EDIT
                         END-EVALUATE
                      END-IF
               WHEN OTHER GO TO CERRAR-MOVIMIENTO
           END-EVALUATE

           MOVE DIRECTORIO-EDIT  TO NOM-MOV-W

           INSPECT NOM-MOV-W REPLACING FIRST "                         " BY NOM-EDIT

           OPEN INPUT MOVIMIENTO-DIARIO.

           MOVE NIT-LLEGAD-W     TO ID-MOV

           MOVE TIPO-W           TO TIPO-DOC-MOV-TMP
           MOVE NRO-DOC-W        TO NRO-DOC-MOV-TMP

           MOVE DOCUM-MOV-TMP    TO DOCUM-MOV

           START MOVIMIENTO-DIARIO KEY = LLAVE-DOC-MOV
                 INVALID KEY
                         MOVE "99"         TO MENSAJE1-HTML
                         MOVE "01"         TO MENSAJE2-HTML
                         MOVE "CON807B"    TO MENSAJE3-HTML
                         GO TO ENVIAR-ERROR
           END-START.

       LEER-MOVIMIENTO.
           READ MOVIMIENTO-DIARIO NEXT WITH NO LOCK AT END GO TO ABRIR-MOVIMIENTO.

           IF ID-MOV = NIT-LLEGAD-W AND DOCUM-MOV = DOCUM-LLEGAD-W
              CONTINUE
           ELSE
              CLOSE MOVIMIENTO-DIARIO
              GO TO ABRIR-MOVIMIENTO
           END-IF

           IF  VALOR-MOV > 0 AND MAY1-MOV = 13
               MOVE "99"         TO MENSAJE1-HTML
               MOVE "9M"         TO MENSAJE2-HTML
               MOVE "CON807B"    TO MENSAJE3-HTML
               GO TO ENVIAR-ERROR
           END-IF


           GO TO LEER-MOVIMIENTO.


       CERRAR-MOVIMIENTO.
      *     CLOSE MOVIMIENTO-DIARIO.


010700 PAGINA-CONFIG.  
010720     MOVE "datosrecibidos" TO COBW3-CNV-NAME
010730     MOVE 00               TO COBW3-CNV-VALUE
010740     CALL "COBW3_SET_CNV" USING COBW3
010750
010760     MOVE "..\PAGINAS\RECIBIDOS.ASPX" TO SALIDA-HTML  
010770     PERFORM ABRIR-HTML.

007980   
007990 CERRAR-SESION.
008000     CALL "COBW3_FREE" USING COBW3.
008010     MOVE 1 TO PROGRAM-STATUS.
008020     EXIT PROGRAM.


       BUSCAR-CAMPO.
           IF  CAR-DIR (J) IS NUMERIC
           AND SW-BUSCAR = 0
               COMPUTE I = J - 1
               IF  CAR-DIR (I) = ANO1-DIR
               AND CAR-DIR (J) = ANO2-DIR
                   MOVE 1 TO SW-BUSCAR.



008040 COPY "P:\PROG\PROYECT\FUENTES\SC-WEB.CBL".
