004820*=================================================================
004830* CREA ARCHIVO JSON PARA VENTANA CONSULTA DE TERCEROS
004840*=================================================================
004850 IDENTIFICATION DIVISION.
004860 PROGRAM-ID. "HttpExtensionProc".
004870 ENVIRONMENT DIVISION.
004880 CONFIGURATION SECTION.
004890 INPUT-OUTPUT SECTION.
004900 FILE-CONTROL.
004910     COPY "P:\PROG\PROYECT\FUENTES\FS-USUNET.CBL".
004920     COPY "P:\PROG\PROYECT\FUENTES\FS-SESION.CBL".
004930
000170     SELECT ARCHIVO-USUARIOS LOCK MODE IS AUTOMATIC
000180            ASSIGN NOM-USUAR-W
000190            ORGANIZATION IS INDEXED
000200            ACCESS MODE IS DYNAMIC;
000210            RECORD KEY IS NOMBRE-USU
000220            ALTERNATE RECORD KEY IS CTL-USU     WITH DUPLICATES
000230            ALTERNATE RECORD KEY IS CLAVE-USU   WITH DUPLICATES
000240            ALTERNATE RECORD KEY IS CLAVE-2-USU WITH DUPLICATES
000250            FILE STATUS IS OTR-STAT.


           SELECT ARCHIVO-TERCEROS  LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-TER-W
                  ORGANIZATION IS INDEXED;
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS COD-TERCERO
                  ALTERNATE RECORD KEY DESCRIP-TER WITH DUPLICATES
                  ALTERNATE RECORD KEY ACT-TER     WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.


             SELECT ARCHIVO-CIUDAD  LOCK MODE IS AUTOMATIC
                  ASSIGN  NOM-CIUD-W
                  ORGANIZATION IS INDEXED;
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS COD-CIU
                  ALTERNATE RECORD KEY IS NOMBRE-CIU WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.


           SELECT ARCHIVO-ACTIVIDAD LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-ACT-W
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY  IS COD-ACT
                  FILE STATUS IS OTR-STAT.  


005030     SELECT ARCHIVO-JSON
005040            ASSIGN NOM-PLANO-W
005050            ORGANIZATION IS LINE SEQUENTIAL
005060            FILE STATUS IS OTR-STAT.
005070
005080 DATA DIVISION.
005090 FILE SECTION.
005100 COPY "P:\PROG\PROYECT\FUENTES\FD-USUNET.CBL".
005110 COPY "P:\PROG\PROYECT\FUENTES\FD-SESION.CBL".
000690 COPY "P:\PROG\PROYECT\FUENTES\FD-USUAR.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-TERCE.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-CIUDA.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-ACTIV.CBL".


005140 FD  ARCHIVO-JSON
005150     LABEL RECORD STANDARD.
005160 01  REG-PLANO.
005170     02 DATOS-PLANO     PIC X(500).
005180
005190 WORKING-STORAGE SECTION.
005200 COPY "P:\PROG\PROYECT\FUENTES\COBW3.CBL".
005210 COPY "P:\PROG\PROYECT\FUENTES\WEB-CARAC.CBL".
005220 

       77 NOM-PLANO-W                PIC X(90).
       77 NOM-USUAR-W                PIC X(70).
       77 NOM-TER-W                  PIC X(70).
       77 NOM-CIUD-W                 PIC X(70).
       77 NOM-ACT-W                  PIC X(70).
       77 FACTOR-EDIT                PIC ZZZ,ZZ.

       01 LINEA-LLEGAD-W             PIC X(100).

       01 DATO-LLEGADA-W.
          02 SESION-LLEGAD-W        PIC X(29).
          02 DIRECTORIO-LLEGAD-W    PIC X(30).
          02 CARPTA-LLEGAD-W        PIC X(5).

       01 LIN-1.
          02 FILLER                  PIC X(7)   VALUE "{*COD*:".
          02 FILLER                  PIC X      VALUE "*".
          02 COD-J                   PIC X(10).
          02 FILLER                  PIC XX     VALUE "*,".       
          02 FILLER                  PIC X(09)  VALUE "*NOMBRE*:".
          02 FILLER                  PIC X      VALUE "*".
          02 NOMNRE-J                PIC X(50).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(9)   VALUE "*DIRREC*:".
          02 FILLER                  PIC X      VALUE "*".
          02 DIRECC-J                PIC X(45).
          02 FILLER                  PIC XX     VALUE "*,".       
          02 FILLER                  PIC X(8)   VALUE "*TELEF*:".
          02 FILLER                  PIC X      VALUE "*".
          02 TELEFONO-J              PIC X(12).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(9)   VALUE "*CIUDAD*:".
          02 FILLER                  PIC X      VALUE "*".
          02 CIUDAD-J                PIC X(20).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(9)   VALUE "*FACTOR*:".
          02 FILLER                  PIC X      VALUE "*".
          02 FACTOR-J                PIC X(6).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(6)   VALUE "*ACT*:".
          02 FILLER                  PIC X      VALUE "*".
          02 ACTIVIDAD-J             PIC X(25).
003710    02 FILLER                  PIC XX     VALUE "*}".
005040    02 CIERRE-LIN-1            PIC X.



006310 LINKAGE SECTION.
006320 COPY "P:\PROG\PROYECT\FUENTES\ISAPICTX.CBL".
006330 PROCEDURE DIVISION WITH stdcall LINKAGE USING ISAPI-CTX-CNT.
006340
006350 DECLARATIVES.
002570 I-O-TEST SECTION.
002580     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUARIOS.         
002590 ESCR-EXCEPTIONES.
002600     IF OTR-STAT = "00" 
002610        CONTINUE 
002620     ELSE
002630        MOVE OTR-STAT         TO MENSAJE1-HTML
002640        MOVE NOM-USUAR-W      TO MENSAJE2-HTML
002650        MOVE "CON803"         TO MENSAJE3-HTML
002660        GO TO MOSTRAR-ERROR
002670     END-IF.

006360 I-O-TEST SECTION.
006370     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUNET.         
006380 ESCR-EXCEPTIONES.
006390     IF OTR-STAT = "00"
006400        CONTINUE 
006410     ELSE
006420        MOVE OTR-STAT         TO MENSAJE1-HTML
006430        MOVE NOM-USU-W        TO MENSAJE2-HTML
006440        MOVE "CON803"         TO MENSAJE3-HTML
006450        GO TO ENVIAR-ERROR
006460     END-IF.
006470
006480 I-O-TEST SECTION.
006490     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SESION.
006500 ESCR-EXCEPTIONES.
006510     IF OTR-STAT = "00" 
006520        CONTINUE 
006530     ELSE
006540        MOVE OTR-STAT         TO MENSAJE1-HTML
006550        MOVE NOM-SESION-W     TO MENSAJE2-HTML
006560        MOVE "CON803"         TO MENSAJE3-HTML
006570        GO TO ENVIAR-ERROR
006580     END-IF.
006590  
006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-TERCEROS.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MENSAJE1-HTML
006670        MOVE NOM-TER-W        TO MENSAJE2-HTML
006680        MOVE "CON803"         TO MENSAJE3-HTML
006690        GO TO ENVIAR-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-CIUDAD.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MENSAJE1-HTML
006670        MOVE NOM-CIUD-W       TO MENSAJE2-HTML
006680        MOVE "CON803"         TO MENSAJE3-HTML
006690        GO TO ENVIAR-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-ACTIVIDAD.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MENSAJE1-HTML
006670        MOVE NOM-ACT-W        TO MENSAJE2-HTML
006680        MOVE "CON803"         TO MENSAJE3-HTML
006690        GO TO ENVIAR-ERROR
006700     END-IF.

006590  
006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-JSON.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" OR "35"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MENSAJE1-HTML
006670        MOVE NOM-PLANO-W      TO MENSAJE2-HTML
006680        MOVE "CON803"         TO MENSAJE3-HTML
006690        GO TO ENVIAR-ERROR
006700     END-IF.
006710
006720  END DECLARATIVES.
006730
006740 INICIAR-IIS.
006750     MOVE LOW-VALUE TO COBW3.
006760     MOVE FUNCTION ADDR(ISAPI-CTX-CNT) TO COBW3-CONTEXT.
006770     CALL "COBW3_INIT" USING COBW3.
006780
006790 LEER-DATO-HTML.
006800     MOVE "datosh" TO COBW3-SEARCH-DATA.
006810     CALL "COBW3_GET_VALUE" USING COBW3.
006820     MOVE COBW3-GET-DATA    TO LINEA-LLEGAD-W.

           INITIALIZE DATO-LLEGADA-W

           UNSTRING LINEA-LLEGAD-W DELIMITED BY "|"
              INTO SESION-LLEGAD-W, DIRECTORIO-LLEGAD-W, CARPTA-LLEGAD-W
           END-UNSTRING.

001855     MOVE SESION-LLEGAD-W    TO LLAVE-SESION-W.
           MOVE FUNCTION CURRENT-DATE TO FECHA-TOTAL.
000830     ACCEPT HORA-TOTAL FROM TIME.

           
000797 INICIAR-SESION.
000806     MOVE "D:\WEB\MAIN-ELECT\DATOS\SC-SESION.DAT" TO NOM-SESION-W
000810     GO TO VALIDAR-SESION.
000850
000860 FIN-VALIDAR-SESION.
006840     
006900 ABRIR-USUARIO.
006910     INITIALIZE OTR-STAT.
006920     MOVE "D:\WEB\MAIN-ELECT\DATOS\SC-ARCHUSU.DAT" TO NOM-USU-W
006930
006940     OPEN INPUT ARCHIVO-USUNET
006950     EVALUATE OTR-STAT
006960       WHEN "00"  CONTINUE
006970       WHEN "35"  OPEN OUTPUT ARCHIVO-USUNET
006980                  INITIALIZE REG-USUNET
006990                  WRITE REG-USUNET
007000                  CLOSE ARCHIVO-USUNET
007010                  MOVE "Validacion de Usuario"       TO MENSAJE1-HTML
007020                  MOVE "Falta configurar usuarios"   TO MENSAJE2-HTML
007030                  MOVE "Sc"                          TO MENSAJE3-HTML
007040                  GO TO ENVIAR-ERROR
007050       WHEN OTHER GO TO CERRAR-SESION
007060     END-EVALUATE.
007070
007080     INITIALIZE LLAVE-USUNET.

007110 LEER-USUARIO.
007120     READ ARCHIVO-USUNET NEXT AT END MOVE 0 TO SW-FIN.
007130
007140     CLOSE ARCHIVO-USUNET.
007200     
007210     IF NOMBRE-USUNET = SPACES
007220     OR NIT-USUNET = ZEROS
007230        MOVE "Validacion de Sesion"        TO MENSAJE1-HTML
007240        MOVE "Falta configurar usuarios"   TO MENSAJE2-HTML
007250        MOVE "Sc"                          TO MENSAJE3-HTML
007260        GO TO ENVIAR-ERROR
007270     END-IF.
007280 
007350
       ASIGNAR-NOMBRES.

           INITIALIZE NOM-PLANO-W NOM-USUAR-W NOM-TER-W

           INSPECT IP-DATOS-USUNET REPLACING FIRST "/" BY "\"
007287     MOVE "\\" TO NOM-TER-W
007288     INSPECT NOM-TER-W REPLACING FIRST "                    "
007289                                    BY IP-DATOS-USUNET
007290     INSPECT NOM-TER-W REPLACING FIRST " "
007291                                    BY "\"
007292     INSPECT NOM-TER-W REPLACING FIRST "                              "
007293                                    BY DIRECTORIO-LLEGAD-W

           MOVE NOM-TER-W    TO NOM-USUAR-W

007294     INSPECT NOM-TER-W REPLACING FIRST "                       "
007295                                    BY "\CONTROL\SC-ARCHTER.DAT".    

           INSPECT NOM-USUAR-W REPLACING FIRST "                       "
                                            BY "\CONTROL\SC-ARCHUSU.DAT".

           MOVE "\\" TO NOM-CIUD-W NOM-ACT-W
           INSPECT NOM-CIUD-W REPLACING FIRST "                    "
                                           BY IP-DATOS-USUNET

           INSPECT NOM-CIUD-W REPLACING FIRST "                           "
                                           BY "\PROG\DATOS\SC-ARCHCIUD.DAT".

           INSPECT NOM-ACT-W  REPLACING FIRST "                    "
                                           BY IP-DATOS-USUNET

           INSPECT NOM-ACT-W REPLACING FIRST "                         "
                                          BY "/PROG/DATOS/SCARCHACT.DAT".


           MOVE "C:\PROSOFT\TEMP\SC-ARCHTER-XXXXXXXXXXXXXXXXXXXXXXXXXXXXX.JSON" TO  NOM-PLANO-W

           INSPECT NOM-PLANO-W  REPLACING FIRST "XXXXXXXXXXXXXXXXXXXXXXXXXXXXX"
                                             BY SESION-LLEGAD-W.  

        ABRIR-USUARIOS.

           OPEN INPUT ARCHIVO-USUARIOS
           READ ARCHIVO-USUARIOS NEXT WITH NO LOCK AT END 
                CLOSE ARCHIVO-USUARIOS
           END-READ.

       ABRIR-TERCERO.
008123     OPEN OUTPUT ARCHIVO-JSON.
           OPEN INPUT ARCHIVO-TERCEROS
                      ARCHIVO-CIUDAD
                      ARCHIVO-ACTIVIDAD.

008150
008160     INITIALIZE REG-TERCERO REG-PLANO.
008170     MOVE "{*TERCEROS*:[" TO  DATOS-PLANO
008180     INSPECT DATOS-PLANO REPLACING ALL "*" BY CARAC-COMILLA
008190     WRITE REG-PLANO.
008200     MOVE 0 TO SW-FIN.
008210 
008220 LEER-TERCERO.
008230     IF SW-FIN = 0
008240        MOVE 1 TO SW-FIN
008250     ELSE
008260        MOVE LIN-1 TO DATOS-PLANO
008270        WRITE REG-PLANO END-WRITE
008280     END-IF
008290
008300     READ ARCHIVO-TERCEROS NEXT WITH NO LOCK AT END GO TO CERRAR-TERCERO.

           IF INI1-TER = "*"
              GO TO LEER-TERCERO
           END-IF

           MOVE COD-TER       TO COD-J
           MOVE DESCRIP-TER   TO NOMNRE-J
           INSPECT NOMNRE-J REPLACING ALL "*" BY "x"

           INSPECT NOMNRE-J REPLACING ALL "*" BY "x"
           INSPECT NOMNRE-J REPLACING ALL "'" BY " "
           INSPECT NOMNRE-J REPLACING ALL '"' BY " "
           INSPECT NOMNRE-J REPLACING ALL "\" BY " "
           INSPECT NOMNRE-J REPLACING ALL "/" BY " "

           MOVE DIRECC-TER    TO DIRECC-J

           INSPECT DIRECC-J REPLACING ALL "*" BY "x"

           INSPECT DIRECC-J REPLACING ALL "*" BY "x"
           INSPECT DIRECC-J REPLACING ALL "'" BY " "
           INSPECT DIRECC-J REPLACING ALL '"' BY " "
           INSPECT DIRECC-J REPLACING ALL "\" BY " "
           INSPECT DIRECC-J REPLACING ALL "/" BY " "


           MOVE TELEFONO-TER  TO TELEFONO-J
           MOVE FACTOR-TER    TO FACTOR-EDIT 
           MOVE FACTOR-EDIT   TO FACTOR-J

           MOVE COD-CIU-TER   TO COD-CIU

           READ ARCHIVO-CIUDAD WITH NO LOCK 
                INVALID KEY
                        MOVE COD-CIU  TO NOMBRE-CIU
           END-READ

           MOVE NOMBRE-CIU    TO CIUDAD-J

           MOVE ACT-TER      TO COD-ACT
           READ ARCHIVO-ACTIVIDAD WITH NO LOCK
                INVALID KEY
                      MOVE COD-ACT   TO NOMBRE-ACT
           END-READ

           MOVE NOMBRE-ACT   TO ACTIVIDAD-J


           MOVE ","               TO CIERRE-LIN-1

           INSPECT LIN-1 REPLACING ALL "*" BY CARAC-COMILLA
           INSPECT LIN-1 REPLACING ALL LOW-VALUES BY SPACES
008850     GO TO LEER-TERCERO.
008860
008870 CERRAR-TERCERO.

008880     INITIALIZE CIERRE-LIN-1
008890     MOVE LIN-1 TO DATOS-PLANO
008900     WRITE REG-PLANO.
008910
008920     MOVE "]}" TO DATOS-PLANO
008930     WRITE REG-PLANO.

008950     CLOSE ARCHIVO-TERCEROS
                 ARCHIVO-CIUDAD
                 ARCHIVO-ACTIVIDAD
008960           ARCHIVO-JSON.  

010700 PAGINA-CONFIG.  
010720     MOVE "datosrecibidos" TO COBW3-CNV-NAME
010730     MOVE 00               TO COBW3-CNV-VALUE
010740     CALL "COBW3_SET_CNV" USING COBW3
010750
010760     MOVE "..\PAGINAS\RECIBIDOS.ASPX" TO SALIDA-HTML  
010770     PERFORM ABRIR-HTML.

007980   
007990 CERRAR-SESION.
008000     CALL "COBW3_FREE" USING COBW3.
008010     MOVE 1 TO PROGRAM-STATUS.
008020     EXIT PROGRAM.

008040 COPY "P:\PROG\PROYECT\FUENTES\SC-WEB.CBL".
