000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. CON910.
000030*   CONVIERTE EL NUMERO DE LA SECUENCIA  DE 3 DIGITOS A 2 DIGITOS.
000040 ENVIRONMENT     DIVISION.
000050 INPUT-OUTPUT SECTION.
000060 FILE-CONTROL. 
000070
000160 DATA DIVISION.
000170 FILE SECTION.
000210 WORKING-STORAGE SECTION.
000220 77 SECU-X        PIC 9(3). 
000250 
000360 LINKAGE SECTION.
000370
000380 77 SECU-W        PIC 9(3). 
000381
000390 01 SECU-MOV.
000391    02 SECU1-MOV      PIC X.
000400    02 SECU2-MOV      PIC XX. 
000540
000560 PROCEDURE DIVISION USING SECU-W SECU-MOV.
000570
000810 PROCEDURAL SECTION.
000820
000821 EDITAR-SECUENCIA.
000822     MOVE 0   TO SECU1-MOV
000823     IF SECU-W < 100
000824        MOVE SECU-W TO SECU-X
000825        MOVE SECU-X TO SECU-MOV
000826     ELSE
000827        EVALUATE SECU-W
000828            WHEN 100 MOVE "A0" TO SECU2-MOV
000829            WHEN 101 MOVE "A1" TO SECU2-MOV
000830            WHEN 102 MOVE "A2" TO SECU2-MOV
000831            WHEN 103 MOVE "A3" TO SECU2-MOV
000832            WHEN 104 MOVE "A4" TO SECU2-MOV
000833            WHEN 105 MOVE "A5" TO SECU2-MOV
000834            WHEN 106 MOVE "A6" TO SECU2-MOV
000835            WHEN 107 MOVE "A7" TO SECU2-MOV
000836            WHEN 108 MOVE "A8" TO SECU2-MOV
000837            WHEN 109 MOVE "A9" TO SECU2-MOV
000838            WHEN 110 MOVE "AA" TO SECU2-MOV
000839            WHEN 111 MOVE "AB" TO SECU2-MOV
000840            WHEN 112 MOVE "AC" TO SECU2-MOV
000841            WHEN 113 MOVE "AD" TO SECU2-MOV
000842            WHEN 114 MOVE "AE" TO SECU2-MOV
000843            WHEN 115 MOVE "AF" TO SECU2-MOV
000844            WHEN 116 MOVE "AG" TO SECU2-MOV
000845            WHEN 117 MOVE "AH" TO SECU2-MOV
000846            WHEN 118 MOVE "AI" TO SECU2-MOV
000847            WHEN 119 MOVE "AJ" TO SECU2-MOV
000848            WHEN 120 MOVE "AK" TO SECU2-MOV
000849            WHEN 121 MOVE "AL" TO SECU2-MOV
000850            WHEN 122 MOVE "AM" TO SECU2-MOV
000851            WHEN 123 MOVE "AN" TO SECU2-MOV
000852            WHEN 124 MOVE "AO" TO SECU2-MOV
000853            WHEN 125 MOVE "AP" TO SECU2-MOV
000854            WHEN 126 MOVE "AQ" TO SECU2-MOV
000855            WHEN 127 MOVE "AR" TO SECU2-MOV
000856            WHEN 128 MOVE "AS" TO SECU2-MOV
000857            WHEN 129 MOVE "AT" TO SECU2-MOV
000858            WHEN 130 MOVE "AU" TO SECU2-MOV
000859            WHEN 131 MOVE "AV" TO SECU2-MOV
000860            WHEN 132 MOVE "AW" TO SECU2-MOV
000861            WHEN 133 MOVE "AX" TO SECU2-MOV
000862            WHEN 134 MOVE "AY" TO SECU2-MOV
000863            WHEN 135 MOVE "AZ" TO SECU2-MOV
000864            WHEN 136 MOVE "B0" TO SECU2-MOV
000865            WHEN 137 MOVE "B1" TO SECU2-MOV
000866            WHEN 138 MOVE "B2" TO SECU2-MOV
000867            WHEN 139 MOVE "B3" TO SECU2-MOV
000868            WHEN 140 MOVE "B4" TO SECU2-MOV
000869            WHEN 141 MOVE "B5" TO SECU2-MOV
000870            WHEN 142 MOVE "B6" TO SECU2-MOV
000871            WHEN 143 MOVE "B7" TO SECU2-MOV
000872            WHEN 144 MOVE "B8" TO SECU2-MOV
000873            WHEN 145 MOVE "B9" TO SECU2-MOV
000874            WHEN 146 MOVE "BA" TO SECU2-MOV
000875            WHEN 147 MOVE "BB" TO SECU2-MOV
000876            WHEN 148 MOVE "BC" TO SECU2-MOV
000877            WHEN 149 MOVE "BD" TO SECU2-MOV
000878            WHEN 150 MOVE "BE" TO SECU2-MOV
000879            WHEN 151 MOVE "BF" TO SECU2-MOV
000880            WHEN 152 MOVE "BG" TO SECU2-MOV
000881            WHEN 153 MOVE "BH" TO SECU2-MOV
000882            WHEN 154 MOVE "BI" TO SECU2-MOV
000883            WHEN 155 MOVE "BJ" TO SECU2-MOV
000884            WHEN 156 MOVE "BK" TO SECU2-MOV
000885            WHEN 157 MOVE "BL" TO SECU2-MOV
000886            WHEN 158 MOVE "BM" TO SECU2-MOV
000887            WHEN 159 MOVE "BN" TO SECU2-MOV
000888            WHEN 160 MOVE "BO" TO SECU2-MOV
000889            WHEN 161 MOVE "BP" TO SECU2-MOV
000890            WHEN 162 MOVE "BQ" TO SECU2-MOV
000891            WHEN 163 MOVE "BR" TO SECU2-MOV
000892            WHEN 164 MOVE "BS" TO SECU2-MOV
000893            WHEN 165 MOVE "BT" TO SECU2-MOV
000894            WHEN 166 MOVE "BU" TO SECU2-MOV
000895            WHEN 167 MOVE "BV" TO SECU2-MOV
000896            WHEN 168 MOVE "BW" TO SECU2-MOV
000897            WHEN 169 MOVE "BX" TO SECU2-MOV
000898            WHEN 170 MOVE "BY" TO SECU2-MOV
000899            WHEN 171 MOVE "BZ" TO SECU2-MOV
000900            WHEN 172 MOVE "C0" TO SECU2-MOV
000901            WHEN 173 MOVE "C1" TO SECU2-MOV
000902            WHEN 174 MOVE "C2" TO SECU2-MOV
000903            WHEN 175 MOVE "C3" TO SECU2-MOV
000904            WHEN 176 MOVE "C4" TO SECU2-MOV
000905            WHEN 177 MOVE "C5" TO SECU2-MOV
000906            WHEN 178 MOVE "C6" TO SECU2-MOV
000907            WHEN 179 MOVE "C7" TO SECU2-MOV
000908            WHEN 180 MOVE "C8" TO SECU2-MOV
000909            WHEN 181 MOVE "C9" TO SECU2-MOV
000910            WHEN 182 MOVE "CA" TO SECU2-MOV
000911            WHEN 183 MOVE "CB" TO SECU2-MOV
000912            WHEN 184 MOVE "CC" TO SECU2-MOV
000913            WHEN 185 MOVE "CD" TO SECU2-MOV
000914            WHEN 186 MOVE "CE" TO SECU2-MOV
000915            WHEN 187 MOVE "CF" TO SECU2-MOV
000916            WHEN 188 MOVE "CG" TO SECU2-MOV
000917            WHEN 189 MOVE "CH" TO SECU2-MOV
000918            WHEN 190 MOVE "CI" TO SECU2-MOV
000919            WHEN 191 MOVE "CJ" TO SECU2-MOV
000920            WHEN 192 MOVE "CK" TO SECU2-MOV
000921            WHEN 193 MOVE "CL" TO SECU2-MOV
000922            WHEN 194 MOVE "CM" TO SECU2-MOV
000923            WHEN 195 MOVE "CN" TO SECU2-MOV
000924            WHEN 196 MOVE "CO" TO SECU2-MOV
000925            WHEN 197 MOVE "CP" TO SECU2-MOV
000926            WHEN 198 MOVE "CQ" TO SECU2-MOV
000927            WHEN 199 MOVE "CR" TO SECU2-MOV
000928            WHEN 200 MOVE "CS" TO SECU2-MOV
000929            WHEN 201 MOVE "CT" TO SECU2-MOV
000930            WHEN 202 MOVE "CU" TO SECU2-MOV
000931            WHEN 203 MOVE "CV" TO SECU2-MOV
000932            WHEN 204 MOVE "CW" TO SECU2-MOV
000933            WHEN 205 MOVE "CX" TO SECU2-MOV
000934            WHEN 206 MOVE "CY" TO SECU2-MOV
000935            WHEN 207 MOVE "CZ" TO SECU2-MOV
000936            WHEN 208 MOVE "D0" TO SECU2-MOV
000937            WHEN 209 MOVE "D1" TO SECU2-MOV
000938            WHEN 210 MOVE "D2" TO SECU2-MOV
000939            WHEN 211 MOVE "D3" TO SECU2-MOV
000940            WHEN 212 MOVE "D4" TO SECU2-MOV
000941            WHEN 213 MOVE "D5" TO SECU2-MOV
000942            WHEN 214 MOVE "D6" TO SECU2-MOV
000943            WHEN 215 MOVE "D7" TO SECU2-MOV
000944            WHEN 216 MOVE "D8" TO SECU2-MOV
000945            WHEN 217 MOVE "D9" TO SECU2-MOV
000946            WHEN 218 MOVE "DA" TO SECU2-MOV
000947            WHEN 219 MOVE "DB" TO SECU2-MOV
000948            WHEN 220 MOVE "DC" TO SECU2-MOV
000949            WHEN 221 MOVE "DD" TO SECU2-MOV
000950            WHEN 222 MOVE "DE" TO SECU2-MOV
000951            WHEN 223 MOVE "DF" TO SECU2-MOV
000952            WHEN 224 MOVE "DG" TO SECU2-MOV
000953            WHEN 225 MOVE "DH" TO SECU2-MOV
000954            WHEN 226 MOVE "DI" TO SECU2-MOV
000955            WHEN 227 MOVE "DJ" TO SECU2-MOV
000956            WHEN 228 MOVE "DK" TO SECU2-MOV
000957            WHEN 229 MOVE "DL" TO SECU2-MOV
000958            WHEN 230 MOVE "DM" TO SECU2-MOV
000959            WHEN 231 MOVE "DN" TO SECU2-MOV
000960            WHEN 232 MOVE "DO" TO SECU2-MOV
000961            WHEN 233 MOVE "DP" TO SECU2-MOV
000962            WHEN 234 MOVE "DQ" TO SECU2-MOV
000963            WHEN 235 MOVE "DR" TO SECU2-MOV
000964            WHEN 236 MOVE "DS" TO SECU2-MOV
000965            WHEN 237 MOVE "DT" TO SECU2-MOV
000966            WHEN 238 MOVE "DU" TO SECU2-MOV
000967            WHEN 239 MOVE "DV" TO SECU2-MOV
000968            WHEN 240 MOVE "DW" TO SECU2-MOV
000969            WHEN 241 MOVE "DX" TO SECU2-MOV
000970            WHEN 242 MOVE "DY" TO SECU2-MOV
000971            WHEN 243 MOVE "DZ" TO SECU2-MOV
000972            WHEN 244 MOVE "E0" TO SECU2-MOV
000973            WHEN 245 MOVE "E1" TO SECU2-MOV
000974            WHEN 246 MOVE "E2" TO SECU2-MOV
000975            WHEN 247 MOVE "E3" TO SECU2-MOV
000976            WHEN 248 MOVE "E4" TO SECU2-MOV
000977            WHEN 249 MOVE "E5" TO SECU2-MOV
000978            WHEN 250 MOVE "E6" TO SECU2-MOV
000979            WHEN 251 MOVE "E7" TO SECU2-MOV
000980            WHEN 252 MOVE "E8" TO SECU2-MOV
000981            WHEN 253 MOVE "E9" TO SECU2-MOV
000982            WHEN 254 MOVE "EA" TO SECU2-MOV
000983            WHEN 255 MOVE "EB" TO SECU2-MOV
000984            WHEN 256 MOVE "EC" TO SECU2-MOV
000985            WHEN 257 MOVE "ED" TO SECU2-MOV
000986            WHEN 258 MOVE "EE" TO SECU2-MOV
000987            WHEN 259 MOVE "EF" TO SECU2-MOV
000988            WHEN 260 MOVE "EG" TO SECU2-MOV
000989            WHEN 261 MOVE "EH" TO SECU2-MOV
000990            WHEN 262 MOVE "EI" TO SECU2-MOV
000991            WHEN 263 MOVE "EJ" TO SECU2-MOV
000992            WHEN 264 MOVE "EK" TO SECU2-MOV
000993            WHEN 265 MOVE "EL" TO SECU2-MOV
000994            WHEN 266 MOVE "EM" TO SECU2-MOV
000995            WHEN 267 MOVE "EN" TO SECU2-MOV
000996            WHEN 268 MOVE "EO" TO SECU2-MOV
000997            WHEN 269 MOVE "EP" TO SECU2-MOV
000998            WHEN 270 MOVE "EQ" TO SECU2-MOV
000999            WHEN 271 MOVE "ER" TO SECU2-MOV
001000            WHEN 272 MOVE "ES" TO SECU2-MOV
001001            WHEN 273 MOVE "ET" TO SECU2-MOV
001002            WHEN 274 MOVE "EU" TO SECU2-MOV
001003            WHEN 275 MOVE "EV" TO SECU2-MOV
001004            WHEN 276 MOVE "EW" TO SECU2-MOV
001005            WHEN 277 MOVE "EX" TO SECU2-MOV
001006            WHEN 278 MOVE "EY" TO SECU2-MOV
001007            WHEN 279 MOVE "EZ" TO SECU2-MOV
001008            WHEN 280 MOVE "F0" TO SECU2-MOV
001009            WHEN 281 MOVE "F1" TO SECU2-MOV
001010            WHEN 282 MOVE "F2" TO SECU2-MOV
001011            WHEN 283 MOVE "F3" TO SECU2-MOV
001012            WHEN 284 MOVE "F4" TO SECU2-MOV
001013            WHEN 285 MOVE "F5" TO SECU2-MOV
001014            WHEN 286 MOVE "F6" TO SECU2-MOV
001015            WHEN 287 MOVE "F7" TO SECU2-MOV
001016            WHEN 288 MOVE "F8" TO SECU2-MOV
001017            WHEN 289 MOVE "F9" TO SECU2-MOV
001018            WHEN 290 MOVE "FA" TO SECU2-MOV
001019            WHEN 291 MOVE "FB" TO SECU2-MOV
001020            WHEN 292 MOVE "FC" TO SECU2-MOV
001021            WHEN 293 MOVE "FD" TO SECU2-MOV
001022            WHEN 294 MOVE "FE" TO SECU2-MOV
001023            WHEN 295 MOVE "FF" TO SECU2-MOV
001024            WHEN 296 MOVE "FG" TO SECU2-MOV
001025            WHEN 297 MOVE "FH" TO SECU2-MOV
001026            WHEN 298 MOVE "FI" TO SECU2-MOV
001027            WHEN 299 MOVE "FJ" TO SECU2-MOV
001028            WHEN 300 MOVE "FK" TO SECU2-MOV
001029            WHEN 301 MOVE "FL" TO SECU2-MOV
001030            WHEN 302 MOVE "FM" TO SECU2-MOV
001031            WHEN 303 MOVE "FN" TO SECU2-MOV
001032            WHEN 304 MOVE "FO" TO SECU2-MOV
001033            WHEN 305 MOVE "FP" TO SECU2-MOV
001034            WHEN 306 MOVE "FQ" TO SECU2-MOV
001035            WHEN 307 MOVE "FR" TO SECU2-MOV
001036            WHEN 308 MOVE "FS" TO SECU2-MOV
001037            WHEN 309 MOVE "FT" TO SECU2-MOV
001038            WHEN 310 MOVE "FU" TO SECU2-MOV
001039            WHEN 311 MOVE "FV" TO SECU2-MOV
001040            WHEN 312 MOVE "FW" TO SECU2-MOV
001041            WHEN 313 MOVE "FX" TO SECU2-MOV
001042            WHEN 314 MOVE "FY" TO SECU2-MOV
001043            WHEN 315 MOVE "FZ" TO SECU2-MOV
001044            WHEN 316 MOVE "G0" TO SECU2-MOV
001045            WHEN 317 MOVE "G1" TO SECU2-MOV
001046            WHEN 318 MOVE "G2" TO SECU2-MOV
001047            WHEN 319 MOVE "G3" TO SECU2-MOV
001048            WHEN 320 MOVE "G4" TO SECU2-MOV
001049            WHEN 321 MOVE "G5" TO SECU2-MOV
001050            WHEN 322 MOVE "G6" TO SECU2-MOV
001051            WHEN 323 MOVE "G7" TO SECU2-MOV
001052            WHEN 324 MOVE "G8" TO SECU2-MOV
001053            WHEN 325 MOVE "G9" TO SECU2-MOV
001054            WHEN 326 MOVE "GA" TO SECU2-MOV
001055            WHEN 327 MOVE "GB" TO SECU2-MOV
001056            WHEN 328 MOVE "GC" TO SECU2-MOV
001057            WHEN 329 MOVE "GD" TO SECU2-MOV
001058            WHEN 330 MOVE "GE" TO SECU2-MOV
001059            WHEN 331 MOVE "GF" TO SECU2-MOV
001060            WHEN 332 MOVE "GG" TO SECU2-MOV
001061            WHEN 333 MOVE "GH" TO SECU2-MOV
001062            WHEN 334 MOVE "GI" TO SECU2-MOV
001063            WHEN 335 MOVE "GJ" TO SECU2-MOV
001064            WHEN 336 MOVE "GK" TO SECU2-MOV
001065            WHEN 337 MOVE "GL" TO SECU2-MOV
001066            WHEN 338 MOVE "GM" TO SECU2-MOV
001067            WHEN 339 MOVE "GN" TO SECU2-MOV
001068            WHEN 340 MOVE "GO" TO SECU2-MOV
001069            WHEN 341 MOVE "GP" TO SECU2-MOV
001070            WHEN 342 MOVE "GQ" TO SECU2-MOV
001071            WHEN 343 MOVE "GR" TO SECU2-MOV
001072            WHEN 344 MOVE "GS" TO SECU2-MOV
001073            WHEN 345 MOVE "GT" TO SECU2-MOV
001074            WHEN 346 MOVE "GU" TO SECU2-MOV
001075            WHEN 347 MOVE "GV" TO SECU2-MOV
001076            WHEN 348 MOVE "GW" TO SECU2-MOV
001077            WHEN 349 MOVE "GX" TO SECU2-MOV
001078            WHEN 350 MOVE "GY" TO SECU2-MOV
001079            WHEN 351 MOVE "GZ" TO SECU2-MOV
001080            WHEN 352 MOVE "H0" TO SECU2-MOV
001081            WHEN 353 MOVE "H1" TO SECU2-MOV
001082            WHEN 354 MOVE "H2" TO SECU2-MOV
001083            WHEN 355 MOVE "H3" TO SECU2-MOV
001084            WHEN 356 MOVE "H4" TO SECU2-MOV
001085            WHEN 357 MOVE "H5" TO SECU2-MOV
001086            WHEN 358 MOVE "H6" TO SECU2-MOV
001087            WHEN 359 MOVE "H7" TO SECU2-MOV
001088            WHEN 360 MOVE "H8" TO SECU2-MOV
001089            WHEN 361 MOVE "H9" TO SECU2-MOV
001090            WHEN 362 MOVE "HA" TO SECU2-MOV
001091            WHEN 363 MOVE "HB" TO SECU2-MOV
001092            WHEN 364 MOVE "HC" TO SECU2-MOV
001093            WHEN 365 MOVE "HD" TO SECU2-MOV
001094            WHEN 366 MOVE "HE" TO SECU2-MOV
001095            WHEN 367 MOVE "HF" TO SECU2-MOV
001096            WHEN 368 MOVE "HG" TO SECU2-MOV
001097            WHEN 369 MOVE "HH" TO SECU2-MOV
001098            WHEN 370 MOVE "HI" TO SECU2-MOV
001099            WHEN 371 MOVE "HJ" TO SECU2-MOV
001100            WHEN 372 MOVE "HK" TO SECU2-MOV
001101            WHEN 373 MOVE "HL" TO SECU2-MOV
001102            WHEN 374 MOVE "HM" TO SECU2-MOV
001103            WHEN 375 MOVE "HN" TO SECU2-MOV
001104            WHEN 376 MOVE "HO" TO SECU2-MOV
001105            WHEN 377 MOVE "HP" TO SECU2-MOV
001106            WHEN 378 MOVE "HQ" TO SECU2-MOV
001107            WHEN 379 MOVE "HR" TO SECU2-MOV
001108            WHEN 380 MOVE "HS" TO SECU2-MOV
001109            WHEN 381 MOVE "HT" TO SECU2-MOV
001110            WHEN 382 MOVE "HU" TO SECU2-MOV
001111            WHEN 383 MOVE "HV" TO SECU2-MOV
001112            WHEN 384 MOVE "HW" TO SECU2-MOV
001113            WHEN 385 MOVE "HX" TO SECU2-MOV
001114            WHEN 386 MOVE "HY" TO SECU2-MOV
001115            WHEN 387 MOVE "HZ" TO SECU2-MOV
001116            WHEN 388 MOVE "I0" TO SECU2-MOV
001117            WHEN 389 MOVE "I1" TO SECU2-MOV
001118            WHEN 390 MOVE "I2" TO SECU2-MOV
001119            WHEN 391 MOVE "I3" TO SECU2-MOV
001120            WHEN 392 MOVE "I4" TO SECU2-MOV
001121            WHEN 393 MOVE "I5" TO SECU2-MOV
001122            WHEN 394 MOVE "I6" TO SECU2-MOV
001123            WHEN 395 MOVE "I7" TO SECU2-MOV
001124            WHEN 396 MOVE "I8" TO SECU2-MOV
001125            WHEN 397 MOVE "I9" TO SECU2-MOV
001126            WHEN 398 MOVE "IA" TO SECU2-MOV
001127            WHEN 399 MOVE "IB" TO SECU2-MOV
001128            WHEN 400 MOVE "IC" TO SECU2-MOV
001129            WHEN 401 MOVE "ID" TO SECU2-MOV
001130            WHEN 402 MOVE "IE" TO SECU2-MOV
001131            WHEN 403 MOVE "IF" TO SECU2-MOV
001132            WHEN 404 MOVE "IG" TO SECU2-MOV
001133            WHEN 405 MOVE "IH" TO SECU2-MOV
001134            WHEN 406 MOVE "II" TO SECU2-MOV
001135            WHEN 407 MOVE "IJ" TO SECU2-MOV
001136            WHEN 408 MOVE "IK" TO SECU2-MOV
001137            WHEN 409 MOVE "IL" TO SECU2-MOV
001138            WHEN 410 MOVE "IM" TO SECU2-MOV
001139            WHEN 411 MOVE "IN" TO SECU2-MOV
001140            WHEN 412 MOVE "IO" TO SECU2-MOV
001141            WHEN 413 MOVE "IP" TO SECU2-MOV
001142            WHEN 414 MOVE "IQ" TO SECU2-MOV
001143            WHEN 415 MOVE "IR" TO SECU2-MOV
001144            WHEN 416 MOVE "IS" TO SECU2-MOV
001145            WHEN 417 MOVE "IT" TO SECU2-MOV
001146            WHEN 418 MOVE "IU" TO SECU2-MOV
001147            WHEN 419 MOVE "IV" TO SECU2-MOV
001148            WHEN 420 MOVE "IW" TO SECU2-MOV
001149            WHEN 421 MOVE "IX" TO SECU2-MOV
001150            WHEN 422 MOVE "IY" TO SECU2-MOV
001151            WHEN 423 MOVE "IZ" TO SECU2-MOV
001152            WHEN 424 MOVE "J0" TO SECU2-MOV
001153            WHEN 425 MOVE "J1" TO SECU2-MOV
001154            WHEN 426 MOVE "J2" TO SECU2-MOV
001155            WHEN 427 MOVE "J3" TO SECU2-MOV
001156            WHEN 428 MOVE "J4" TO SECU2-MOV
001157            WHEN 429 MOVE "J5" TO SECU2-MOV
001158            WHEN 430 MOVE "J6" TO SECU2-MOV
001159            WHEN 431 MOVE "J7" TO SECU2-MOV
001160            WHEN 432 MOVE "J8" TO SECU2-MOV
001161            WHEN 433 MOVE "J9" TO SECU2-MOV
001162            WHEN 434 MOVE "JA" TO SECU2-MOV
001163            WHEN 435 MOVE "JB" TO SECU2-MOV
001164            WHEN 436 MOVE "JC" TO SECU2-MOV
001165            WHEN 437 MOVE "JD" TO SECU2-MOV
001166            WHEN 438 MOVE "JE" TO SECU2-MOV
001167            WHEN 439 MOVE "JF" TO SECU2-MOV
001168            WHEN 440 MOVE "JG" TO SECU2-MOV
001169            WHEN 441 MOVE "JH" TO SECU2-MOV
001170            WHEN 442 MOVE "JI" TO SECU2-MOV
001171            WHEN 443 MOVE "JJ" TO SECU2-MOV
001172            WHEN 444 MOVE "JK" TO SECU2-MOV
001173            WHEN 445 MOVE "JL" TO SECU2-MOV
001174            WHEN 446 MOVE "JM" TO SECU2-MOV
001175            WHEN 447 MOVE "JN" TO SECU2-MOV
001176            WHEN 448 MOVE "JO" TO SECU2-MOV
001177            WHEN 449 MOVE "JP" TO SECU2-MOV
001178            WHEN 450 MOVE "JQ" TO SECU2-MOV
001179            WHEN 451 MOVE "JR" TO SECU2-MOV
001180            WHEN 452 MOVE "JS" TO SECU2-MOV
001181            WHEN 453 MOVE "JT" TO SECU2-MOV
001182            WHEN 454 MOVE "JU" TO SECU2-MOV
001183            WHEN 455 MOVE "JV" TO SECU2-MOV
001184            WHEN 456 MOVE "JW" TO SECU2-MOV
001185            WHEN 457 MOVE "JX" TO SECU2-MOV
001186            WHEN 458 MOVE "JY" TO SECU2-MOV
001187            WHEN 459 MOVE "JZ" TO SECU2-MOV
001188            WHEN 460 MOVE "K0" TO SECU2-MOV
001189            WHEN 461 MOVE "K1" TO SECU2-MOV
001190            WHEN 462 MOVE "K2" TO SECU2-MOV
001191            WHEN 463 MOVE "K3" TO SECU2-MOV
001192            WHEN 464 MOVE "K4" TO SECU2-MOV
001193            WHEN 465 MOVE "K5" TO SECU2-MOV
001194            WHEN 466 MOVE "K6" TO SECU2-MOV
001195            WHEN 467 MOVE "K7" TO SECU2-MOV
001196            WHEN 468 MOVE "K8" TO SECU2-MOV
001197            WHEN 469 MOVE "K9" TO SECU2-MOV
001198            WHEN 470 MOVE "KA" TO SECU2-MOV
001199            WHEN 471 MOVE "KB" TO SECU2-MOV
001200            WHEN 472 MOVE "KC" TO SECU2-MOV
001201            WHEN 473 MOVE "KD" TO SECU2-MOV
001202            WHEN 474 MOVE "KE" TO SECU2-MOV
001203            WHEN 475 MOVE "KF" TO SECU2-MOV
001204            WHEN 476 MOVE "KG" TO SECU2-MOV
001205            WHEN 477 MOVE "KH" TO SECU2-MOV
001206            WHEN 478 MOVE "KI" TO SECU2-MOV
001207            WHEN 479 MOVE "KJ" TO SECU2-MOV
001208            WHEN 480 MOVE "KK" TO SECU2-MOV
001209            WHEN 481 MOVE "KL" TO SECU2-MOV
001210            WHEN 482 MOVE "KM" TO SECU2-MOV
001211            WHEN 483 MOVE "KN" TO SECU2-MOV
001212            WHEN 484 MOVE "KO" TO SECU2-MOV
001213            WHEN 485 MOVE "KP" TO SECU2-MOV
001214            WHEN 486 MOVE "KQ" TO SECU2-MOV
001215            WHEN 487 MOVE "KR" TO SECU2-MOV
001216            WHEN 488 MOVE "KS" TO SECU2-MOV
001217            WHEN 489 MOVE "KT" TO SECU2-MOV
001218            WHEN 490 MOVE "KU" TO SECU2-MOV
001219            WHEN 491 MOVE "KV" TO SECU2-MOV
001220            WHEN 492 MOVE "KW" TO SECU2-MOV
001221            WHEN 493 MOVE "KX" TO SECU2-MOV
001222            WHEN 494 MOVE "KY" TO SECU2-MOV
001223            WHEN 495 MOVE "KZ" TO SECU2-MOV
001224            WHEN 496 MOVE "L0" TO SECU2-MOV
001225            WHEN 497 MOVE "L1" TO SECU2-MOV
001226            WHEN 498 MOVE "L2" TO SECU2-MOV
001227            WHEN 499 MOVE "L3" TO SECU2-MOV
001228            WHEN 500 MOVE "L4" TO SECU2-MOV
001229            WHEN 501 MOVE "L5" TO SECU2-MOV
001230            WHEN 502 MOVE "L6" TO SECU2-MOV
001231            WHEN 503 MOVE "L7" TO SECU2-MOV
001232            WHEN 504 MOVE "L8" TO SECU2-MOV
001233            WHEN 505 MOVE "L9" TO SECU2-MOV
001234            WHEN 506 MOVE "LA" TO SECU2-MOV
001235            WHEN 507 MOVE "LB" TO SECU2-MOV
001236            WHEN 508 MOVE "LC" TO SECU2-MOV
001237            WHEN 509 MOVE "LD" TO SECU2-MOV
001238            WHEN 510 MOVE "LE" TO SECU2-MOV
001239            WHEN 511 MOVE "LF" TO SECU2-MOV
001240            WHEN 512 MOVE "LG" TO SECU2-MOV
001241            WHEN 513 MOVE "LH" TO SECU2-MOV
001242            WHEN 514 MOVE "LI" TO SECU2-MOV
001243            WHEN 515 MOVE "LJ" TO SECU2-MOV
001244            WHEN 516 MOVE "LK" TO SECU2-MOV
001245            WHEN 517 MOVE "LL" TO SECU2-MOV
001246            WHEN 518 MOVE "LM" TO SECU2-MOV
001247            WHEN 519 MOVE "LN" TO SECU2-MOV
001248            WHEN 520 MOVE "LO" TO SECU2-MOV
001249            WHEN 521 MOVE "LP" TO SECU2-MOV
001250            WHEN 522 MOVE "LQ" TO SECU2-MOV
001251            WHEN 523 MOVE "LR" TO SECU2-MOV
001252            WHEN 524 MOVE "LS" TO SECU2-MOV
001253            WHEN 525 MOVE "LT" TO SECU2-MOV
001254            WHEN 526 MOVE "LU" TO SECU2-MOV
001255            WHEN 527 MOVE "LV" TO SECU2-MOV
001256            WHEN 528 MOVE "LW" TO SECU2-MOV
001257            WHEN 529 MOVE "LX" TO SECU2-MOV
001258            WHEN 530 MOVE "LY" TO SECU2-MOV
001259            WHEN 531 MOVE "LZ" TO SECU2-MOV
001260            WHEN 532 MOVE "M0" TO SECU2-MOV
001261            WHEN 533 MOVE "M1" TO SECU2-MOV
001262            WHEN 534 MOVE "M2" TO SECU2-MOV
001263            WHEN 535 MOVE "M3" TO SECU2-MOV
001264            WHEN 536 MOVE "M4" TO SECU2-MOV
001265            WHEN 537 MOVE "M5" TO SECU2-MOV
001266            WHEN 538 MOVE "M6" TO SECU2-MOV
001267            WHEN 539 MOVE "M7" TO SECU2-MOV
001268            WHEN 540 MOVE "M8" TO SECU2-MOV
001269            WHEN 541 MOVE "M9" TO SECU2-MOV
001270            WHEN 542 MOVE "MA" TO SECU2-MOV
001271            WHEN 543 MOVE "MB" TO SECU2-MOV
001272            WHEN 544 MOVE "MC" TO SECU2-MOV
001273            WHEN 545 MOVE "MD" TO SECU2-MOV
001274            WHEN 546 MOVE "ME" TO SECU2-MOV
001275            WHEN 547 MOVE "MF" TO SECU2-MOV
001276            WHEN 548 MOVE "MG" TO SECU2-MOV
001277            WHEN 549 MOVE "MH" TO SECU2-MOV
001278            WHEN 550 MOVE "MI" TO SECU2-MOV
001279            WHEN 551 MOVE "MJ" TO SECU2-MOV
001280            WHEN 552 MOVE "MK" TO SECU2-MOV
001281            WHEN 553 MOVE "ML" TO SECU2-MOV
001282            WHEN 554 MOVE "MM" TO SECU2-MOV
001283            WHEN 555 MOVE "MN" TO SECU2-MOV
001284            WHEN 556 MOVE "MO" TO SECU2-MOV
001285            WHEN 557 MOVE "MP" TO SECU2-MOV
001286            WHEN 558 MOVE "MQ" TO SECU2-MOV
001287            WHEN 559 MOVE "MR" TO SECU2-MOV
001288            WHEN 560 MOVE "MS" TO SECU2-MOV
001289            WHEN 561 MOVE "MT" TO SECU2-MOV
001290            WHEN 562 MOVE "MU" TO SECU2-MOV
001291            WHEN 563 MOVE "MV" TO SECU2-MOV
001292            WHEN 564 MOVE "MW" TO SECU2-MOV
001293            WHEN 565 MOVE "MX" TO SECU2-MOV
001294            WHEN 566 MOVE "MY" TO SECU2-MOV
001295            WHEN 567 MOVE "MZ" TO SECU2-MOV
001296            WHEN 568 MOVE "N0" TO SECU2-MOV
001297            WHEN 569 MOVE "N1" TO SECU2-MOV
001298            WHEN 570 MOVE "N2" TO SECU2-MOV
001299            WHEN 571 MOVE "N3" TO SECU2-MOV
001300            WHEN 572 MOVE "N4" TO SECU2-MOV
001301            WHEN 573 MOVE "N5" TO SECU2-MOV
001302            WHEN 574 MOVE "N6" TO SECU2-MOV
001303            WHEN 575 MOVE "N7" TO SECU2-MOV
001304            WHEN 576 MOVE "N8" TO SECU2-MOV
001305            WHEN 577 MOVE "N9" TO SECU2-MOV
001306            WHEN 578 MOVE "NA" TO SECU2-MOV
001307            WHEN 579 MOVE "NB" TO SECU2-MOV
001308            WHEN 580 MOVE "NC" TO SECU2-MOV
001309            WHEN 581 MOVE "ND" TO SECU2-MOV
001310            WHEN 582 MOVE "NE" TO SECU2-MOV
001311            WHEN 583 MOVE "NF" TO SECU2-MOV
001312            WHEN 584 MOVE "NG" TO SECU2-MOV
001313            WHEN 585 MOVE "NH" TO SECU2-MOV
001314            WHEN 586 MOVE "NI" TO SECU2-MOV
001315            WHEN 587 MOVE "NJ" TO SECU2-MOV
001316            WHEN 588 MOVE "NK" TO SECU2-MOV
001317            WHEN 589 MOVE "NL" TO SECU2-MOV
001318            WHEN 590 MOVE "NM" TO SECU2-MOV
001319            WHEN 591 MOVE "NN" TO SECU2-MOV
001320            WHEN 592 MOVE "NO" TO SECU2-MOV
001321            WHEN 593 MOVE "NP" TO SECU2-MOV
001322            WHEN 594 MOVE "NQ" TO SECU2-MOV
001323            WHEN 595 MOVE "NR" TO SECU2-MOV
001324            WHEN 596 MOVE "NS" TO SECU2-MOV
001325            WHEN 597 MOVE "NT" TO SECU2-MOV
001326            WHEN 598 MOVE "NU" TO SECU2-MOV
001327            WHEN 599 MOVE "NV" TO SECU2-MOV
001328            WHEN 600 MOVE "NW" TO SECU2-MOV
001329            WHEN 601 MOVE "NX" TO SECU2-MOV
001330            WHEN 602 MOVE "NY" TO SECU2-MOV
001331            WHEN 603 MOVE "NZ" TO SECU2-MOV
001332            WHEN 604 MOVE "O0" TO SECU2-MOV
001333            WHEN 605 MOVE "O1" TO SECU2-MOV
001334            WHEN 606 MOVE "O2" TO SECU2-MOV
001335            WHEN 607 MOVE "O3" TO SECU2-MOV
001336            WHEN 608 MOVE "O4" TO SECU2-MOV
001337            WHEN 609 MOVE "O5" TO SECU2-MOV
001338            WHEN 610 MOVE "O6" TO SECU2-MOV
001339            WHEN 611 MOVE "O7" TO SECU2-MOV
001340            WHEN 612 MOVE "O8" TO SECU2-MOV
001341            WHEN 613 MOVE "O9" TO SECU2-MOV
001342            WHEN 614 MOVE "OA" TO SECU2-MOV
001343            WHEN 615 MOVE "OB" TO SECU2-MOV
001344            WHEN 616 MOVE "OC" TO SECU2-MOV
001345            WHEN 617 MOVE "OD" TO SECU2-MOV
001346            WHEN 618 MOVE "OE" TO SECU2-MOV
001347            WHEN 619 MOVE "OF" TO SECU2-MOV
001348            WHEN 620 MOVE "OG" TO SECU2-MOV
001349            WHEN 621 MOVE "OH" TO SECU2-MOV
001350            WHEN 622 MOVE "OI" TO SECU2-MOV
001351            WHEN 623 MOVE "OJ" TO SECU2-MOV
001352            WHEN 624 MOVE "OK" TO SECU2-MOV
001353            WHEN 625 MOVE "OL" TO SECU2-MOV
001354            WHEN 626 MOVE "OM" TO SECU2-MOV
001355            WHEN 627 MOVE "ON" TO SECU2-MOV
001356            WHEN 628 MOVE "OO" TO SECU2-MOV
001357            WHEN 629 MOVE "OP" TO SECU2-MOV
001358            WHEN 630 MOVE "OQ" TO SECU2-MOV
001359            WHEN 631 MOVE "OR" TO SECU2-MOV
001360            WHEN 632 MOVE "OS" TO SECU2-MOV
001361            WHEN 633 MOVE "OT" TO SECU2-MOV
001362            WHEN 634 MOVE "OU" TO SECU2-MOV
001363            WHEN 635 MOVE "OV" TO SECU2-MOV
001364            WHEN 636 MOVE "OW" TO SECU2-MOV
001365            WHEN 637 MOVE "OX" TO SECU2-MOV
001366            WHEN 638 MOVE "OY" TO SECU2-MOV
001367            WHEN 639 MOVE "OZ" TO SECU2-MOV
001368            WHEN 640 MOVE "P0" TO SECU2-MOV
001369            WHEN 641 MOVE "P1" TO SECU2-MOV
001370            WHEN 642 MOVE "P2" TO SECU2-MOV
001371            WHEN 643 MOVE "P3" TO SECU2-MOV
001372            WHEN 644 MOVE "P4" TO SECU2-MOV
001373            WHEN 645 MOVE "P5" TO SECU2-MOV
001374            WHEN 646 MOVE "P6" TO SECU2-MOV
001375            WHEN 647 MOVE "P7" TO SECU2-MOV
001376            WHEN 648 MOVE "P8" TO SECU2-MOV
001377            WHEN 649 MOVE "P9" TO SECU2-MOV
001378            WHEN 650 MOVE "PA" TO SECU2-MOV
001379            WHEN 651 MOVE "PB" TO SECU2-MOV
001380            WHEN 652 MOVE "PC" TO SECU2-MOV
001381            WHEN 653 MOVE "PD" TO SECU2-MOV
001382            WHEN 654 MOVE "PE" TO SECU2-MOV
001383            WHEN 655 MOVE "PF" TO SECU2-MOV
001384            WHEN 656 MOVE "PG" TO SECU2-MOV
001385            WHEN 657 MOVE "PH" TO SECU2-MOV
001386            WHEN 658 MOVE "PI" TO SECU2-MOV
001387            WHEN 659 MOVE "PJ" TO SECU2-MOV
001388            WHEN 660 MOVE "PK" TO SECU2-MOV
001389            WHEN 661 MOVE "PL" TO SECU2-MOV
001390            WHEN 662 MOVE "PM" TO SECU2-MOV
001391            WHEN 663 MOVE "PN" TO SECU2-MOV
001392            WHEN 664 MOVE "PO" TO SECU2-MOV
001393            WHEN 665 MOVE "PP" TO SECU2-MOV
001394            WHEN 666 MOVE "PQ" TO SECU2-MOV
001395            WHEN 667 MOVE "PR" TO SECU2-MOV
001396            WHEN 668 MOVE "PS" TO SECU2-MOV
001397            WHEN 669 MOVE "PT" TO SECU2-MOV
001398            WHEN 670 MOVE "PU" TO SECU2-MOV
001399            WHEN 671 MOVE "PV" TO SECU2-MOV
001400            WHEN 672 MOVE "PW" TO SECU2-MOV
001401            WHEN 673 MOVE "PX" TO SECU2-MOV
001402            WHEN 674 MOVE "PY" TO SECU2-MOV
001403            WHEN 675 MOVE "PZ" TO SECU2-MOV
001404            WHEN 676 MOVE "Q0" TO SECU2-MOV
001405            WHEN 677 MOVE "Q1" TO SECU2-MOV
001406            WHEN 678 MOVE "Q2" TO SECU2-MOV
001407            WHEN 679 MOVE "Q3" TO SECU2-MOV
001408            WHEN 680 MOVE "Q4" TO SECU2-MOV
001409            WHEN 681 MOVE "Q5" TO SECU2-MOV
001410            WHEN 682 MOVE "Q6" TO SECU2-MOV
001411            WHEN 683 MOVE "Q7" TO SECU2-MOV
001412            WHEN 684 MOVE "Q8" TO SECU2-MOV
001413            WHEN 685 MOVE "Q9" TO SECU2-MOV
001414            WHEN 686 MOVE "QA" TO SECU2-MOV
001415            WHEN 687 MOVE "QB" TO SECU2-MOV
001416            WHEN 688 MOVE "QC" TO SECU2-MOV
001417            WHEN 689 MOVE "QD" TO SECU2-MOV
001418            WHEN 690 MOVE "QE" TO SECU2-MOV
001419            WHEN 691 MOVE "QF" TO SECU2-MOV
001420            WHEN 692 MOVE "QG" TO SECU2-MOV
001421            WHEN 693 MOVE "QH" TO SECU2-MOV
001422            WHEN 694 MOVE "QI" TO SECU2-MOV
001423            WHEN 695 MOVE "QJ" TO SECU2-MOV
001424            WHEN 696 MOVE "QK" TO SECU2-MOV
001425            WHEN 697 MOVE "QL" TO SECU2-MOV
001426            WHEN 698 MOVE "QM" TO SECU2-MOV
001427            WHEN 699 MOVE "QN" TO SECU2-MOV
001428            WHEN 700 MOVE "QO" TO SECU2-MOV
001429            WHEN 701 MOVE "QP" TO SECU2-MOV
001430            WHEN 702 MOVE "QQ" TO SECU2-MOV
001431            WHEN 703 MOVE "QR" TO SECU2-MOV
001432            WHEN 704 MOVE "QS" TO SECU2-MOV
001433            WHEN 705 MOVE "QT" TO SECU2-MOV
001434            WHEN 706 MOVE "QU" TO SECU2-MOV
001435            WHEN 707 MOVE "QV" TO SECU2-MOV
001436            WHEN 708 MOVE "QW" TO SECU2-MOV
001437            WHEN 709 MOVE "QX" TO SECU2-MOV
001438            WHEN 710 MOVE "QY" TO SECU2-MOV
001439            WHEN 711 MOVE "QZ" TO SECU2-MOV
001440            WHEN 712 MOVE "R0" TO SECU2-MOV
001441            WHEN 713 MOVE "R1" TO SECU2-MOV
001442            WHEN 714 MOVE "R2" TO SECU2-MOV
001443            WHEN 715 MOVE "R3" TO SECU2-MOV
001444            WHEN 716 MOVE "R4" TO SECU2-MOV
001445            WHEN 717 MOVE "R5" TO SECU2-MOV
001446            WHEN 718 MOVE "R6" TO SECU2-MOV
001447            WHEN 719 MOVE "R7" TO SECU2-MOV
001448            WHEN 720 MOVE "R8" TO SECU2-MOV
001449            WHEN 721 MOVE "R9" TO SECU2-MOV
001450            WHEN 722 MOVE "RA" TO SECU2-MOV
001451            WHEN 723 MOVE "RB" TO SECU2-MOV
001452            WHEN 724 MOVE "RC" TO SECU2-MOV
001453            WHEN 725 MOVE "RD" TO SECU2-MOV
001454            WHEN 726 MOVE "RE" TO SECU2-MOV
001455            WHEN 727 MOVE "RF" TO SECU2-MOV
001456            WHEN 728 MOVE "RG" TO SECU2-MOV
001457            WHEN 729 MOVE "RH" TO SECU2-MOV
001458            WHEN 730 MOVE "RI" TO SECU2-MOV
001459            WHEN 731 MOVE "RJ" TO SECU2-MOV
001460            WHEN 732 MOVE "RK" TO SECU2-MOV
001461            WHEN 733 MOVE "RL" TO SECU2-MOV
001462            WHEN 734 MOVE "RM" TO SECU2-MOV
001463            WHEN 735 MOVE "RN" TO SECU2-MOV
001464            WHEN 736 MOVE "RO" TO SECU2-MOV
001465            WHEN 737 MOVE "RP" TO SECU2-MOV
001466            WHEN 738 MOVE "RQ" TO SECU2-MOV
001467            WHEN 739 MOVE "RR" TO SECU2-MOV
001468            WHEN 740 MOVE "RS" TO SECU2-MOV
001469            WHEN 741 MOVE "RT" TO SECU2-MOV
001470            WHEN 742 MOVE "RU" TO SECU2-MOV
001471            WHEN 743 MOVE "RV" TO SECU2-MOV
001472            WHEN 744 MOVE "RW" TO SECU2-MOV
001473            WHEN 745 MOVE "RX" TO SECU2-MOV
001474            WHEN 746 MOVE "RY" TO SECU2-MOV
001475            WHEN 747 MOVE "RZ" TO SECU2-MOV
001476            WHEN 748 MOVE "S0" TO SECU2-MOV
001477            WHEN 749 MOVE "S1" TO SECU2-MOV
001478            WHEN 750 MOVE "S2" TO SECU2-MOV
001479            WHEN 751 MOVE "S3" TO SECU2-MOV
001480            WHEN 752 MOVE "S4" TO SECU2-MOV
001481            WHEN 753 MOVE "S5" TO SECU2-MOV
001482            WHEN 754 MOVE "S6" TO SECU2-MOV
001483            WHEN 755 MOVE "S7" TO SECU2-MOV
001484            WHEN 756 MOVE "S8" TO SECU2-MOV
001485            WHEN 757 MOVE "S9" TO SECU2-MOV
001486            WHEN 758 MOVE "SA" TO SECU2-MOV
001487            WHEN 759 MOVE "SB" TO SECU2-MOV
001488            WHEN 760 MOVE "SC" TO SECU2-MOV
001489            WHEN 761 MOVE "SD" TO SECU2-MOV
001490            WHEN 762 MOVE "SE" TO SECU2-MOV
001491            WHEN 763 MOVE "SF" TO SECU2-MOV
001492            WHEN 764 MOVE "SG" TO SECU2-MOV
001493            WHEN 765 MOVE "SH" TO SECU2-MOV
001494            WHEN 766 MOVE "SI" TO SECU2-MOV
001495            WHEN 767 MOVE "SJ" TO SECU2-MOV
001496            WHEN 768 MOVE "SK" TO SECU2-MOV
001497            WHEN 769 MOVE "SL" TO SECU2-MOV
001498            WHEN 770 MOVE "SM" TO SECU2-MOV
001499            WHEN 771 MOVE "SN" TO SECU2-MOV
001500            WHEN 772 MOVE "SO" TO SECU2-MOV
001501            WHEN 773 MOVE "SP" TO SECU2-MOV
001502            WHEN 774 MOVE "SQ" TO SECU2-MOV
001503            WHEN 775 MOVE "SR" TO SECU2-MOV
001504            WHEN 776 MOVE "SS" TO SECU2-MOV
001505            WHEN 777 MOVE "ST" TO SECU2-MOV
001506            WHEN 778 MOVE "SU" TO SECU2-MOV
001507            WHEN 779 MOVE "SV" TO SECU2-MOV
001508            WHEN 780 MOVE "SW" TO SECU2-MOV
001509            WHEN 781 MOVE "SX" TO SECU2-MOV
001510            WHEN 782 MOVE "SY" TO SECU2-MOV
001511            WHEN 783 MOVE "SZ" TO SECU2-MOV
001512            WHEN 784 MOVE "T0" TO SECU2-MOV
001513            WHEN 785 MOVE "T1" TO SECU2-MOV
001514            WHEN 786 MOVE "T2" TO SECU2-MOV
001515            WHEN 787 MOVE "T3" TO SECU2-MOV
001516            WHEN 788 MOVE "T4" TO SECU2-MOV
001517            WHEN 789 MOVE "T5" TO SECU2-MOV
001518            WHEN 790 MOVE "T6" TO SECU2-MOV
001519            WHEN 791 MOVE "T7" TO SECU2-MOV
001520            WHEN 792 MOVE "T8" TO SECU2-MOV
001521            WHEN 793 MOVE "T9" TO SECU2-MOV
001522            WHEN 794 MOVE "TA" TO SECU2-MOV
001523            WHEN 795 MOVE "TB" TO SECU2-MOV
001524            WHEN 796 MOVE "TC" TO SECU2-MOV
001525            WHEN 797 MOVE "TD" TO SECU2-MOV
001526            WHEN 798 MOVE "TE" TO SECU2-MOV
001527            WHEN 799 MOVE "TF" TO SECU2-MOV
001528            WHEN 800 MOVE "TG" TO SECU2-MOV
001529            WHEN 801 MOVE "TH" TO SECU2-MOV
001530            WHEN 802 MOVE "TI" TO SECU2-MOV
001531            WHEN 803 MOVE "TJ" TO SECU2-MOV
001532            WHEN 804 MOVE "TK" TO SECU2-MOV
001533            WHEN 805 MOVE "TL" TO SECU2-MOV
001534            WHEN 806 MOVE "TM" TO SECU2-MOV
001535            WHEN 807 MOVE "TN" TO SECU2-MOV
001536            WHEN 808 MOVE "TO" TO SECU2-MOV
001537            WHEN 809 MOVE "TP" TO SECU2-MOV
001538            WHEN 810 MOVE "TQ" TO SECU2-MOV
001539            WHEN 811 MOVE "TR" TO SECU2-MOV
001540            WHEN 812 MOVE "TS" TO SECU2-MOV
001541            WHEN 813 MOVE "TT" TO SECU2-MOV
001542            WHEN 814 MOVE "TU" TO SECU2-MOV
001543            WHEN 815 MOVE "TV" TO SECU2-MOV
001544            WHEN 816 MOVE "TW" TO SECU2-MOV
001545            WHEN 817 MOVE "TX" TO SECU2-MOV
001546            WHEN 818 MOVE "TY" TO SECU2-MOV
001547            WHEN 819 MOVE "TZ" TO SECU2-MOV
001548            WHEN 820 MOVE "U0" TO SECU2-MOV
001549            WHEN 821 MOVE "U1" TO SECU2-MOV
001550            WHEN 822 MOVE "U2" TO SECU2-MOV
001551            WHEN 823 MOVE "U3" TO SECU2-MOV
001552            WHEN 824 MOVE "U4" TO SECU2-MOV
001553            WHEN 825 MOVE "U5" TO SECU2-MOV
001554            WHEN 826 MOVE "U6" TO SECU2-MOV
001555            WHEN 827 MOVE "U7" TO SECU2-MOV
001556            WHEN 828 MOVE "U8" TO SECU2-MOV
001557            WHEN 829 MOVE "U9" TO SECU2-MOV
001558            WHEN 830 MOVE "UA" TO SECU2-MOV
001559            WHEN 831 MOVE "UB" TO SECU2-MOV
001560            WHEN 832 MOVE "UC" TO SECU2-MOV
001561            WHEN 833 MOVE "UD" TO SECU2-MOV
001562            WHEN 834 MOVE "UE" TO SECU2-MOV
001563            WHEN 835 MOVE "UF" TO SECU2-MOV
001564            WHEN 836 MOVE "UG" TO SECU2-MOV
001565            WHEN 837 MOVE "UH" TO SECU2-MOV
001566            WHEN 838 MOVE "UI" TO SECU2-MOV
001567            WHEN 839 MOVE "UJ" TO SECU2-MOV
001568            WHEN 840 MOVE "UK" TO SECU2-MOV
001569            WHEN 841 MOVE "UL" TO SECU2-MOV
001570            WHEN 842 MOVE "UM" TO SECU2-MOV
001571            WHEN 843 MOVE "UN" TO SECU2-MOV
001572            WHEN 844 MOVE "UO" TO SECU2-MOV
001573            WHEN 845 MOVE "UP" TO SECU2-MOV
001574            WHEN 846 MOVE "UQ" TO SECU2-MOV
001575            WHEN 847 MOVE "UR" TO SECU2-MOV
001576            WHEN 848 MOVE "US" TO SECU2-MOV
001577            WHEN 849 MOVE "UT" TO SECU2-MOV
001578            WHEN 850 MOVE "UU" TO SECU2-MOV
001579            WHEN 851 MOVE "UV" TO SECU2-MOV
001580            WHEN 852 MOVE "UW" TO SECU2-MOV
001581            WHEN 853 MOVE "UX" TO SECU2-MOV
001582            WHEN 854 MOVE "UY" TO SECU2-MOV
001583            WHEN 855 MOVE "UZ" TO SECU2-MOV
001584            WHEN 856 MOVE "V0" TO SECU2-MOV
001585            WHEN 857 MOVE "V1" TO SECU2-MOV
001586            WHEN 858 MOVE "V2" TO SECU2-MOV
001587            WHEN 859 MOVE "V3" TO SECU2-MOV
001588            WHEN 860 MOVE "V4" TO SECU2-MOV
001589            WHEN 861 MOVE "V5" TO SECU2-MOV
001590            WHEN 862 MOVE "V6" TO SECU2-MOV
001591            WHEN 863 MOVE "V7" TO SECU2-MOV
001592            WHEN 864 MOVE "V8" TO SECU2-MOV
001593            WHEN 865 MOVE "V9" TO SECU2-MOV
001594            WHEN 866 MOVE "VA" TO SECU2-MOV
001595            WHEN 867 MOVE "VB" TO SECU2-MOV
001596            WHEN 868 MOVE "VC" TO SECU2-MOV
001597            WHEN 869 MOVE "VD" TO SECU2-MOV
001598            WHEN 870 MOVE "VE" TO SECU2-MOV
001599            WHEN 871 MOVE "VF" TO SECU2-MOV
001600            WHEN 872 MOVE "VG" TO SECU2-MOV
001601            WHEN 873 MOVE "VH" TO SECU2-MOV
001602            WHEN 874 MOVE "VI" TO SECU2-MOV
001603            WHEN 875 MOVE "VJ" TO SECU2-MOV
001604            WHEN 876 MOVE "VK" TO SECU2-MOV
001605            WHEN 877 MOVE "VL" TO SECU2-MOV
001606            WHEN 878 MOVE "VM" TO SECU2-MOV
001607            WHEN 879 MOVE "VN" TO SECU2-MOV
001608            WHEN 880 MOVE "VO" TO SECU2-MOV
001609            WHEN 881 MOVE "VP" TO SECU2-MOV
001610            WHEN 882 MOVE "VQ" TO SECU2-MOV
001611            WHEN 883 MOVE "VR" TO SECU2-MOV
001612            WHEN 884 MOVE "VS" TO SECU2-MOV
001613            WHEN 885 MOVE "VT" TO SECU2-MOV
001614            WHEN 886 MOVE "VU" TO SECU2-MOV
001615            WHEN 887 MOVE "VV" TO SECU2-MOV
001616            WHEN 888 MOVE "VW" TO SECU2-MOV
001617            WHEN 889 MOVE "VX" TO SECU2-MOV
001618            WHEN 890 MOVE "VY" TO SECU2-MOV 
001619            WHEN 891 MOVE "VZ" TO SECU2-MOV
001620            WHEN 892 MOVE "W0" TO SECU2-MOV
001621            WHEN 893 MOVE "W1" TO SECU2-MOV
001622            WHEN 894 MOVE "W2" TO SECU2-MOV
001623            WHEN 895 MOVE "W3" TO SECU2-MOV
001624            WHEN 896 MOVE "W4" TO SECU2-MOV
001625            WHEN 897 MOVE "W5" TO SECU2-MOV
001626            WHEN 898 MOVE "W6" TO SECU2-MOV
001627            WHEN 899 MOVE "W7" TO SECU2-MOV
001628            WHEN 900 MOVE "W8" TO SECU2-MOV
001629            WHEN 901 MOVE "W9" TO SECU2-MOV
001630            WHEN 902 MOVE "WA" TO SECU2-MOV
001631            WHEN 903 MOVE "WB" TO SECU2-MOV
001632            WHEN 904 MOVE "WC" TO SECU2-MOV
001633            WHEN 905 MOVE "WD" TO SECU2-MOV
001634            WHEN 906 MOVE "WE" TO SECU2-MOV
001635            WHEN 907 MOVE "WF" TO SECU2-MOV
001636            WHEN 908 MOVE "WG" TO SECU2-MOV
001637            WHEN 909 MOVE "WH" TO SECU2-MOV
001638            WHEN 910 MOVE "WI" TO SECU2-MOV
001639            WHEN 911 MOVE "WJ" TO SECU2-MOV
001640            WHEN 912 MOVE "WK" TO SECU2-MOV
001641            WHEN 913 MOVE "WL" TO SECU2-MOV
001642            WHEN 914 MOVE "WM" TO SECU2-MOV
001643            WHEN 915 MOVE "WN" TO SECU2-MOV
001644            WHEN 916 MOVE "WO" TO SECU2-MOV
001645            WHEN 917 MOVE "WP" TO SECU2-MOV
001646            WHEN 918 MOVE "WQ" TO SECU2-MOV
001647            WHEN 919 MOVE "WR" TO SECU2-MOV
001648            WHEN 920 MOVE "WS" TO SECU2-MOV
001649            WHEN 921 MOVE "WT" TO SECU2-MOV
001650            WHEN 922 MOVE "WU" TO SECU2-MOV
001651            WHEN 923 MOVE "WV" TO SECU2-MOV
001652            WHEN 924 MOVE "WW" TO SECU2-MOV
001653            WHEN 925 MOVE "WX" TO SECU2-MOV
001654            WHEN 926 MOVE "WY" TO SECU2-MOV
001655            WHEN 927 MOVE "WZ" TO SECU2-MOV
001656            WHEN 928 MOVE "X0" TO SECU2-MOV
001657            WHEN 929 MOVE "X1" TO SECU2-MOV
001658            WHEN 930 MOVE "X2" TO SECU2-MOV
001659            WHEN 931 MOVE "X3" TO SECU2-MOV
001660            WHEN 932 MOVE "X4" TO SECU2-MOV
001661            WHEN 933 MOVE "X5" TO SECU2-MOV
001662            WHEN 934 MOVE "X6" TO SECU2-MOV
001663            WHEN 935 MOVE "X7" TO SECU2-MOV
001664            WHEN 936 MOVE "X8" TO SECU2-MOV
001665            WHEN 937 MOVE "X9" TO SECU2-MOV
001666            WHEN 938 MOVE "XA" TO SECU2-MOV
001667            WHEN 939 MOVE "XB" TO SECU2-MOV
001668            WHEN 940 MOVE "XC" TO SECU2-MOV
001669            WHEN 941 MOVE "XD" TO SECU2-MOV
001670            WHEN 942 MOVE "XE" TO SECU2-MOV
001671            WHEN 943 MOVE "XF" TO SECU2-MOV
001672            WHEN 944 MOVE "XG" TO SECU2-MOV
001673            WHEN 945 MOVE "XH" TO SECU2-MOV
001674            WHEN 946 MOVE "XI" TO SECU2-MOV
001675            WHEN 947 MOVE "XJ" TO SECU2-MOV
001676            WHEN 948 MOVE "XK" TO SECU2-MOV
001677            WHEN 949 MOVE "XL" TO SECU2-MOV
001678            WHEN 950 MOVE "XM" TO SECU2-MOV
001679            WHEN 951 MOVE "XN" TO SECU2-MOV
001680            WHEN 952 MOVE "XO" TO SECU2-MOV
001681            WHEN 953 MOVE "XP" TO SECU2-MOV
001682            WHEN 954 MOVE "XQ" TO SECU2-MOV
001683            WHEN 955 MOVE "XR" TO SECU2-MOV
001684            WHEN 956 MOVE "XS" TO SECU2-MOV
001685            WHEN 957 MOVE "XT" TO SECU2-MOV
001686            WHEN 958 MOVE "XU" TO SECU2-MOV
001687            WHEN 959 MOVE "XV" TO SECU2-MOV
001688            WHEN 960 MOVE "XW" TO SECU2-MOV
001689            WHEN 961 MOVE "XX" TO SECU2-MOV
001690            WHEN 962 MOVE "XY" TO SECU2-MOV
001691            WHEN 963 MOVE "XZ" TO SECU2-MOV
001692            WHEN 964 MOVE "Y0" TO SECU2-MOV
001693            WHEN 965 MOVE "Y1" TO SECU2-MOV
001694            WHEN 966 MOVE "Y2" TO SECU2-MOV
001695            WHEN 967 MOVE "Y3" TO SECU2-MOV
001696            WHEN 968 MOVE "Y4" TO SECU2-MOV
001697            WHEN 969 MOVE "Y5" TO SECU2-MOV
001698            WHEN 970 MOVE "Y6" TO SECU2-MOV
001699            WHEN 971 MOVE "Y7" TO SECU2-MOV
001700            WHEN 972 MOVE "Y8" TO SECU2-MOV
001701            WHEN 973 MOVE "Y9" TO SECU2-MOV
001702            WHEN 974 MOVE "YA" TO SECU2-MOV
001703            WHEN 975 MOVE "YB" TO SECU2-MOV
001704            WHEN 976 MOVE "YC" TO SECU2-MOV
001705            WHEN 977 MOVE "YD" TO SECU2-MOV
001706            WHEN 978 MOVE "YE" TO SECU2-MOV
001707            WHEN 979 MOVE "YF" TO SECU2-MOV
001708            WHEN 980 MOVE "YG" TO SECU2-MOV
001709            WHEN 981 MOVE "YH" TO SECU2-MOV 
001710            WHEN 982 MOVE "YI" TO SECU2-MOV
001711            WHEN 983 MOVE "YJ" TO SECU2-MOV
001712            WHEN 984 MOVE "YK" TO SECU2-MOV
001713            WHEN 985 MOVE "YL" TO SECU2-MOV
001714            WHEN 986 MOVE "YM" TO SECU2-MOV
001715            WHEN 987 MOVE "YN" TO SECU2-MOV
001716            WHEN 988 MOVE "YO" TO SECU2-MOV
001717            WHEN 989 MOVE "YP" TO SECU2-MOV
001718            WHEN 990 MOVE "YQ" TO SECU2-MOV 
001719            WHEN 991 MOVE "YR" TO SECU2-MOV
001720            WHEN 992 MOVE "YS" TO SECU2-MOV
001721            WHEN 993 MOVE "YT" TO SECU2-MOV
001722            WHEN 994 MOVE "YU" TO SECU2-MOV
001723            WHEN 995 MOVE "YV" TO SECU2-MOV
001724            WHEN 996 MOVE "YW" TO SECU2-MOV
001725            WHEN 997 MOVE "YX" TO SECU2-MOV
001726            WHEN 998 MOVE "YY" TO SECU2-MOV
001727            WHEN 999 MOVE "YZ" TO SECU2-MOV
001728     END-EVALUATE.
001729
001840 SALIR.
001850     EXIT PROGRAM.
001860
