000012*VALIDA EL USUARIO Y CONTRASEÑA DE LA PAGINA DE INICIO  
000020 IDENTIFICATION DIVISION.
000021* PROGRAM-ID. "INDEX".
000022
000023 PROGRAM-ID. "HttpExtensionProc".
000024 ENVIRONMENT DIVISION.
000025 CONFIGURATION SECTION.
000026 INPUT-OUTPUT SECTION.
000027 FILE-CONTROL.
000080 COPY "P:\PROG\PROYECT\FUENTES\FS-USUNET.CBL".
000150 COPY "P:\PROG\PROYECT\FUENTES\FS-SESION.CBL".

000010     SELECT ARCHIVO-RESTRICCION LOCK MODE IS AUTOMATIC
000020            ASSIGN TO NOM-REST-W
000030            ORGANIZATION INDEXED;
000040            ACCESS MODE DYNAMIC;
000050            RECORD KEY LLAVE-REST
000060            ALTERNATE RECORD KEY NOMBRE-REST WITH DUPLICATES
000070            FILE STATUS OTR-STAT.


005030     SELECT ARCHIVO-JSON
005040            ASSIGN NOM-PLANO-W
005050            ORGANIZATION IS LINE SEQUENTIAL
005060            FILE STATUS IS OTR-STAT.

000390
000400 DATA DIVISION.
000410 FILE SECTION.
000420 COPY "P:\PROG\PROYECT\FUENTES\FD-USUNET.CBL".
000421 COPY "P:\PROG\PROYECT\FUENTES\FD-SESION.CBL".
000450 COPY "P:\PROG\PROYECT\FUENTES\FD-RESTR.CBL".

005140 FD  ARCHIVO-JSON
005150     LABEL RECORD STANDARD.
005160 01  REG-PLANO.
005170     02 DATOS-PLANO     PIC X(700).

000470
000540 WORKING-STORAGE  SECTION.
000550 COPY "P:\PROG\PROYECT\FUENTES\COBW3.CBL".
000560 COPY "P:\PROG\PROYECT\FUENTES\WEB-CARAC.CBL".

000570 77 NOM-PLANO-W            PIC X(90).
       77 CONT-W                 PIC 99.
000590 01 EDITADO-W              PIC X(15).
000600 01 COD-USER-W             PIC X(15).
000622 01 CLAVE-CTL              PIC X(15).
000624 01 ID-EDIT                PIC ZZZZZZZZZZ.
000633 01  DATO-W.
000635     02 CLAVE-W            PIC X(15).


       01 LINEA-LLEGAD-W         PIC X(100).

       01 DATO-LLEGADA-W.
          02 USU-LLEGAD-W.
             03 USU1-LLEGAD-W    PIC X(2).
             03 USU2-LLEGAD-W    PIC X(2).
          02 CLAVE-LLEGAD-W      PIC X(8).


       01 DATOS-ENVIO.
          02 ESTADO-ENV         PIC XX.
          02 FILLER             PIC X VALUE "|".
          02 OPC-ENV            PIC XX.
          02 FILLER             PIC X VALUE "|".
          02 COD-ENV            PIC X(4).
          02 FILLER             PIC X VALUE "|".
          02 NOMBRE-ENV         PIC X(30).
          02 FILLER             PIC X VALUE "|".
          02 SESION-ENV         PIC X(29).


001812 01 LIN-1.  
001820    02 FILLER                  PIC X(6)   VALUE "{*ID*:".
001830    02 FILLER                  PIC X      VALUE "*".
001840    02 ID-USU-J                PIC X(4).
001850    02 FILLER                  PIC XX     VALUE "*,".
001860    02 FILLER                  PIC X(9)   VALUE "*NOMUSU*:".
001870    02 FILLER                  PIC X      VALUE "*".
001880    02 NOM-USU-J               PIC X(60).
001890    02 FILLER                  PIC XX     VALUE "*,".    
001900    02 FILLER                  PIC X(9)   VALUE "*NITUSU*:".
001910    02 FILLER                  PIC X      VALUE "*".
001920    02 NIT-USU-J               PIC X(10).
001930    02 FILLER                  PIC XX     VALUE "*,".
001940    02 FILLER                  PIC X(9)   VALUE "*DIRUSU*:".
001950    02 FILLER                  PIC X      VALUE "*".
001960    02 DIRECC-USU-J            PIC X(60).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(11)  VALUE "*EMAILUSU*:".
          02 FILLER                  PIC X      VALUE "*".
          02 EMAIL-USU-J             PIC X(60).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(11)  VALUE "*CLAVEUSU*:".
          02 FILLER                  PIC X      VALUE "*".
          02 CLAVE-USU-J             PIC X(30).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(16)  VALUE "*SERVIDORUSU*:".
          02 FILLER                  PIC X      VALUE "*".
          02 SERV-EMAIL-USU-J        PIC X(30).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(12)  VALUE "*PUERTOUSU*:".
          02 FILLER                  PIC X      VALUE "*".
          02 PUERTO-EMAIL-USU-J      PIC X(4).         
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(9)   VALUE "*SSLUSU*:".
          02 FILLER                  PIC X      VALUE "*".
          02 SSL-EMAIL-USU-J         PIC X.
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(8)   VALUE "*IPUSU*:".
          02 FILLER                  PIC X      VALUE "*".
          02 IP-DATOS-USU-J          PIC X(20).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(16)  VALUE "*IP-DESCARGA*:".
          02 FILLER                  PIC X      VALUE "*".
          02 IP-DESC-USU-J           PIC X(20).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(16)  VALUE "*DIR-CONT*:".
          02 FILLER                  PIC X      VALUE "*".
          02 DIRECTORIO-USU-J        PIC X(30).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(10)  VALUE "*CONTAB*:[".

       01 LIN-2.
          02 FILLER                  PIC X(8)   VALUE "{*DIR*:".
          02 FILLER                  PIC X      VALUE "*".
          02 DIR-J                   PIC X(20).
          02 FILLER                  PIC XX     VALUE "*}".
          02 CIERRE-LIN-02           PIC X.


000730 01 COD-TMP.
000740    02 SW-ALFA             PIC 9.
000750    02 TABLA-COD1.
000760       03 COD1-PAC         PIC X OCCURS 15.
000770    02 TABLA-COD2.
000780       03 COD2-PAC         PIC X OCCURS 15.
000790
000791 LINKAGE SECTION.
000792 COPY "P:\PROG\PROYECT\FUENTES\ISAPICTX.CBL".
000793
000794 PROCEDURE DIVISION WITH stdcall LINKAGE USING ISAPI-CTX-CNT.
000795
000810 DECLARATIVES.
000811 I-O-TEST SECTION.
000812     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUNET.         
000813 ESCR-EXCEPTIONES.
000814     IF OTR-STAT = "00" OR "35"
000815        CONTINUE 
000816     ELSE
000817        MOVE OTR-STAT                TO MENSAJE1-HTML
000818        MOVE NOM-USU-W               TO MENSAJE2-HTML
000819        MOVE "INDEX"                 TO MENSAJE3-HTML
000820        GO TO ENVIAR-ERROR
000821     END-IF.
000920
000930 I-O-TEST SECTION.
000940     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-RESTRICCION.
000950 ESCR-EXCEPTIONES.
000960     IF OTR-STAT = "00"
000970        CONTINUE                    
000980     ELSE
000990        MOVE OTR-STAT                TO MENSAJE1-HTML
000991        MOVE NOM-REST-W              TO MENSAJE2-HTML
000992        MOVE "INDEX"                 TO MENSAJE3-HTML
000993        GO TO ENVIAR-ERROR
000994     END-IF.
001030
001040 I-O-TEST SECTION.
001050     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SESION.         
001060 ESCR-EXCEPTIONES.
001070     IF OTR-STAT = "00" OR "35"
001080        CONTINUE
001090     ELSE
001100        MOVE OTR-STAT                TO MENSAJE1-HTML
001101        MOVE NOM-SESION-W            TO MENSAJE2-HTML
001102        MOVE "INDEX"                 TO MENSAJE3-HTML
001103        GO TO ENVIAR-ERROR
001104     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-JSON.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" OR "35"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MENSAJE1-HTML
006670        MOVE NOM-PLANO-W      TO MENSAJE2-HTML
006680        MOVE "INDEX"          TO MENSAJE3-HTML
006690        GO TO ENVIAR-ERROR
006700     END-IF.

001105
001150 END DECLARATIVES.
001160
001161 INICIAR-IIS.
001162     MOVE LOW-VALUE TO COBW3.
001163     MOVE FUNCTION ADDR(ISAPI-CTX-CNT) TO COBW3-CONTEXT.
001164     CALL "COBW3_INIT" USING COBW3.
001220
001221 LEER-DATO-HTML.
001852     MOVE "datosh" TO COBW3-SEARCH-DATA.
001853     CALL "COBW3_GET_VALUE" USING COBW3.
001854     MOVE COBW3-GET-DATA    TO LINEA-LLEGAD-W.

           UNSTRING LINEA-LLEGAD-W DELIMITED BY "|"
                    INTO USU-LLEGAD-W, CLAVE-LLEGAD-W
           END-UNSTRING.

001303 ABRIR-USUARIO.
           MOVE "D:\WEB\BOMBAS\DATOS\SC-ARCHUSU.DAT"  TO NOM-USU-W
001305
001306     OPEN INPUT ARCHIVO-USUNET
001307     EVALUATE OTR-STAT
001308       WHEN "00"  CONTINUE
001309       WHEN "35"  OPEN OUTPUT ARCHIVO-USUNET
001310                  CLOSE       ARCHIVO-USUNET
001311                  OPEN I-O    ARCHIVO-USUNET
001312                  INITIALIZE REG-USUNET
001314                  WRITE REG-USUNET
001315                  CLOSE       ARCHIVO-USUNET
001316                  MOVE "Validacion de usuarios"      TO MENSAJE1-HTML
001317                  MOVE "Falta configurar usuario"    TO MENSAJE2-HTML
001318                  MOVE "Sc"                          TO MENSAJE3-HTML
001319                  GO TO ENVIAR-ERROR
001320       WHEN OTHER GO TO CERRAR-SESION
001321     END-EVALUATE.
001322
001332     INITIALIZE REG-USUNET.

001334 LEER-USUARIO.
001335     READ ARCHIVO-USUNET NEXT AT END MOVE 0 TO SW-FIN.
001345     CLOSE ARCHIVO-USUNET.

001323     IF USU-LLEGAD-W = 0099
001324     AND CLAVE-LLEGAD-W  = 641218
001325         GO TO PAGINA-CONFIG
001326     END-IF.
001327
001328     IF USU-LLEGAD-W = NIT-USUNET
001329     AND CLAVE-LLEGAD-W   = "@dm1"  
001330         GO TO PAGINA-CONFIG
001331     END-IF.
001336
001337     IF NOMBRE-USUNET = SPACES
001339        MOVE "Validacion de usuarios"      TO MENSAJE1-HTML
001340        MOVE "Falta configurar usuario"    TO MENSAJE2-HTML
001341        MOVE "Sc"                          TO MENSAJE3-HTML
001342        GO TO ENVIAR-ERROR
001343     END-IF.

       INICIAR-RESTRICION.

001612     MOVE FUNCTION CURRENT-DATE TO FECHA-TOTAL.

           INSPECT IP-DATOS-USUNET REPLACING FIRST "/" BY "\"
001614     INITIALIZE NOM-REST-W
001615     MOVE "\\" TO NOM-REST-W
001616
001617     INSPECT NOM-REST-W REPLACING FIRST "                    "
001618                                    BY IP-DATOS-USUNET
001621     INSPECT NOM-REST-W REPLACING FIRST " "
001624                                    BY "\"
007190     INSPECT NOM-REST-W   REPLACING FIRST "                         "
007200                                       BY "PROG\DATOS\SC-ARCHREST.SC".


            OPEN INPUT ARCHIVO-RESTRICCION.
            INITIALIZE LLAVE-REST
007440      MOVE USU-LLEGAD-W TO COD-REST

           READ ARCHIVO-RESTRICCION WITH NO LOCK
003             INVALID KEY
003785                  MOVE "99"                   TO MENSAJE1-HTML
007240                  MOVE "No existe el usuario" TO MENSAJE2-HTML
007250                  MOVE "ARCHIVO-RESTRICCION"  TO MENSAJE3-HTML
007260                  GO TO ENVIAR-ERROR
003790     END-READ.

           CLOSE ARCHIVO-RESTRICCION.

001238 INICIAR-SESION.

           MOVE "D:\WEB\BOMBAS\DATOS\SC-SESION.DAT"  TO NOM-SESION-W

           OPEN I-O ARCHIVO-SESION


001249     EVALUATE OTR-STAT
001250       WHEN "00"  CONTINUE
001251       WHEN "35"  OPEN OUTPUT ARCHIVO-SESION
001252                  CLOSE ARCHIVO-SESION
001253                  GO TO INICIAR-SESION
001254       WHEN OTHER GO TO CERRAR-SESION
001255     END-EVALUATE.


002070
001257 BORRAR-SESION-ANTERIOR.

001258     MOVE FUNCTION CURRENT-DATE TO FECHA-TOTAL.
001259     ACCEPT HORA-TOTAL FROM TIME.
001260
001261     INITIALIZE LLAVE-SESION
001262     MOVE FECHA-TOTAL TO FECHA-SESION.
001263     START ARCHIVO-SESION KEY >= LLAVE-SESION
001264           INVALID KEY
001265              GO TO ASIGNAR-SESION
           END-START.

001266              
001267 LEER-SESION-ANTERIOR.
001268     READ ARCHIVO-SESION NEXT WITH NO LOCK AT END GO TO ASIGNAR-SESION.
001269
001270     IF FECHA-SESION < FECHA-TOTAL
001271        DELETE ARCHIVO-SESION
001272     END-IF.
001273
001274     IF (HR-SESION + 3) < HR-TOTAL
001275        DELETE ARCHIVO-SESION
001276     END-IF
001277        
001278     GO TO LEER-SESION-ANTERIOR.
001279
001280 ASIGNAR-SESION.

002129     MOVE ID-REST      TO NIT-SESION
002130     MOVE FECHA-TOTAL  TO FECHA-SESION
002131     MOVE HORA-TOTAL   TO HORA-SESION.
002132     INITIALIZE NOMBRE-SESION
001285 
001286     READ ARCHIVO-SESION
001287          INVALID KEY
001288            MOVE IP-CLIENTE-W TO IP-SESION
001289            WRITE REG-SESION  END-WRITE
001290          NOT INVALID KEY
001291             ADD 1 TO SG-TOTAL
001292             GO TO ASIGNAR-SESION
001293     END-READ.
001294
001295     MOVE LLAVE-SESION TO SESION-ENV
001297     CLOSE ARCHIVO-SESION.
001298     
001299
001300 
002147 ENVIO-DATOS.

           MOVE 00                TO ESTADO-ENV
           MOVE COD-REST          TO COD-ENV 
           MOVE NOMBRE-REST       TO NOMBRE-ENV
           MOVE 01                TO OPC-ENV

004378     MOVE "datosrecibidos"  TO COBW3-CNV-NAME
004393     MOVE DATOS-ENVIO       TO COBW3-CNV-VALUE
004403     CALL "COBW3_SET_CNV"   USING COBW3
004413     MOVE "../PAGINAS/RECIBIDOS.ASPX"  TO SALIDA-HTML
004430     PERFORM ABRIR-HTML. 
002439     GO TO CERRAR-SESION.

002486 PAGINA-CONFIG.

           MOVE "D:\WEB\BOMBAS\DATOS\SC-USU-NET.JSON" TO NOM-PLANO-W

           OPEN OUTPUT ARCHIVO-JSON.

           MOVE "{*Usunet*:[" TO  DATOS-PLANO
007630     INSPECT DATOS-PLANO REPLACING ALL "*" BY CARAC-COMILLA
007640     WRITE REG-PLANO.


002501
           MOVE USU-LLEGAD-W          TO ID-USU-J
           MOVE NOMBRE-USUNET         TO NOM-USU-J
           MOVE NIT-USUNET            TO NIT-USU-J
           MOVE DIRECC-USUNET         TO DIRECC-USU-J
           MOVE EMAIL-USUNET          TO EMAIL-USU-J
           MOVE CLAVE-EMAIL-USUNET    TO CLAVE-USU-J
           MOVE SERV-EMAIL-USUNET     TO SERV-EMAIL-USU-J
           MOVE PUERTO-EMAIL-USUNET   TO PUERTO-EMAIL-USU-J
           MOVE SSL-EMAIL-USUNET      TO SSL-EMAIL-USU-J

           MOVE IP-DATOS-USUNET       TO IP-DATOS-USU-J
           INSPECT IP-DATOS-USU-J REPLACING ALL "\" BY "/"

           MOVE IP-DESCARGA-USUNET    TO IP-DESC-USU-J
           INSPECT IP-DESC-USU-J REPLACING ALL "\" BY "/"

           MOVE DIRECTORIO-USUNET     TO DIRECTORIO-USU-J

           INSPECT LIN-1 REPLACING ALL "*" BY CARAC-COMILLA
           MOVE LIN-1        TO DATOS-PLANO.
           WRITE REG-PLANO


           PERFORM LLENAR-TABLA-DIR VARYING I FROM 1 BY 1
                                             UNTIL I > 50.

           IF CONT-W > 0
              MOVE SPACE TO CIERRE-LIN-02
              MOVE LIN-2        TO DATOS-PLANO
              WRITE REG-PLANO
           END-IF.


008060     MOVE "]}]}" TO DATOS-PLANO
008070     WRITE REG-PLANO END-WRITE

           CLOSE ARCHIVO-JSON.

004378     MOVE "datosrecibidos"  TO COBW3-CNV-NAME
004393     MOVE "00|02"           TO COBW3-CNV-VALUE
004403     CALL "COBW3_SET_CNV"   USING COBW3
004413     MOVE "../PAGINAS/RECIBIDOS.ASPX"  TO SALIDA-HTML
004430     PERFORM ABRIR-HTML. 
002544
002545 CERRAR-SESION.
002546     CALL "COBW3_FREE" USING COBW3.
002547     MOVE 1 TO PROGRAM-STATUS.
002548     EXIT PROGRAM.
002549
002240 EDITAR-NUMERO.
002241     INSPECT EDITADO-W  CONVERTING  "ABCDEFGHIJKLMNOPQRSTUVWXYZ"
002242                                 TO "                          ".
002243
002244     MOVE EDITADO-W  TO TABLA-COD1.
002245     INITIALIZE    TABLA-COD2 SW-ALFA.
002246     MOVE 15 TO LP.
002247     PERFORM MOVER-COD VARYING LN FROM 15 BY -1
002248                         UNTIL LN < 1 OR LP < 1.
002249
002250     INSPECT TABLA-COD2 REPLACING ALL " " BY "0".
002251         
002252 MOVER-COD.
002253     IF COD1-PAC (LN) IS NUMERIC
002254     OR COD1-PAC (LN) = "-"     
002255        MOVE COD1-PAC (LN) TO COD2-PAC (LP)
002256        SUBTRACT 1 FROM LP
002257     END-IF.

       LLENAR-TABLA-DIR.
           IF DIR-DIR-NET (I) = SPACES OR LOW-VALUES
              CONTINUE
           ELSE
               MOVE DIR-DIR-NET (I)    TO DIR-J 
               MOVE ","      TO CIERRE-LIN-02
               INSPECT LIN-2 REPLACING ALL "*" BY CARAC-COMILLA
               MOVE LIN-2        TO DATOS-PLANO
               WRITE REG-PLANO
               ADD 1 TO CONT-W
           END-IF.

       FIN-VALIDAR-SESION.

002566 COPY "P:\PROG\PROYECT\FUENTES\SC-WEB.CBL".
002567
