000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. INV030.
000030*   FACTURACION - DESCARGA INVENTARIOS.
000040
000050 ENVIRONMENT     DIVISION.
000060 INPUT-OUTPUT SECTION.
000070 FILE-CONTROL.
000080
000090 COPY "P:\PROG\PROYECT\FUENTES\FS-FACTURA.CBL".
000091 COPY "P:\PROG\PROYECT\FUENTES\FS-FACTURA2.CBL".
000100 COPY "P:\PROG\PROYECT\FUENTES\FS-ARTIC.CBL".
000110 COPY "P:\PROG\PROYECT\FUENTES\FS-CARRO.CBL".
000113
000114     SELECT ARCHIVO-GRUPOS LOCK MODE IS AUTOMATIC
000115            ASSIGN NOM-GRP-W
000116            ORGANIZATION IS INDEXED
000117            ACCESS MODE IS DYNAMIC
000118            RECORD KEY IS LLAVE-GRUPO
000119            ALTERNATE RECORD KEY IS DESCRIP-GRUPO WITH DUPLICATES
000120            FILE STATUS IS OTR-STAT.
000122
000130     SELECT REGCONT LOCK MODE IS AUTOMATIC
000140            ASSIGN NOM-FEC-LNK
000150            FILE STATUS OTR-STAT.
000160     
000170     SELECT ARCHIVO-USUARIOS LOCK MODE IS AUTOMATIC
000180            ASSIGN NOM-USU-W
000190            ORGANIZATION IS INDEXED
000200            ACCESS MODE IS DYNAMIC;
000210            RECORD KEY IS NOMBRE-USU
000220            ALTERNATE RECORD KEY IS CTL-USU     WITH DUPLICATES
000230            ALTERNATE RECORD KEY IS CLAVE-USU   WITH DUPLICATES
000240            ALTERNATE RECORD KEY IS CLAVE-2-USU WITH DUPLICATES
000250            FILE STATUS IS OTR-STAT.
000260
000270     SELECT ARCHIVO-SALDOS LOCK MODE IS AUTOMATIC
000280            ASSIGN NOM-SALD-LNK
000290            ORGANIZATION INDEXED;
000300            ACCESS MODE  DYNAMIC;
000310            RECORD KEY LLAVE-SAL
000320            ALTERNATE RECORD KEY COD-ART-SAL  WITH DUPLICATES
000330            ALTERNATE RECORD KEY COD-LOTE-SAL WITH DUPLICATES
000340            FILE STATUS IS OTR-STAT.
000350
000360     SELECT MOVIMIENTO-INVENT LOCK MODE IS AUTOMATIC
000370            ASSIGN NOM-INV
000380            ORGANIZATION IS INDEXED;
000390            ACCESS MODE IS DYNAMIC
000400            RECORD KEY IS LLAVE-INV
000410            ALTERNATE RECORD KEY COD-ART-INV   WITH DUPLICATES
000420            ALTERNATE RECORD KEY SECUENCIA-INV
000430            ALTERNATE RECORD KEY NIT-INV       WITH DUPLICATES
000440            ALTERNATE RECORD KEY FECHA-INV     WITH DUPLICATES
000450            ALTERNATE RECORD KEY LLAVE-DOC-CTL-INV WITH DUPLICATES
000460            FILE STATUS IS OTR-STAT.
000470
000480 DATA DIVISION.
000490 FILE SECTION.
000500 COPY "P:\PROG\PROYECT\FUENTES\FD-USUAR.CBL".
000510 COPY "P:\PROG\PROYECT\FUENTES\FD-FACTURA.CBL".
000511 COPY "P:\PROG\PROYECT\FUENTES\FD-FACTURA2.CBL".
000520 COPY "P:\PROG\PROYECT\FUENTES\FD-INVEN.CBL".
000530 COPY "P:\PROG\PROYECT\FUENTES\FD-ARTIC.CBL".
000540 COPY "P:\PROG\PROYECT\FUENTES\FD-FECHA.CBL".
000550 COPY "P:\PROG\PROYECT\FUENTES\FD-SALDO.CBL".
000560 COPY "P:\PROG\PROYECT\FUENTES\FD-CARRO.CBL".
000561 COPY "P:\PROG\PROYECT\FUENTES\FD-GRUPO.CBL".
000570
000580 WORKING-STORAGE SECTION.
000590 COPY "P:\PROG\PROYECT\FUENTES\WEB-CARAC.CBL".
000600
000601 01  NOM-FACT2-LNK                         PIC X(70).
000602 01  NOM-GRP-W                             PIC X(70).
000610 01  SW9                                   PIC 9.
000620 01  LLAVE-W                               PIC X(9).
000630 01  MES-ARCHIVO                           PIC X(4).
000640 01  NOM-CAR-LNK                           PIC X(50).
000650 01  DIR-CAJ-W                             PIC X(30).
000660
000670 01  VARIABLES.
000680     02  SECU-TEM                          PIC 9(3).
000690     02  VLR-COSTO-W                       PIC S9(12)V99.
000700     02  VALOR-BRUTO                       PIC S9(12).
000710     02  FACTOR-DCTO                       PIC 99V9(4).
000720     02  VALOR-ICAV                        PIC S9(12)V99.
000730     02  SW-INICIO                         PIC 9.
000731
000732
000733 01  TAB-FACT-W.
000734     02 TABLA-FACT-W OCCURS 999.
000735        03 LLAVE-ART-FACT-W.
000736           05 ALMACEN-FACT-W.
000737              09 TIPO-ALM-FACT-W.
000738                 11 ALM1-FACT-W        PIC X.
000739                 11 ALM2-FACT-W        PIC X.
000740              09 ALM3-FACT-W           PIC XXX.
000741           05 COD-ART-FACT-W.
000742              09 LLAVE-GRUPO-FACT-W.
000743                 10 TIPO-ART-FACT-W    PIC 9.
000744                 10 GRUPO-FACT-W.
000745                    15 GRP1-FACT-W     PIC X.
000746                    15 GRP2-FACT-W     PIC X.
000747              09 NUMERO-ART-FACT-W.
000748                 10 NRO1-ART-FACT-W    PIC XX.
000749                 10 NRO2-ART-FACT-W    PIC X(11).
000750              09 CLASE-ART-FACT-W      PIC XX.
000751           05 COD-LOTE-FACT-W.
000752              09 ANO-CRE-LOTE-FACT-W     PIC 9(4).
000753              09 CONSEC-LOTE-FACT-W      PIC 9(5).
000754        03 CANTIDAD-FACT-W             PIC S9(12)V99.
000755        03 VALOR-FACT-W                PIC S9(12)V99.
000756        03 COSTO-FACT-W                PIC S9(9).
000757        03 BRUTO-FACT-W                PIC S9(12)V99.
000758        03 IVA-FACT-W                  PIC S9(12)V99.
000759        03 CONSUMO-FACT-W              PIC S9(12)V99.
000760        03 TIPO-DOC-FACT-W             PIC X.
000761        03 SUC-DOC-FACT-W              PIC X.
000762        03 NRO-DOC-FACT-W              PIC 9(6).
000763        03 LISTA-ACOMPA-FACT-W.
000764           05 ACOMPA1-FACT-W           PIC 99.
000765           05 ACOMPA2-FACT-W           PIC 99.
000766        03 LIST-PREC-FACT-W            PIC X.
000767        03 CANT-FACT-FACT-W            PIC S9(8)V99.
000768        03 VALOR-FACT-FACT-W           PIC S9(12)V99.  
000769        03 DCTO-EXT-FACT-W             PIC S9(3)V99.
000770        03 PENDIENTE-FACT-W            PIC X.
000771        03 EXT-DESCRIP-FACT-W          PIC X(86).
000772        03 FILLER                      PIC X(5000).
000773
000774 LINKAGE SECTION.
000775 01 NRO-FACT-030-LNK       PIC 9(6).
000780 01 TIPO-030-LNK.
000790    02 ITEM-030-LNK        PIC 9.
000800    02 PREF-030-LNK        PIC XX.
000810 01 DIRECTORIO-W           PIC X(35).
000820 01 NOMBRE-LNK             PIC X(30).
000830 01 INVALID-INV            PIC 99.
000840 01 MENSAJE-LNK            PIC X(100).
000850
000860
000870 PROCEDURE DIVISION USING NRO-FACT-030-LNK TIPO-030-LNK DIRECTORIO-W NOMBRE-LNK INVALID-INV MENSAJE-LNK.
000880
000890 DECLARATIVES.
000900 I-O-TEST SECTION.
000910     USE AFTER EXCEPTION PROCEDURE ON REGCONT.
000920
000930 ESCR-EXCEPTIONES.
000940     IF OTR-STAT = "00"
000950        CONTINUE      
000960     ELSE
000970        MOVE OTR-STAT      TO INVALID-INV 
000980        MOVE NOM-FEC-LNK   TO MENSAJE-LNK      
000990        GO TO SALIR     
001000     END-IF.
001010
001020 I-O-TEST SECTION.
001030     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUARIOS.
001040
001050 ESCR-EXCEPTIONES.
001060     IF OTR-STAT = "00"
001070        CONTINUE      
001080     ELSE
001090        MOVE OTR-STAT   TO INVALID-INV 
001100        MOVE NOM-USU-W  TO MENSAJE-LNK      
001110        GO TO SALIR     
001120     END-IF.
001130
001140 I-O-TEST SECTION.
001150     USE AFTER EXCEPTION PROCEDURE ON MOVIMIENTO-INVENT.
001160
001170 ESCR-EXCEPTIONES.
001180     IF OTR-STAT = "00"
001190        CONTINUE      
001200     ELSE
001210        MOVE OTR-STAT  TO INVALID-INV       
001220        MOVE NOM-INV   TO MENSAJE-LNK
001230        GO TO SALIR      
001240     END-IF.
001250
001260 I-O-TEST SECTION.
001270     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SALDOS.
001280
001290 ESCR-EXCEPTIONES.
001300     IF OTR-STAT = "00"
001310        CONTINUE      
001320     ELSE
001330        MOVE OTR-STAT      TO INVALID-INV       
001340        MOVE NOM-SALD-LNK  TO MENSAJE-LNK
001350        GO TO SALIR    
001360     END-IF.
001370
001380 I-O-TEST SECTION.
001390     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-FACTURAS.
001400
001410 ESCR-EXCEPTIONES.
001420     IF OTR-STAT = "00" 
001430        CONTINUE      
001440     ELSE
001450        MOVE OTR-STAT      TO INVALID-INV       
001460        MOVE NOM-FACT-LNK  TO MENSAJE-LNK
001470        GO TO SALIR    
001480     END-IF.
001481
001482 I-O-TEST SECTION.
001483     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-FACTURAS2.
001484
001485 ESCR-EXCEPTIONES.
001486     IF OTR-STAT = "00" 
001487        CONTINUE      
001488     ELSE
001489        MOVE OTR-STAT       TO INVALID-INV  
001490        MOVE NOM-FACT2-LNK  TO MENSAJE-LNK        
001491        GO TO SALIR    
001492     END-IF.
001493
001500 I-O-TEST SECTION.
001510     USE AFTER EXCEPTION PROCEDURE ON MAESTRO-ARTICULOS.
001520
001530 ESCR-EXCEPTIONES.
001540     IF OTR-STAT = "00"
001550        CONTINUE      
001560     ELSE
001570        MOVE OTR-STAT     TO INVALID-INV       
001580        MOVE NOM-ART-LNK  TO MENSAJE-LNK
001590        GO TO SALIR     
001600     END-IF.
001610
001620 I-O-TEST SECTION.
001630     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-GRUPOS.
001640
001650 ESCR-EXCEPTIONES.
001660     IF OTR-STAT = "00"
001670        CONTINUE      
001680     ELSE
001690        MOVE OTR-STAT     TO INVALID-INV       
001700        MOVE NOM-GRP-W    TO MENSAJE-LNK
001710        GO TO SALIR     
001720     END-IF.
001721
001722 I-O-TEST SECTION.
001723     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-CARROS.
001724
001725 ESCR-EXCEPTIONES.
001726     IF OTR-STAT = "00"
001727        CONTINUE      
001728     ELSE
001729        MOVE OTR-STAT     TO INVALID-INV       
001730        MOVE NOM-CAR-LNK  TO MENSAJE-LNK
001731        GO TO SALIR     
001732     END-IF.
001733
001734 END DECLARATIVES.
001750 PROCEDURAL SECTION.
001760
001770 ACOMODAR-NOMBRES.
001771
001780     MOVE DIRECTORIO-W TO DIR-CAJ-W.
001790
001800     INSPECT DIR-CAJ-W REPLACING FIRST "\ENE "  BY    "     ".
001810     INSPECT DIR-CAJ-W REPLACING FIRST "\FEB "  BY    "     ".
001820     INSPECT DIR-CAJ-W REPLACING FIRST "\MAR "  BY    "     ".
001830     INSPECT DIR-CAJ-W REPLACING FIRST "\ABR "  BY    "     ".
001840     INSPECT DIR-CAJ-W REPLACING FIRST "\MAY "  BY    "     ".
001850     INSPECT DIR-CAJ-W REPLACING FIRST "\JUN "  BY    "     ".
001860     INSPECT DIR-CAJ-W REPLACING FIRST "\JUL "  BY    "     ".
001870     INSPECT DIR-CAJ-W REPLACING FIRST "\AGT "  BY    "     ".
001880     INSPECT DIR-CAJ-W REPLACING FIRST "\SEP "  BY    "     ".
001890     INSPECT DIR-CAJ-W REPLACING FIRST "\OCT "  BY    "     ".
001900     INSPECT DIR-CAJ-W REPLACING FIRST "\NOV "  BY    "     ".
001910     INSPECT DIR-CAJ-W REPLACING FIRST "\DIC "  BY    "     ".
001920     INSPECT DIR-CAJ-W REPLACING FIRST "\CIE "  BY    "     ".
001921
001922     INSPECT NOMBRE-LNK REPLACING FIRST " " BY "\"
001930
001931     INITIALIZE NOM-USU-W NOM-ART-LNK NOM-GRP-W NOM-FEC-LNK NOM-FACT-LNK NOM-FACT2-LNK
001940     MOVE NOMBRE-LNK TO NOM-USU-W.
001941
001950     INSPECT NOM-USU-W REPLACING FIRST "                              "
001960                                    BY DIR-CAJ-W
001963
001964     MOVE NOM-USU-W  TO NOM-ART-LNK NOM-GRP-W NOM-FEC-LNK 
001965
001970     INSPECT NOM-USU-W REPLACING FIRST "                       "     
001980                                    BY "\CONTROL\SC-ARCHUSU.DAT".  
001990
002000     INSPECT NOM-ART-LNK REPLACING FIRST "                       "
002010                                      BY "\CONTROL\SC-MAESART.DAT".
002020
002030     INSPECT NOM-MACRINV-LNK REPLACING FIRST "                        "
002040                                          BY "\CONTROL\SC-MACROINV.DAT".
002041
002043     INSPECT NOM-FEC-LNK REPLACING FIRST "                       "
002044                                      BY "\CONTROL\SC-REGCONT.DAT".
002045
002046     INSPECT NOM-GRP-W REPLACING FIRST "                        "
002047                                    BY "\CONTROL\SC-GRUPOINV.DAT".
002048
002049
002050     INITIALIZE NOM-CAR-LNK NOM-SALD-LNK NOM-INV
002051     MOVE NOMBRE-LNK   TO NOM-CAR-LNK
002052     INSPECT NOM-CAR-LNK REPLACING FIRST "                         "
002053                                      BY "\PROG\DATOS\SC-CARROS.DAT".
002054      
002100     MOVE NOMBRE-LNK TO NOM-SALD-LNK 
002110     INSPECT NOM-SALD-LNK REPLACING FIRST "                              "
002120                                       BY DIR-CAJ-W
002130  
002140     MOVE NOMBRE-LNK TO NOM-INV 
002150     INSPECT NOM-INV REPLACING FIRST "                              "
002160                                  BY DIR-CAJ-W.
002161
002170 LEER-USUARIO.
002180     OPEN INPUT ARCHIVO-USUARIOS.
002190     READ ARCHIVO-USUARIOS NEXT WITH NO LOCK AT END MOVE 0 TO SW9.
002200     CLOSE ARCHIVO-USUARIOS.
002210     
002220     OPEN INPUT REGCONT.
002230     READ REGCONT WITH NO LOCK AT END MOVE 0 TO ANO-NUM
002240     END-READ.
002250     CLOSE REGCONT.
002251
002270 ASIGNAR-NOMBRE.
002280     IF ITEM-030-LNK = 0 OR " "
002290        MOVE 1 TO ITEM-030-LNK
002300     END-IF.
002310     MOVE NOM-USU-W TO NOM-FACT-LNK.
002320
002321
002322     MOVE NOM-USU-W TO NOM-FACT-LNK NOM-FACT2-LNK
002323
002324     INSPECT NOM-FACT-LNK REPLACING FIRST "SC-ARCHUSU.DAT    "
002325                                       BY "SC-ARCHFACT-01.DAT".
002326
002327     INSPECT NOM-FACT2-LNK REPLACING FIRST "SC-ARCHUSU.DAT      "
002328                                        BY "SC-ARCHEXFACT-01.DAT".
002330
002570 ABRIR-ARCHIVOS.
002571
002580     OPEN INPUT ARCHIVO-FACTURAS
002581                ARCHIVO-FACTURAS2
002590                ARCHIVO-GRUPOS
002591                ARCHIVO-CARROS.
002600
002610 LEER-FACTURA.
002620     MOVE NRO-FACT-030-LNK TO NRO-FAC.
002630     READ ARCHIVO-FACTURAS WITH NO LOCK
002640          INVALID KEY
002650            MOVE 99 TO INVALID-INV
002660            MOVE "NO EXISTE LA FACTURA" TO MENSAJE-LNK
002670            CLOSE ARCHIVO-FACTURAS
002671                  ARCHIVO-FACTURAS2
002680                  ARCHIVO-GRUPOS
002681                  ARCHIVO-CARROS
002690            GO TO SALIR     
002700     END-READ.
002710          
002720     IF ANO-FAC IS NOT EQUAL TO ANO-ALFA
002730        MOVE "FACTURA DE OTRO ANO" TO MENSAJE-LNK
002740        MOVE 99 TO INVALID-INV
002750        CLOSE ARCHIVO-FACTURAS
002751              ARCHIVO-FACTURAS2
002752              ARCHIVO-GRUPOS
002760              ARCHIVO-CARROS
002770        GO TO SALIR 
002780     END-IF.
002781
002782     MOVE PLACA-FAC      TO PLACA-CAR
002783     READ ARCHIVO-CARROS WITH NO LOCK
002785          INVALID KEY
002786                  MOVE NIT-FAC TO COND-CAR
002787     END-READ.
002788
002810     CLOSE ARCHIVO-FACTURAS.
002820     EVALUATE MES-FAC
002830       WHEN 01 MOVE "\ENE" TO MES-ARCHIVO
002840       WHEN 02 MOVE "\FEB" TO MES-ARCHIVO
002850       WHEN 03 MOVE "\MAR" TO MES-ARCHIVO
002860       WHEN 04 MOVE "\ABR" TO MES-ARCHIVO
002870       WHEN 05 MOVE "\MAY" TO MES-ARCHIVO
002880       WHEN 06 MOVE "\JUN" TO MES-ARCHIVO
002890       WHEN 07 MOVE "\JUL" TO MES-ARCHIVO
002900       WHEN 08 MOVE "\AGT" TO MES-ARCHIVO
002910       WHEN 09 MOVE "\SEP" TO MES-ARCHIVO
002920       WHEN 10 MOVE "\OCT" TO MES-ARCHIVO
002930       WHEN 11 MOVE "\NOV" TO MES-ARCHIVO
002940       WHEN 12 MOVE "\DIC" TO MES-ARCHIVO
002950     END-EVALUATE.
002960    
002970     INSPECT NOM-INV REPLACING FIRST "    " BY MES-ARCHIVO
002980     INSPECT NOM-INV REPLACING FIRST "              " 
002990                                  BY "\SC-MOVINV.DAT"     
003000
003010     OPEN I-O MOVIMIENTO-INVENT.
003020     
003030     IF OTR-STAT IS NOT EQUAL TO "00"
003040        MOVE OTR-STAT            TO INVALID-INV
003050        MOVE "MOVIMIENTO-INVENT" TO MENSAJE-LNK
003060        CLOSE ARCHIVO-GRUPOS
003061              ARCHIVO-CARROS
003070              MOVIMIENTO-INVENT
003080        GO TO SALIR
003090     END-IF.
003100
003110
003120     MOVE NOM-INV TO NOM-SALD-LNK.
003130     INSPECT NOM-SALD-LNK REPLACING FIRST "SC-MOVINV.DAT"
003140                                    BY    "SC-SALDO.DAT ".
003150     INITIALIZE VARIABLES.
003160
003170 BUSCAR-MOVIMIENTO.
003180     ADD 1 TO SW-INICIO.
003190
003191     MOVE ITEM-030-LNK TO SUC-TRANS-INV
003192     MOVE ITEM-030-LNK TO SUC-TRANS-INV
003193
003200     EVALUATE SW-INICIO
003210       WHEN 1 EVALUATE ITEM-030-LNK
003211                  WHEN 1 MOVE "20"  TO COD-TRANS-INV
003212                  WHEN 2 MOVE "2A"  TO COD-TRANS-INV
003213                  WHEN 3 MOVE "2a"  TO COD-TRANS-INV
003214                  WHEN 4 MOVE "2b"  TO COD-TRANS-INV
003215                  WHEN 5 MOVE "2c"  TO COD-TRANS-INV
003216                  WHEN 6 MOVE "2d"  TO COD-TRANS-INV
003217                  WHEN 7 MOVE "2e"  TO COD-TRANS-INV
003218                  WHEN 8 MOVE "2f"  TO COD-TRANS-INV
003219                  WHEN 9 MOVE "2g"  TO COD-TRANS-INV
003220              END-EVALUATE
003230       WHEN 2 MOVE 18   TO COD-TRANS-INV
003250       WHEN OTHER GO TO FIN-BORRAR
003260     END-EVALUATE.
003270
003280     MOVE NRO-FACT-030-LNK  TO COMPROB-INV.
003290     MOVE LLAVE-SEC-INV TO LLAVE-W.
003300
003310     START MOVIMIENTO-INVENT KEY = LLAVE-SEC-INV
003320           INVALID KEY
003330              GO TO BUSCAR-MOVIMIENTO
003340     END-START.
003350
003360 LEER-INVENTARIOS.
003370     READ MOVIMIENTO-INVENT NEXT WITH NO LOCK AT END
003380          GO TO BUSCAR-MOVIMIENTO.
003390
003400     IF LLAVE-SEC-INV IS NOT EQUAL TO LLAVE-W
003410        GO TO BUSCAR-MOVIMIENTO
003420     END-IF.
003421
003422     IF COD-TRANS-INV = 18  AND DOCUM-INV IS NOT = "FACT."
003423        GO TO LEER-INVENTARIOS
003424     END-IF
003425
003430
003440     DELETE MOVIMIENTO-INVENT.
003450     PERFORM ACTUALIZAR-BORRAR.
003460     GO TO LEER-INVENTARIOS.
003470
003480 FIN-BORRAR.
003490     CLOSE   MOVIMIENTO-INVENT.
003500
003510     INITIALIZE REG-INVENT.
003520     MOVE NRO-FACT-030-LNK TO COMPROB-INV.
003530     MOVE ANO-FAC          TO ANO-INV.
003540     MOVE MES-FAC          TO MES-INV.
003550     MOVE DIA-FAC          TO DIA-INV.
003560     MOVE "FACT."          TO DOCUM-INV.
003570     MOVE NIT-FAC          TO NIT-INV.
003580     MOVE 0                TO SW-INICIO.
003581     MOVE COND-CAR         TO NIT-RECIBE-INV.
003582
003583     IF NIT-USU = 860536303 AND COD-CIU-USU =  "73268"
003584        MOVE USO-ART      TO COSTO-INV
003585     ELSE
003586        MOVE C-COSTO-FAC  TO COSTO-INV
003587     END-IF
003589
003591     MOVE ADMIN-ELAB-FAC  TO OPER-ELAB-INV
003600     MOVE FECHA-ELAB-FAC  TO FECHA-ELAB-INV
003601     MOVE HORA-ELAB-FAC   TO HORA-ELAB-INV.
003603
003604
003610 REVISAR-CODIGO.
003630     IF VALOR-DES-FAC > 0
003640        PERFORM SUMAR-VALORES VARYING I FROM 1 BY 1
003650                                UNTIL I > ITEM-MAX-USU
003660 
003670        IF VALOR-DES-FAC IS NOT EQUAL TO 0
003680           COMPUTE FACTOR-DCTO ROUNDED = 1 - (VALOR-DES-FAC / (VALOR-BRUTO - VALOR-ICAV))
003690        END-IF
003700
003710        PERFORM DISTRIBUIR-DESCTO VARYING I FROM 1 BY 1
003720                                    UNTIL I > ITEM-MAX-USU
003730        PERFORM AJUSTAR-DCTO
003740     END-IF.
003750
003760     PERFORM REGISTRO-MOVIMIENTO	VARYING I FROM 1 BY 1
003770                                    UNTIL I > ITEM-MAX-USU
003780     GO TO SALIR.
003790
003791 CARGAR-ARTICULOS-FACT.
003792     MOVE NRO-FAC TO NRO-FAC2
003793     MOVE I       TO ITEM-FAC2
003795     MOVE 0       TO SW-FIN
003796
003797     READ ARCHIVO-FACTURAS2 WITH NO LOCK
003798          INVALID KEY
003799                  INITIALIZE TABLA-FACT-W (I)
003800          NOT INVALID KEY  IF CANTIDAD-FAC2 = 0
003801                              INITIALIZE TABLA-FACT-W(I)
003802                           ELSE
003803                              MOVE LLAVE-ART-FAC2    TO LLAVE-ART-FACT-W(I)
003804                              MOVE CANTIDAD-FAC2     TO CANTIDAD-FACT-W(I)
003805                              MOVE VALOR-FAC2        TO VALOR-FACT-W(I)
003806                              MOVE COSTO-FAC2        TO COSTO-FACT-W(I)
003807                              MOVE BRUTO-FAC2        TO BRUTO-FACT-W(I) 
003808                              MOVE IVA-FAC2          TO IVA-FACT-W(I) 
003809                              MOVE CONSUMO-FAC2      TO CONSUMO-FACT-W(I) 
003810                              MOVE TIPO-DOC-FAC2     TO TIPO-DOC-FACT-W(I) 
003811                              MOVE SUC-DOC-FAC2      TO SUC-DOC-FACT-W(I) 
003812                              MOVE NRO-DOC-FAC2      TO NRO-DOC-FACT-W(I) 
003813                              MOVE LISTA-ACOMPA-FAC2 TO LISTA-ACOMPA-FACT-W(I) 
003814                              MOVE LIST-PREC-FAC2    TO LIST-PREC-FACT-W(I) 
003815                              MOVE CANT-FACT-FAC2    TO CANT-FACT-FACT-W(I) 
003816                              MOVE VALOR-FACT-FAC2   TO VALOR-FACT-FACT-W(I) 
003817                              MOVE DCTO-EXT-FAC2     TO DCTO-EXT-FACT-W(I) 
003818                              MOVE PENDIENTE-FAC2    TO PENDIENTE-FACT-W(I) 
003819                              MOVE EXT-DESCRIP-FAC2  TO EXT-DESCRIP-FACT-W(I) 
003820                           END-IF
003821     END-READ.
003822
003828
003829 SUMAR-VALORES.
003830     ADD VALOR-FACT-W (I)  TO VALOR-BRUTO.
003831 
003832     IF COD-ART-FACT-W (I) = "09990001"
003840                        OR "099ICAB"
003850                        OR "099ICAV"
003860        ADD VALOR-FACT-W (I) TO VALOR-ICAV
003870     END-IF.
003880
003890 DISTRIBUIR-DESCTO.
003900     IF COD-ART-FACT-W (I) = "09990001"
003910                        OR "099ICAB"
003920                        OR "099ICAV"
003930        CONTINUE
003940     ELSE
003950        COMPUTE VALOR-FACT-W (I) ROUNDED = VALOR-FACT-W (I) * FACTOR-DCTO
003960     END-IF.
003970
003980 AJUSTAR-DCTO.
003990     COMPUTE   VALOR-FACT-W (1) =  VALOR-BRUTO     - VALOR-DES-FAC
004000             - VALOR-FACT-W (02) - VALOR-FACT-W (03) - VALOR-FACT-W (04)
004010             - VALOR-FACT-W (05) - VALOR-FACT-W (06) - VALOR-FACT-W (07)
004020             - VALOR-FACT-W (08) - VALOR-FACT-W (09) - VALOR-FACT-W (10)
004030             - VALOR-FACT-W (11) - VALOR-FACT-W (12) - VALOR-FACT-W (13)
004040             - VALOR-FACT-W (14) - VALOR-FACT-W (15) - VALOR-FACT-W (16)
004050             - VALOR-FACT-W (17) - VALOR-FACT-W (18) - VALOR-FACT-W (19)
004060             - VALOR-FACT-W (20) - VALOR-FACT-W (21) - VALOR-FACT-W (22)
004070             - VALOR-FACT-W (23) - VALOR-FACT-W (24) - VALOR-FACT-W (25)
004080             - VALOR-FACT-W (26) - VALOR-FACT-W (27) - VALOR-FACT-W (28)
004090             - VALOR-FACT-W (29) - VALOR-FACT-W (30).
004100
004110 REGISTRO-MOVIMIENTO.
004111
004112     IF NIT-USU = 30273 AND GRUPO-FACT-W (I) = "01"
004113        INITIALIZE TABLA-FACT-W (I)
004114     END-IF
004115
004116     IF ALMACEN-FACT-W (I) = "SIN99"
004117        INITIALIZE TABLA-FACT-W (I)
004118     END-IF
004119
004120     COMPUTE CANTIDAD-FACT-W (I) = CANTIDAD-FACT-W (I) * 1
004121
004129
004130     IF  GRP1-FACT-W (I) = "9" OR  CANTIDAD-FACT-W (I) IS ZERO
004150         CONTINUE 
004160     ELSE
004170         IF CANTIDAD-FACT-W (I) >= 0
004171            EVALUATE ITEM-030-LNK
004172               WHEN 1 MOVE "20"  TO COD-TRANS-INV
004173               WHEN 2 MOVE "2A"  TO COD-TRANS-INV
004174               WHEN 3 MOVE "2a"  TO COD-TRANS-INV
004175               WHEN 4 MOVE "2b"  TO COD-TRANS-INV
004176               WHEN 5 MOVE "2c"  TO COD-TRANS-INV
004177               WHEN 6 MOVE "2d"  TO COD-TRANS-INV
004178               WHEN 7 MOVE "2e"  TO COD-TRANS-INV
004179               WHEN 8 MOVE "2f"  TO COD-TRANS-INV
004180               WHEN 9 MOVE "2g"  TO COD-TRANS-INV
004182            END-EVALUATE
004200         ELSE
004210            MOVE "18"          TO COD-TRANS-INV
004230         END-IF
004231
004232         MOVE ITEM-030-LNK  TO SUC-TRANS-INV
004233         MOVE LLAVE-ART-FACT-W (I) TO LLAVE-ART-INV
004234
004235         IF COD-LOTE-INV = ZEROS
004236            CONTINUE
004237         ELSE
004238            INITIALIZE COD-LOTE-INV
004240         END-IF
004241
004243         IF CANTIDAD-FACT-W (I) >= 0
004244            MOVE CANTIDAD-FACT-W  (I)  TO CANT-INV
004245         ELSE
004246            COMPUTE CANT-INV = CANTIDAD-FACT-W (I) * -1
004247         END-IF
004258
004259         IF VALOR-FACT-W (I) >= 0
004260            MOVE VALOR-FACT-W   (I)  TO VLR-VEN-INV
004261         ELSE
004262            COMPUTE VLR-VEN-INV = VALOR-FACT-W (I) * -1
004263         END-IF
004264
004268
004269         MOVE COD-LOTE-FAC2  TO COD-LOTE-INV
004270
004271         IF NIT-USU = 830009610
004272            PERFORM LEER-GRUPO
004273         END-IF
004274
004275         PERFORM GRABAR-MOVIMIENTO
004400     END-IF.
004410
004700 GRABAR-MOVIMIENTO.
004710     OPEN I-O ARCHIVO-SALDOS.
004720     
004730     IF OTR-STAT IS NOT EQUAL TO "00"
004740        MOVE OTR-STAT TO INVALID-INV
004750        MOVE "ARCHIVO-SALDOS" TO MENSAJE-LNK
004760        GO TO SALIR
004770     END-IF.
004780
004790     INITIALIZE REG-SALDOS.
004800     MOVE LLAVE-ART-INV TO LLAVE-SAL.
004810
004820     IF COD1-TRANS-INV = 1
004830        PERFORM ACTUALIZAR-ENTRADA
004840     ELSE
004850        PERFORM ACTUALIZAR-SALIDA
004860     END-IF.
004870
004880     CLOSE ARCHIVO-SALDOS.
004890     ADD  1        TO SECU-TEM.
004900     MOVE SECU-TEM TO SECU-INV.
004910     OPEN I-O MOVIMIENTO-INVENT.
004920     
004930     IF OTR-STAT IS NOT EQUAL TO "00"
004940        MOVE OTR-STAT TO INVALID-INV
004950        MOVE "MOVIMIENTO-INVENT" TO MENSAJE-LNK
004960        GO TO SALIR
004970     END-IF.
004980
004990     WRITE REG-INVENT.
005000     CLOSE MOVIMIENTO-INVENT.
005010
005020     IF  ALM1-INV  = "CN"
005030         MOVE "TP" TO ALM1-INV
005040         PERFORM ACTUALIZAR-TEMPORAL
005050     END-IF.
005060
005070 ACTUALIZAR-TEMPORAL.
005080     OPEN I-O ARCHIVO-SALDOS.
005090     INITIALIZE REG-SALDOS.
005100     MOVE LLAVE-ART-INV TO LLAVE-SAL.
005110
005120     IF COD1-TRANS-INV = 1
005130        PERFORM ACTUALIZAR-ENTRADA
005140     ELSE
005150        PERFORM ACTUALIZAR-SALIDA
005160     END-IF.
005170
005180     CLOSE ARCHIVO-SALDOS.
005190     ADD  1        TO SECU-TEM.
005200     MOVE SECU-TEM TO SECU-INV.
005210     OPEN I-O MOVIMIENTO-INVENT.
005220
005230     IF OTR-STAT IS NOT EQUAL TO "00"
005240        MOVE OTR-STAT TO INVALID-INV
005250        MOVE "MOVIMIENTO-INVENT" TO MENSAJE-LNK         
005260        GO TO SALIR
005270     END-IF.
005280
005290     WRITE REG-INVENT.
005300     CLOSE MOVIMIENTO-INVENT.
005310
005320 ACTUALIZAR-ENTRADA.
005330     READ ARCHIVO-SALDOS WITH NO LOCK
005340          INVALID KEY
005350             MOVE CANT-INV    TO ACUM-ENT-CANT (DIA-FAC)
005360             WRITE REG-SALDOS
005370             INITIALIZE VLR-INV
005380          NOT INVALID KEY
005390             INITIALIZE VARIABLES-SALDOS-W
005400             PERFORM CALCULAR-SALDO-ACTUAL VARYING DIA-SDO-W FROM 1 BY 1 UNTIL
005410                                           DIA-SDO-W > DIA-FAC
005420             IF SDO-ACT-CANT-W IS NOT EQUAL TO 0
005430                COMPUTE VLR-INV ROUNDED = (SDO-ACT-VLR-W / SDO-ACT-CANT-W )
005440             END-IF
005450             COMPUTE VLR-INV = VLR-INV * CANT-INV
005460             ADD CANT-INV TO ACUM-ENT-CANT (DIA-FAC)
005470             ADD VLR-INV  TO ACUM-ENT-VLR  (DIA-FAC)
005480             REWRITE REG-SALDOS
005490     END-READ.
005500
005510 ACTUALIZAR-SALIDA.
005520     READ ARCHIVO-SALDOS WITH NO LOCK
005530          INVALID KEY
005540             MOVE CANT-INV  TO ACUM-SAL-CANT (DIA-FAC)
005550             WRITE REG-SALDOS
005560             INITIALIZE VLR-INV
005570          NOT INVALID KEY
005580             PERFORM CALCULAR-SALDO-ACTUAL VARYING DIA-SDO-W FROM 1 BY 1 UNTIL
005590                                           DIA-SDO-W > DIA-FAC
005600             IF SDO-ACT-CANT-W IS NOT EQUAL TO 0
005610                COMPUTE VLR-INV ROUNDED = (SDO-ACT-VLR-W / SDO-ACT-CANT-W )
005620             END-IF
005630             COMPUTE VLR-INV ROUNDED = VLR-INV * CANT-INV
005640             ADD CANT-INV TO ACUM-SAL-CANT (DIA-FAC)
005650             ADD VLR-INV  TO ACUM-SAL-VLR  (DIA-FAC)
005660             REWRITE REG-SALDOS
005670     END-READ.
005680
005690 ACTUALIZAR-BORRAR.
005700     OPEN I-O ARCHIVO-SALDOS.
005710     IF OTR-STAT IS NOT EQUAL TO "00"
005720        MOVE OTR-STAT TO INVALID-INV
005730        MOVE "MOVIMIENTO-INVENT" TO MENSAJE-LNK
005740        CLOSE MOVIMIENTO-INVENT
005750        GO TO SALIR
005760     END-IF.
005770
005780     INITIALIZE REG-SALDOS.
005790     MOVE LLAVE-ART-INV TO LLAVE-SAL.
005800     MOVE COD-LOTE-INV  TO COD-LOTE-SAL.
005810
005820     READ ARCHIVO-SALDOS WITH NO LOCK
005830          INVALID KEY
005840             INITIALIZE REG-SALDOS
005850          NOT INVALID KEY
005860              IF COD1-TRANS-INV = 2
005870                 SUBTRACT CANT-INV FROM ACUM-SAL-CANT (DIA-FAC)
005880                 SUBTRACT VLR-INV  FROM ACUM-SAL-VLR  (DIA-FAC)
005890              ELSE
005900                 SUBTRACT CANT-INV FROM ACUM-ENT-CANT (DIA-FAC)
005910                 SUBTRACT VLR-INV  FROM ACUM-ENT-VLR  (DIA-FAC)
005920              END-IF
005930              REWRITE REG-SALDOS
005940     END-READ.
005950     CLOSE ARCHIVO-SALDOS. 
005951
005952 CERRAR-ARCHIVOS.
005953     CLOSE ARCHIVO-GRUPOS
005954           ARCHIVO-CARROS
005955           MOVIMIENTO-INVENT.
005956
005960 SALIR.
005980     EXIT PROGRAM.
005990
006000 FIN.
006010     STOP RUN.
006011 LEER-GRUPO.
006012     MOVE LLAVE-GRUPO-FACT-W (I) TO LLAVE-GRUPO.
006013
006014     READ ARCHIVO-GRUPOS WITH NO LOCK
006015          INVALID KEY
006016                  MOVE C-COSTO-FAC TO C-COSTO-GRUPO
006019     END-READ.
006020     MOVE C-COSTO-GRUPO TO COSTO-INV.
006023
006024
006030 CALCULAR-SALDO-ACTUAL.
006040     IF DIA-SDO-W = 1
006050        ADD  ACUM-ENT-CANT (32)    TO SDO-ACT-CANT-W SDO-INI-CANT-W
006060        ADD  ACUM-ENT-VLR  (32)    TO SDO-ACT-VLR-W  SDO-INI-VLR-W
006070        ADD  DEP-ENT-VLR   (32)    TO SDO-ACT-DEP-W
006080        ADD  INF-ENT-VLR   (32)    TO SDO-ACT-INF-W
006090        ADD  INFD-ENT-VLR   (32)   TO SDO-ACT-INFD-W 
006100     END-IF
006110
006120     ADD ACUM-ENT-CANT (DIA-SDO-W) TO SDO-AC-CANT-ENT-W SDO-ACT-CANT-W
006130     ADD ACUM-ENT-VLR  (DIA-SDO-W) TO SDO-AC-VLR-ENT-W  SDO-ACT-VLR-W
006140     ADD ACUM-SAL-CANT (DIA-SDO-W) TO SDO-AC-CANT-SAL-W SDO-ACT-CANT-W
006150     ADD ACUM-SAL-VLR  (DIA-SDO-W) TO SDO-AC-VLR-SAL-W  SDO-ACT-VLR-W
006160     ADD DEP-ENT-VLR   (DIA-SDO-W) TO SDO-ACT-DEP-W 
006170     ADD INF-ENT-VLR   (DIA-SDO-W) TO SDO-ACT-INF-W
006180     ADD INFD-ENT-VLR  (DIA-SDO-W) TO SDO-ACT-INFD-W.
006220
