000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. INV020.
000030*   FACTURACION - CONTABILIZA UNA FACTURA BOMBAS.
000040
000050 ENVIRONMENT     DIVISION.
000060 INPUT-OUTPUT SECTION.
000070 FILE-CONTROL.
000080
000090 COPY "P:\PROG\PROYECT\FUENTES\FS-TERCE.CBL".
000100 COPY "P:\PROG\PROYECT\FUENTES\FS-MAEST.CBL".
000110 COPY "P:\PROG\PROYECT\FUENTES\FS-FACTURA.CBL".
000120 COPY "P:\PROG\PROYECT\FUENTES\FS-ARTIC.CBL". 
000130 COPY "P:\PROG\PROYECT\FUENTES\FS-MOVIM.CBL".
000140 COPY "P:\PROG\PROYECT\FUENTES\FS-FACTURA2.CBL".
000150 
000160     SELECT REGCONT LOCK MODE IS AUTOMATIC
000170            ASSIGN NOM-FEC-LNK
000180            FILE STATUS OTR-STAT.
000190     
000200     SELECT ARCHIVO-USUARIOS LOCK MODE IS AUTOMATIC
000210            ASSIGN NOM-USU-W
000220            ORGANIZATION IS INDEXED
000230            ACCESS MODE IS DYNAMIC;
000240            RECORD KEY IS NOMBRE-USU
000250            ALTERNATE RECORD KEY IS CTL-USU     WITH DUPLICATES
000260            ALTERNATE RECORD KEY IS CLAVE-USU   WITH DUPLICATES
000270            ALTERNATE RECORD KEY IS CLAVE-2-USU WITH DUPLICATES
000280            FILE STATUS IS OTR-STAT.
000290
000300     SELECT ARCHIVO-SOBRETASAS LOCK MODE IS AUTOMATIC
000310            ASSIGN NOM-SOBRE-LNK
000320            ORGANIZATION INDEXED;
000330            ACCESS MODE  DYNAMIC;
000340            RECORD KEY ART-SOBRE
000350            FILE STATUS IS OTR-STAT.
000360
000370 DATA DIVISION.
000380 FILE SECTION.
000390 COPY "P:\PROG\PROYECT\FUENTES\FD-USUAR.CBL".
000400 COPY "P:\PROG\PROYECT\FUENTES\FD-TERCE.CBL".
000410 COPY "P:\PROG\PROYECT\FUENTES\FD-MAEST.CBL".
000420 COPY "P:\PROG\PROYECT\FUENTES\FD-FACTURA.CBL".
000430 COPY "P:\PROG\PROYECT\FUENTES\FD-FACTURA2.CBL".
000440 COPY "P:\PROG\PROYECT\FUENTES\FD-ARTIC.CBL".
000450 COPY "P:\PROG\PROYECT\FUENTES\FD-FECHA.CBL".
000460 COPY "P:\PROG\PROYECT\FUENTES\FD-MOVIM.CBL".
000470 COPY "P:\PROG\PROYECT\FUENTES\FD-SOBRE.CBL".
000480
000490 WORKING-STORAGE SECTION.
000500 COPY "P:\PROG\PROYECT\FUENTES\WEB-CARAC.CBL".
000510
000520 01  NOM-FACT2-LNK                         PIC X(70).
000530 01  NOM-SOBRE-LNK                         PIC X(70).
000540 01  SW9                                   PIC 9.
000550 01  LLAVE-W                               PIC X(9).
000560 01  SW-TRANSP                             PIC X.
000570 01  COMP-CTL                              PIC 9(6).
000580 01  SW-5G                                 PIC 9.
000590 01  DESCRIP-TER-FACT                      PIC X(50).
000600 01  MAY-DEUD                              PIC X(4).
000610 01  ITEM                                  PIC 9(3).
000620 01  COSTO-W                               PIC X(4).
000630 01  RET-IVA-W                             PIC S9(12).
000640 01  RET-ICA-W                             PIC S9(12).
000650 01  CTA-DEBITO                            PIC X(11).
000660 01  PORC-RET-W                            PIC 99V99.
000670 01  TOT-TRANSP-W                          PIC S9(12)V99.
000680 01  SW-CTA                                PIC 9.
000690 01  ACT-W                                 PIC XX.
000700 01  DIR-CAJ-W                             PIC X(30).
000710 01  NETO-W                                PIC S9(9)V99.
000720 01  MES-TMP                               PIC X(3).
000730
000740
000750 01  LOCAL-MOV-W.
000760     02 LOCAL1-MOV-W                       PIC 9(3).
000770     02 LOCAL2-MOV-W                       PIC 99.
000780
000790 01  AUX-EDIT.
000800     02 AUX1-EDIT                          PIC XX.
000810     02 AUX2-EDIT                          PIC X.
000820     02 AUX3-EDIT                          PIC XX.
000830
000840 01  FECHA-SIG-W.
000850     02 SIG-W                              PIC 99.
000860     02 FECHA-W.           
000870        05 ANO-W                           PIC 99.
000880        05 MES-W                           PIC 99.
000890        05 DIA-W                           PIC 99.
000900
000910 01  COD-TER-1.
000920     02 DESCRIP-TER-1                      PIC XX.
000930     02 NUMERO-TER-1                       PIC 999.
000940
000950 01  COD-TER-2.
000960     02 DESCRIP-TER-2                      PIC XXX.
000970     02 NUMERO-TER-2                       PIC 99.
000980
000990
001000 01  NOMBRE-MOV.
001010	   02 FILLER                             PIC X(3)  VALUE "../".
001020	   02 MES-ARCHIVO                        PIC X(3)  VALUE SPACES.
001030	   02 FILLER                             PIC X(15) VALUE "/SC-ARCHMOV.DAT".
001040
001050 01  TABLA-COD.
001060     02 TABLA-CTAS OCCURS 999.
001070        05 COSTO-TAB                       PIC X(4).
001080        05 CTA-TAB                         PIC X(11).
001090        05 VLR-TAB                         PIC S9(12)V99.
001100        05 NIT-TAB                         PIC 9(10).
001110
001120 01  FOMULARIO-DLL.
001130     02 NOM-DLL-W                          PIC X(260).
001140     02 FORM-DLL-W                         PIC X(14).
001150     02 STAT-DLL-W                         PIC S9(9) COMP-5 VALUE 0.
001160
001170 01  VARIABLES.
001180     02 SW0                                PIC 9.
001190     02 SEC-NUM                            PIC 99.
001200     02 VALOR-TOTAL                        PIC S9(9)V99.
001210     02 VALOR-BRUTO                        PIC S9(9).
001220     02 VALOR-TEM                          PIC S9(9).
001230     02 FACTOR-DCTO                        PIC 99V9(4).
001240     02 VALOR-BASE                         PIC S9(9).
001250     02 VALOR-SERV                         PIC S9(9).
001260     02 VALOR-ICAV                         PIC S9(9)V99.
001270     02 VALOR-BOLSA                        PIC 9(9).
001280     02  VALOR-SOBRE-T                     PIC 9(9).
001290     02  VALOR-GLOBAL-T                    PIC 9(9).
001300     02 BASE-RET.
001310        05 AUTORET-10                      PIC S9(11)V99.
001320        05 AUTORET-15                      PIC S9(11)V99.
001330        05 AUTORET-20                      PIC S9(11)V99.
001340        05 AUTORET-35                      PIC S9(11)V99.
001350        05 AUTORET-40                      PIC S9(11)V99.
001360        05 AUTORET-60                      PIC S9(11)V99.
001370        05 AUTORET-70                      PIC S9(11)V99.
001380        05 AUTORET-100                     PIC S9(11)V99.
001390        05 AUTORET-110                     PIC S9(11)V99.
001400        05 BASE-AUTORET-W                  PIC S9(11)V99.
001410        05 EXCLUIR-RET-W                   PIC S9(11)V99.
001420        05 AUTORET-W                       PIC S9(11).
001430        05 AUTORET-CREE-W                  PIC S9(11).
001440        05 LIMI-AUTORET-W                  PIC S9(10).
001450        05 AUTORET-PORC                    PIC 99V9(3).
001460        05 AUXIL-RET-W                     PIC X(5).
001470
001480
001490 01  TAB-FACT-W.
001500     02 TABLA-FACT-W OCCURS 999.
001510        03 LLAVE-ART-FACT-W.
001520           05 ALMACEN-FACT-W.
001530              09 TIPO-ALM-FACT-W.
001540                 11 ALM1-FACT-W        PIC X.
001550                 11 ALM2-FACT-W        PIC X.
001560              09 ALM3-FACT-W           PIC XXX.
001570           05 COD-ART-FACT-W.
001580              09 LLAVE-GRUPO-FACT-W.
001590                 10 TIPO-ART-FACT-W    PIC 9.
001600                 10 GRUPO-FACT-W.
001610                    15 GRP1-FACT-W     PIC X.
001620                    15 GRP2-FACT-W     PIC X.
001630              09 NUMERO-ART-FACT-W.
001640                 10 NRO1-ART-FACT-W    PIC XX.
001650                 10 NRO2-ART-FACT-W    PIC X(11).
001660              09 CLASE-ART-FACT-W      PIC XX.
001670           05 COD-LOTE-FACT-W.
001680              09 ANO-CRE-LOTE-FACT-W     PIC 9(4).
001690              09 CONSEC-LOTE-FACT-W      PIC 9(5).
001700        03 CANTIDAD-FACT-W             PIC S9(12)V99.
001710        03 VALOR-FACT-W                PIC S9(12)V99.
001720        03 COSTO-FACT-W                PIC S9(9).
001730        03 BRUTO-FACT-W                PIC S9(12)V99.
001740        03 IVA-FACT-W                  PIC S9(12)V99.
001750        03 CONSUMO-FACT-W              PIC S9(12)V99.
001760        03 TIPO-DOC-FACT-W             PIC X.
001770        03 SUC-DOC-FACT-W              PIC X.
001780        03 NRO-DOC-FACT-W              PIC 9(6).
001790        03 LISTA-ACOMPA-FACT-W.
001800           05 ACOMPA1-FACT-W           PIC 99.
001810           05 ACOMPA2-FACT-W           PIC 99.
001820        03 LIST-PREC-FACT-W            PIC X.
001830        03 CANT-FACT-FACT-W            PIC S9(8)V99.
001840        03 VALOR-FACT-FACT-W           PIC S9(12)V99.  
001850        03 DCTO-EXT-FACT-W             PIC S9(3)V99.
001860        03 PENDIENTE-FACT-W            PIC X.
001870        03 EXT-DESCRIP-FACT-W          PIC X(86).
001880        03 FILLER                      PIC X(5000).
001890
001900 LINKAGE SECTION.
001910 01 ADMIN-LNK           PIC X(4).
001920 01 NRO-FACT-020-LNK    PIC 9(6).
001930 01 TIPO-020-LNK.
001940    02  ITEM-020-LNK    PIC 9.
001950    02  PREF-020-LNK    PIC XX.
001960 01 DIRECTORIO-W        PIC X(35).
001970 01 NOMBRE-LNK          PIC X(30).
001980 01 INVALID-INV         PIC 99. 
001990 01 MENSAJE-LNK         PIC X(100).
002000 
002010 PROCEDURE DIVISION USING ADMIN-LNK NRO-FACT-020-LNK TIPO-020-LNK DIRECTORIO-W NOMBRE-LNK INVALID-INV MENSAJE-LNK.
002020
002030 DECLARATIVES.
002040 I-O-TEST SECTION.
002050     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUARIOS.
002060
002070 ESCR-EXCEPTIONES.
002080     IF OTR-STAT = "00"
002090        CONTINUE      
002100     ELSE
002110        MOVE OTR-STAT             TO INVALID-INV    
002120        MOVE NOM-USU-W   TO MENSAJE-LNK   
002130        GO TO SALIR     
002140     END-IF.
002150
002160 I-O-TEST SECTION.
002170     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-TERCEROS.
002180
002190 ESCR-EXCEPTIONES.
002200     IF OTR-STAT = "00"
002210        CONTINUE      
002220     ELSE
002230        MOVE OTR-STAT             TO INVALID-INV       
002240        MOVE "ARCHIVO-TERCEROS"   TO MENSAJE-LNK   
002250        GO TO SALIR     
002260     END-IF.
002270
002280 I-O-TEST SECTION.
002290     USE AFTER EXCEPTION PROCEDURE ON MOVIMIENTO-DIARIO.
002300
002310 ESCR-EXCEPTIONES.
002320     IF OTR-STAT = "00"
002330        CONTINUE      
002340     ELSE
002350        MOVE OTR-STAT             TO INVALID-INV      
002360        MOVE "ARCHIVO-MOVIMIENTO" TO MENSAJE-LNK    
002370        GO TO SALIR     
002380     END-IF.
002390
002400 I-O-TEST SECTION.
002410     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-FACTURAS.
002420
002430 ESCR-EXCEPTIONES.
002440     IF OTR-STAT = "00" 
002450        CONTINUE      
002460     ELSE
002470        MOVE OTR-STAT             TO INVALID-INV  
002480        MOVE "ARCHIVO-FACTURAS"   TO MENSAJE-LNK        
002490        GO TO SALIR    
002500     END-IF.
002501
002502
002503 I-O-TEST SECTION.
002504     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-FACTURAS2.
002505
002506 ESCR-EXCEPTIONES.
002507     IF OTR-STAT = "00" 
002508        CONTINUE      
002509     ELSE
002510        MOVE OTR-STAT             TO INVALID-INV  
002511        MOVE "ARCHIVO-FACTURAS2"  TO MENSAJE-LNK        
002512        GO TO SALIR    
002513     END-IF.
002514
002520 I-O-TEST SECTION.
002530     USE AFTER EXCEPTION PROCEDURE ON MAESTRO-ARTICULOS.
002540
002550 ESCR-EXCEPTIONES.
002560     IF OTR-STAT = "00"
002570        CONTINUE      
002580     ELSE
002590        MOVE OTR-STAT             TO INVALID-INV 
002600        MOVE "MAESTRO-ARTICULOS"  TO MENSAJE-LNK         
002610        GO TO SALIR     
002620     END-IF.
002630
002640 I-O-TEST SECTION.
002650     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-MAESTROS.
002660
002670 ESCR-EXCEPTIONES.
002680     IF OTR-STAT = "00"
002690        CONTINUE      
002700     ELSE
002710        MOVE OTR-STAT             TO INVALID-INV     
002720        MOVE "ARCHIVO-MAESTROS"   TO MENSAJE-LNK     
002730        GO TO SALIR     
002740     END-IF.
002750
002760 I-O-TEST SECTION.
002770     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SOBRETASAS.
002780
002790 ESCR-EXCEPTIONES.
002800     IF OTR-STAT = "00"
002810        CONTINUE      
002820     ELSE
002830        MOVE OTR-STAT             TO INVALID-INV     
002840        MOVE "ARCHIVO-SOBRETASAS" TO MENSAJE-LNK     
002850        GO TO SALIR     
002860     END-IF.
002870
002880 I-O-TEST SECTION.
002890     USE AFTER EXCEPTION PROCEDURE ON REGCONT.
002900
002910 ESCR-EXCEPTIONES.
002920     IF OTR-STAT = "00"
002930        CONTINUE      
002940     ELSE
002950        MOVE OTR-STAT             TO INVALID-INV     
002960        MOVE NOM-FEC-LNK          TO MENSAJE-LNK     
002970        GO TO SALIR     
002980     END-IF.
002990
003000 END DECLARATIVES.
003010 PROCEDURAL SECTION.
003020
003030 ACOMODAR-NOMBRES.
003040     MOVE DIRECTORIO-W TO DIR-CAJ-W.
003050     MOVE FUNCTION CURRENT-DATE TO FECHA-SIG-W
003060
003070     INSPECT DIR-CAJ-W REPLACING FIRST "\ENE "  BY    "     ".
003080     INSPECT DIR-CAJ-W REPLACING FIRST "\FEB "  BY    "     ".
003090     INSPECT DIR-CAJ-W REPLACING FIRST "\MAR "  BY    "     ".
003100     INSPECT DIR-CAJ-W REPLACING FIRST "\ABR "  BY    "     ".
003110     INSPECT DIR-CAJ-W REPLACING FIRST "\MAY "  BY    "     ".
003120     INSPECT DIR-CAJ-W REPLACING FIRST "\JUN "  BY    "     ".
003130     INSPECT DIR-CAJ-W REPLACING FIRST "\JUL "  BY    "     ".
003140     INSPECT DIR-CAJ-W REPLACING FIRST "\AGT "  BY    "     ".
003150     INSPECT DIR-CAJ-W REPLACING FIRST "\SEP "  BY    "     ".
003160     INSPECT DIR-CAJ-W REPLACING FIRST "\OCT "  BY    "     ".
003170     INSPECT DIR-CAJ-W REPLACING FIRST "\NOV "  BY    "     ".
003180     INSPECT DIR-CAJ-W REPLACING FIRST "\DIC "  BY    "     ".
003190     INSPECT DIR-CAJ-W REPLACING FIRST "\CIE "  BY    "     ".
003200     
003210     EVALUATE MES-W
003220        WHEN 01   MOVE "ENE"   TO MES-TMP
003230        WHEN 02   MOVE "FEB"   TO MES-TMP
003240        WHEN 03   MOVE "MAR"   TO MES-TMP
003250        WHEN 04   MOVE "ABR"   TO MES-TMP
003260        WHEN 05   MOVE "MAY"   TO MES-TMP
003270        WHEN 06   MOVE "JUN"   TO MES-TMP
003280        WHEN 07   MOVE "JUL"   TO MES-TMP
003290        WHEN 08   MOVE "AGT"   TO MES-TMP
003300        WHEN 09   MOVE "SEP"   TO MES-TMP
003310        WHEN 10   MOVE "OCT"   TO MES-TMP
003320        WHEN 11   MOVE "NOV"   TO MES-TMP
003330        WHEN 12   MOVE "DIC"   TO MES-TMP
003340     END-EVALUATE
003350     INITIALIZE FECHA-SIG-W
003360
003370     MOVE NOMBRE-LNK TO NOM-USU-W.
003380
003390     INSPECT NOM-USU-W REPLACING FIRST " " BY "\"
003400
003410     INSPECT NOM-USU-W REPLACING FIRST "                              "
003420                                    BY DIR-CAJ-W
003430
003440     INSPECT NOM-USU-W REPLACING FIRST "                       "     
003450                                    BY "\CONTROL\SC-ARCHUSU.DAT".
003460     MOVE NOM-USU-W TO NOM-TER-LNK NOM-SOBRE-LNK
003470     INSPECT NOM-TER-LNK REPLACING FIRST "SC-ARCHUSU.DAT"
003480                                      BY "SC-ARCHTER.DAT".
003490     MOVE NOM-USU-W TO NOM-ART-LNK
003500     INSPECT NOM-ART-LNK REPLACING FIRST "SC-ARCHUSU.DAT"
003510                                      BY "SC-MAESART.DAT".
003520     MOVE NOM-USU-W TO NOM-GRP-LNK
003530     INSPECT NOM-GRP-LNK REPLACING FIRST "SC-ARCHUSU.DAT "
003540                                      BY "SC-GRUPOINV.DAT".
003550     MOVE NOM-USU-W TO NOM-VENDE-LNK
003560     INSPECT NOM-VENDE-LNK REPLACING FIRST "SC-ARCHUSU.DAT"
003570                                        BY "SC-ARCHVEN.DAT".
003580     MOVE NOM-USU-W TO NOM-MAE-LNK
003590     INSPECT NOM-MAE-LNK REPLACING FIRST "SC-ARCHUSU.DAT"
003600                                      BY "SC-ARCHMAE.DAT".
003610
003620     INSPECT NOM-SOBRE-LNK REPLACING FIRST "SC-ARCHUSU.DAT"
003630                                        BY "SC-ARCHSOB.DAT".
003640
003650     MOVE NOMBRE-LNK TO NOM-MOV
003660
003670     INSPECT NOM-MOV REPLACING FIRST " " BY "\"
003680
003690     INSPECT NOM-MOV REPLACING FIRST "                                   "
003700                                  BY DIRECTORIO-W
003710
003720     INSPECT NOM-MOV REPLACING FIRST " " BY "\" 
003730
003740     INSPECT NOM-MOV REPLACING FIRST "   " BY MES-TMP
003750
003760     INSPECT NOM-MOV REPLACING FIRST "               "
003770                                  BY "\SC-ARCHMOV.DAT".
003780     MOVE NOM-MOV TO NOM-FEC-LNK 
003790
003800     INSPECT NOM-FEC-LNK REPLACING FIRST "SC-ARCHMOV.DAT"
003810                                      BY "SC-REGCONT.DAT".
003820                     
003830 LEER-USUARIO.
003840     OPEN INPUT ARCHIVO-USUARIOS.
003850     READ ARCHIVO-USUARIOS NEXT WITH NO LOCK AT END 
003860          CLOSE ARCHIVO-USUARIOS
003870     END-READ.
003880     
003890
003900     OPEN INPUT REGCONT.
003910     READ REGCONT WITH NO LOCK AT END 
003920          CLOSE REGCONT
003930     END-READ.
003940     
003950         
003960 ASIGNAR-NOMBRE.
003970     MOVE NOM-USU-W TO NOM-FACT-LNK NOM-FACT2-LNK
003980
003990     INSPECT NOM-FACT-LNK REPLACING FIRST "SC-ARCHUSU.DAT    "
004000                                       BY "SC-ARCHFACT-01.DAT".
004010
004020     INSPECT NOM-FACT2-LNK REPLACING FIRST "SC-ARCHUSU.DAT      "
004030                                        BY "SC-ARCHEXFACT-01.DAT".
004040
004050     INITIALIZE VARIABLES.
004060
004070 ABRIR-ARCHIVOS.
004080
004090     IF ITEM-020-LNK > 1 AND < 7
004100        OPEN INPUT ARCHIVO-SOBRETASAS
004110     END-IF
004120
004130
004140     OPEN INPUT ARCHIVO-FACTURAS
004150                ARCHIVO-FACTURAS2
004160                ARCHIVO-TERCEROS
004170                MAESTRO-ARTICULOS.
004180
004190 LEER-FACTURA.
004200     MOVE 0 TO SW9
004210     
004220     MOVE NRO-FACT-020-LNK TO NRO-FAC COMP-CTL.
004230     READ ARCHIVO-FACTURAS WITH NO LOCK
004240          INVALID KEY      MOVE 99 TO INVALID-INV 
004250                           MOVE "NO EXISTE LA FACTURA!" TO MENSAJE-LNK      
004260                           GO TO CERRAR-ARCHIVOS       
004270     END-READ.
004280           
004290     IF ANO-FAC = ANO-ALFA
004300        CONTINUE
004310     ELSE
004320        MOVE 99 TO INVALID-INV       
004330        MOVE "FACTURA DE OTRO ANO"  TO MENSAJE-LNK
004340        INSPECT MENSAJE-LNK REPLACING FIRST "    " BY ANO-ALFA
004350        GO TO CERRAR-ARCHIVOS
004360     END-IF.
004370        
004380
004390 LEER-TERCERO.
004400     MOVE NIT-FAC TO COD-TER.
004410   
004420     READ ARCHIVO-TERCEROS WITH NO LOCK
004430          INVALID KEY  MOVE ALL "*" TO DESCRIP-TER
004440     END-READ
004450
004460     MOVE DESCRIP-TER TO DESCRIP-TER-1 DESCRIP-TER-2.
004470     MOVE COD-TER     TO NUMERO-TER-1  NUMERO-TER-2.
004480
004490     EVALUATE PUC-USU
004500         WHEN 1 MOVE "1305"        TO MAY-DEUD
004510         WHEN 2 MOVE "1505"        TO MAY-DEUD
004520         WHEN 4 EVALUATE NIT-USU
004530                    WHEN 800136258   MOVE "1408" TO MAY-DEUD
004540                    WHEN OTHER       MOVE "1470" TO MAY-DEUD
004550                END-EVALUATE
004560     END-EVALUATE.
004570
004580     INITIALIZE TABLA-COD.
004590     PERFORM TOTAL.
004600     GO TO DATOS-MOVIMIENTO.
004610
004620 TOTAL.
004630     INITIALIZE VALOR-BRUTO.
004640     PERFORM SUMAR-VALORES VARYING I FROM 1 BY 1
004650                           UNTIL I > ITEM-MAX-USU.
004660
004670     IF VALOR-DES-FAC > VALOR-BRUTO
004680        MOVE VALOR-BRUTO  TO VALOR-DES-FAC
004690     END-IF
004700
004710     IF  AUTORET-USU   = "S"
004720     OR  (RETENEDOR-USU = "S" AND FECHA-FAC > 20130900)
004730         PERFORM DEPURAR-RETENCION
004740     ELSE
004750         MOVE 0 TO AUTORET-W
004760     END-IF
004770
004780     COMPUTE VALOR-TOTAL =  VALOR-BRUTO - VALOR-DES-FAC
004790                         +  VALOR-IVA-FAC.
004800
004810     IF VALOR-BRUTO = 0
004820        INITIALIZE FACTOR-DCTO
004830     ELSE
004840        COMPUTE FACTOR-DCTO ROUNDED =  1 - (VALOR-DES-FAC / VALOR-BRUTO)
004850     END-IF
004860
004870     PERFORM LLENAR-TABLA-COD VARYING I FROM 1 BY 1
004880                                UNTIL I > ITEM-MAX-USU.
004890
004900     IF (NIT-USU = 844002859 OR 800160895 OR 844003380)
004910        CONTINUE
004920     ELSE 
004930        PERFORM AJUSTAR-VALOR
004940     END-IF.
004950     
004960 SUMAR-VALORES.
004970     MOVE NRO-FAC TO NRO-FAC2
004980     MOVE I       TO ITEM-FAC2
004990     MOVE 0       TO SW-FIN
005000
005010     READ ARCHIVO-FACTURAS2 WITH NO LOCK
005020          INVALID KEY
005030                  MOVE 1 TO SW-FIN
005040          NOT INVALID KEY  IF CANTIDAD-FAC2 = 0
005050                              INITIALIZE TABLA-FACT-W(I)
005060                           ELSE
005070                              MOVE LLAVE-ART-FAC2    TO LLAVE-ART-FACT-W(I)
005080                              MOVE CANTIDAD-FAC2     TO CANTIDAD-FACT-W(I)
005090                              MOVE VALOR-FAC2        TO VALOR-FACT-W(I)
005100                              MOVE COSTO-FAC2        TO COSTO-FACT-W(I)
005110                              MOVE BRUTO-FAC2        TO BRUTO-FACT-W(I) 
005120                              MOVE IVA-FAC2          TO IVA-FACT-W(I) 
005130                              MOVE CONSUMO-FAC2      TO CONSUMO-FACT-W(I) 
005140                              MOVE TIPO-DOC-FAC2     TO TIPO-DOC-FACT-W(I) 
005150                              MOVE SUC-DOC-FAC2      TO SUC-DOC-FACT-W(I) 
005160                              MOVE NRO-DOC-FAC2      TO NRO-DOC-FACT-W(I) 
005170                              MOVE LISTA-ACOMPA-FAC2 TO LISTA-ACOMPA-FACT-W(I) 
005180                              MOVE LIST-PREC-FAC2    TO LIST-PREC-FACT-W(I) 
005190                              MOVE CANT-FACT-FAC2    TO CANT-FACT-FACT-W(I) 
005200                              MOVE VALOR-FACT-FAC2   TO VALOR-FACT-FACT-W(I) 
005210                              MOVE DCTO-EXT-FAC2     TO DCTO-EXT-FACT-W(I) 
005220                              MOVE PENDIENTE-FAC2    TO PENDIENTE-FACT-W(I) 
005230                              MOVE EXT-DESCRIP-FAC2  TO EXT-DESCRIP-FACT-W(I) 
005240                           END-IF
005250     END-READ
005260
005270     IF SW-FIN = 1
005280        CONTINUE
005290     ELSE
005300        IF NIT-USU = 30273 AND LLAVE-GRUPO-FAC2 = "01"
005310           INITIALIZE DATOS-FAC2
005320        END-IF
005330
005340        IF ALMACEN-FAC2 = "SIN99"
005350           INITIALIZE DATOS-FAC2
005360        ELSE
005370           ADD VALOR-FAC2  TO VALOR-BRUTO
005380        END-IF
005390
005400        IF AUTORET-ART IS ZERO OR AUTORET-ART IS NOT NUMERIC
005410           IF LLAVE-GRUPO-FAC2 = "9"
005420              MOVE 4.0 TO AUTORET-ART
005430           ELSE
005440              MOVE 3.5 TO AUTORET-ART
005450           END-IF
005460        END-IF
005470
005480        EVALUATE AUTORET-ART
005490           WHEN  1.0  ADD VALOR-FAC2 TO AUTORET-10
005500           WHEN  1.5  ADD VALOR-FAC2 TO AUTORET-15
005510           WHEN  2.0  ADD VALOR-FAC2 TO AUTORET-20
005520           WHEN  3.0  ADD VALOR-FAC2 TO AUTORET-35
005530           WHEN  3.5  ADD VALOR-FAC2 TO AUTORET-35
005540           WHEN  4.0  ADD VALOR-FAC2 TO AUTORET-40
005550           WHEN  6.0  ADD VALOR-FAC2 TO AUTORET-60
005560           WHEN  7.0  ADD VALOR-FAC2 TO AUTORET-70
005570           WHEN 10.0  ADD VALOR-FAC2 TO AUTORET-100
005580           WHEN 11.0  ADD VALOR-FAC2 TO AUTORET-110
005590        END-EVALUATE
005600
005610        IF COD-ART-FAC2 = "099SEGURO"
005620           ADD VALOR-FAC2 TO EXCLUIR-RET-W
005630        END-IF
005640     END-IF.
005650
005660 LLENAR-TABLA-COD.
005670     IF  VALOR-FACT-W (I)  IS NOT ZERO
005680         PERFORM LEER-ARTICULO
005690     END-IF
005700
005710     IF (NIT-USU = 844002859 OR 800160895 OR 844003380)
005720        AND I = 1 
005730        AND (GRUPO-FACT-W (I) = 90 OR 99)
005740        AND  VALOR-FACT-W (I) > ZERO
005750             PERFORM LLENAR-TABLA-PROP VARYING J FROM 1 BY 1
005760                                                UNTIL J > 50
005770     END-IF.
005780
005790 LEER-ARTICULO.
005800     MOVE COD-ART-FACT-W (I)    TO COD-ART.
005810
005820     READ MAESTRO-ARTICULOS WITH NO LOCK
005830          INVALID KEY  MOVE SPACES TO CTA-ART
005840     END-READ
005850
005860     IF ITEM-020-LNK > 1 AND < 7 AND NIT-USU IS NOT = 900127676
005870        PERFORM LEER-SOBRETASA
005880     ELSE 
005890         INITIALIZE VALOR-SOBRE-T VALOR-GLOBAL-SOBRE
005900     END-IF
005910
005920     IF LLAVE-GRUPO-FACT-W (I) = 099
005930        INITIALIZE VALOR-SOBRE-T VALOR-GLOBAL-T
005940     END-IF
005950
005960     SUBTRACT VALOR-SOBRE-T FROM VALOR-FACT-W (I)
005970     SUBTRACT VALOR-GLOBAL-T  FROM VALOR-FACT-W (I)
005980
005990     IF CTA-ART = SPACES
006000        EVALUATE PUC-USU
006010            WHEN 1 MOVE "41350100001"   TO CTA-ART
006020            WHEN 2 MOVE "41050100001"   TO CTA-ART
006030            WHEN 3 MOVE "41350100001"   TO CTA-ART
006040            WHEN 4 MOVE "42106000001"   TO CTA-ART
006050        END-EVALUATE
006060     END-IF
006070
006080     IF  (NIT-USU = 844002859 OR 800160895 OR 844003380)
006090     AND (GRUPO-FACT-W (I) = 90 OR 99)
006100         CONTINUE
006110     ELSE
006120        MOVE 0 TO SW-CTA
006130        PERFORM BUSCAR-TABLA-COD VARYING J FROM 1 BY 1
006140                            UNTIL J > 20 OR SW-CTA = 1
006150
006160        IF SW-CTA = 0
006170           PERFORM UBICAR-TABLA-COD VARYING J FROM 1 BY 1
006180                               UNTIL J > 20 OR SW-CTA = 1
006190        END-IF
006200     END-IF.
006210
006220
006230 BUSCAR-TABLA-COD.
006240     IF  LLAVE-GRUPO-FACT-W (I) = "099"
006250     AND NUMERO-ART-FACT-W  (I) = "90001" OR "ICAB" OR "ICAV"
006260         MOVE VALOR-ICAV TO VALOR-TEM
006270     ELSE
006280         COMPUTE VALOR-TEM ROUNDED = VALOR-FACT-W (I) * FACTOR-DCTO
006290     END-IF.
006300
006310     IF CTA-ART = CTA-TAB (J)
006320        MOVE 1 TO SW-CTA
006330        ADD  VALOR-TEM TO VLR-TAB (J)
006340      END-IF.
006350
006360 UBICAR-TABLA-COD.
006370     IF  LLAVE-GRUPO-FACT-W (I) = "099"
006380     AND NUMERO-ART-FACT-W  (I) = "90001" OR "ICAB" OR "ICAV"
006390         MOVE VALOR-ICAV TO VALOR-TEM
006400     ELSE
006410         COMPUTE VALOR-TEM ROUNDED =  VALOR-FACT-W (I) * FACTOR-DCTO
006420     END-IF.
006430
006440     IF CTA-TAB (J) = SPACES
006450        MOVE CTA-ART   TO CTA-TAB (J)
006460        MOVE VALOR-TEM TO VLR-TAB (J)
006470        MOVE 1 TO SW-CTA
006480     END-IF.
006490
006500 AJUSTAR-VALOR.
006510     COMPUTE VLR-TAB (1) = VALOR-BRUTO
006520                         - VALOR-DES-FAC
006530                         - VLR-TAB (02) - VLR-TAB (03)
006540                         - VLR-TAB (04) - VLR-TAB (05)
006550                         - VLR-TAB (06) - VLR-TAB (07)
006560                         - VLR-TAB (08) - VLR-TAB (09)
006570                         - VLR-TAB (10) - VLR-TAB (11)
006580                         - VLR-TAB (12) - VLR-TAB (13)
006590                         - VLR-TAB (14) - VLR-TAB (15)
006600                         - VLR-TAB (16) - VLR-TAB (17)
006610                         - VLR-TAB (18) - VLR-TAB (19)
006620                         - VLR-TAB (20).
006630
006640 DATOS-MOVIMIENTO.
006650     EVALUATE MES-FAC
006660       WHEN 01 MOVE "ene" TO MES-ARCHIVO
006670       WHEN 02 MOVE "feb" TO MES-ARCHIVO
006680       WHEN 03 MOVE "mar" TO MES-ARCHIVO
006690       WHEN 04 MOVE "abr" TO MES-ARCHIVO
006700       WHEN 05 MOVE "may" TO MES-ARCHIVO
006710       WHEN 06 MOVE "jun" TO MES-ARCHIVO
006720       WHEN 07 MOVE "jul" TO MES-ARCHIVO
006730       WHEN 08 MOVE "agt" TO MES-ARCHIVO
006740       WHEN 09 MOVE "sep" TO MES-ARCHIVO
006750       WHEN 10 MOVE "oct" TO MES-ARCHIVO
006760       WHEN 11 MOVE "nov" TO MES-ARCHIVO
006770       WHEN 12 MOVE "dic" TO MES-ARCHIVO
006780     END-EVALUATE.
006790
006800     MOVE "F"             TO LOTE1-MOV
006810     MOVE ITEM-020-LNK    TO LOTE2-MOV
006820
006830     MOVE COMP-CTL        TO COMPROB-MOV.
006840     MOVE LLAVE-COMP-MOV  TO LLAVE-W.
006850
006860     OPEN I-O MOVIMIENTO-DIARIO.
006870
006880 BUSCAR-MOVIMIENTO.
006890     START MOVIMIENTO-DIARIO KEY = LLAVE-COMP-MOV
006900          INVALID KEY GO TO FIN-BORRAR-MOV
006910     END-START.
006920
006930 BORRAR-MOV.
006940     READ MOVIMIENTO-DIARIO NEXT WITH NO LOCK AT END
006950                           GO TO FIN-BORRAR-MOV.
006960 
006970     IF LLAVE-COMP-MOV IS NOT EQUAL TO LLAVE-W
006980        GO TO FIN-BORRAR-MOV
006990     END-IF
007000
007010     DELETE MOVIMIENTO-DIARIO.
007020     GO TO BORRAR-MOV.
007030
007040 FIN-BORRAR-MOV.
007050     CLOSE MOVIMIENTO-DIARIO.
007060     MOVE LLAVE-W          TO LLAVE-COMP-MOV
007070     MOVE NIT-FAC          TO ID-MOV
007080     MOVE "0000"           TO COSTO-MOV
007090     MOVE LOTE1-MOV        TO SUC-MOV
007100     MOVE NRO-FACT-020-LNK TO DOCUM-MOV
007110     MOVE FECHA-FAC        TO FECHA-SIG-W
007120     MOVE FECHA-W          TO FECHA-MOV
007130
007140     EVALUATE FORMA-PAGO-FAC
007150       WHEN 00 MOVE "ANTIC."  TO REFER-MOV
007160       WHEN 01 MOVE "CONTAD"  TO REFER-MOV
007170       WHEN 02 MOVE "CREDIT"  TO REFER-MOV
007180       WHEN 03 MOVE "CH.PF."  TO REFER-MOV
007190       WHEN 04 MOVE "LETRA "  TO REFER-MOV
007200       WHEN 05 MOVE "US DOL"  TO REFER-MOV
007210       WHEN 95 MOVE "T.CRED"  TO REFER-MOV
007220       WHEN 96 MOVE "T.DEB."  TO REFER-MOV
007230       WHEN 97 MOVE "C.CHEQ"  TO REFER-MOV
007240     END-EVALUATE.
007250
007260     MOVE DETALLE-FAC           TO DETALLE-MOV.
007270     MOVE FECHA-VENCE-FAC  (1)  TO FECHA-VENCE-MOV.
007280     MOVE ADMIN-ELAB-FAC        TO OPER-ELAB-MOV
007290     MOVE FECHA-ELAB-FAC        TO FECHA-ELAB-MOV.
007300
007310 REVISAR-CODIGO.
007320     PERFORM REGISTRO-MOVIMIENTO	VARYING I FROM 1 BY 1
007330                                    UNTIL I > 20.
007340
007350 IVA-1-MOV.
007360     IF COSTO-DEUD-USU = "S"
007370        MOVE C-COSTO-FAC     TO COSTO-MOV
007380     ELSE
007390        MOVE "00" TO COSTO-MOV
007400     END-IF
007410
007420     IF VALOR-IVA-1-FAC = 0
007430        GO TO IVA-2-MOV
007440     END-IF.
007450
007460     EVALUATE PUC-USU
007470         WHEN 1 MOVE "24080100001" TO CUENTA-MOV
007480         WHEN 2 MOVE "25100100001" TO CUENTA-MOV
007490         WHEN 3 MOVE "24080100001" TO CUENTA-MOV
007500         WHEN 4 MOVE "24450100001" TO CUENTA-MOV
007510     END-EVALUATE
007520
007530
007540     COMPUTE VALOR-MOV = VALOR-IVA-1-FAC * -1.
007550     MOVE 86 TO I
007560     PERFORM GRABAR-MOVIMIENTO.
007570
007580 IVA-2-MOV.
007590     IF VALOR-IVA-2-FAC = 0 
007600        GO TO IVA-3-MOV
007610     END-IF.
007620
007630     EVALUATE PUC-USU
007640         WHEN 1 MOVE "24080100020"    TO CUENTA-MOV
007650         WHEN 2 MOVE "25100100020"    TO CUENTA-MOV
007660         WHEN 3 MOVE "24080100020"    TO CUENTA-MOV
007670         WHEN 4 MOVE "24450100020"    TO CUENTA-MOV
007680     END-EVALUATE.
007690
007700     COMPUTE VALOR-MOV = VALOR-IVA-2-FAC * -1.
007710     MOVE 87 TO I
007720     PERFORM GRABAR-MOVIMIENTO.
007730
007740 IVA-3-MOV.
007750     IF VALOR-IVA-3-FAC = 0
007760        GO TO TOTAL-MOV
007770     END-IF.
007780
007790     EVALUATE PUC-USU
007800         WHEN 1 MOVE "24080100030"    TO CUENTA-MOV
007810         WHEN 2 MOVE "25100100030"    TO CUENTA-MOV
007820         WHEN 3 MOVE "24080100030"    TO CUENTA-MOV
007830         WHEN 4 MOVE "24450100030"    TO CUENTA-MOV
007840     END-EVALUATE
007850
007860     COMPUTE VALOR-MOV = VALOR-IVA-3-FAC * -1.
007870     MOVE 88 TO I.
007880     PERFORM GRABAR-MOVIMIENTO.
007890
007900 TOTAL-MOV.
007910     MOVE 91 TO I.
007920     EVALUATE FORMA-PAGO-FAC
007930         WHEN 00 MOVE "28050500005"    TO CUENTA-MOV
007940         WHEN 01 IF PUC-USU = 2 OR 4
007950                    MOVE "11050100001" TO CUENTA-MOV
007960                 ELSE
007970                    MOVE "11050500001" TO CUENTA-MOV
007980                    IF NIT-USU = 844003380
007990                       MOVE "00002"    TO LOCAL-MOV
008000                    END-IF
008010                 END-IF 
008020
008030                 IF SEPARA-CAJA-ALT = "S"
008040                    EVALUATE ITEM-020-LNK
008050                       WHEN 1 IF NIT-USU = 17318161 OR 822007669
008060                                 MOVE "00002"   TO LOCAL-MOV
008070                              ELSE
008080                                 MOVE "00001"   TO LOCAL-MOV
008090                              END-IF
008100                       WHEN 2 MOVE "00002" TO LOCAL-MOV
008110                       WHEN 3 MOVE "00003" TO LOCAL-MOV
008120                       WHEN 4 MOVE "00004" TO LOCAL-MOV
008130                       WHEN 5 MOVE "00005" TO LOCAL-MOV
008140                       WHEN 6 MOVE "00006" TO LOCAL-MOV
008150                       WHEN 7 MOVE "00007" TO LOCAL-MOV
008160                       WHEN 8 MOVE "00008" TO LOCAL-MOV
008170                       WHEN 9 MOVE "00009" TO LOCAL-MOV
008180                    END-EVALUATE
008190                 END-IF
008200         WHEN 02 MOVE MAY-DEUD         TO MAYOR-MOV
008210                 EVALUATE PUC-USU
008220                     WHEN 1 MOVE "05"      TO SCTA-MOV
008230                            PERFORM ASIGNAR-AUXIL
008240                     WHEN 2 MOVE "05"      TO SCTA-MOV
008250                            PERFORM ASIGNAR-AUXIL
008260                     WHEN 4 MOVE "90"      TO SCTA-MOV
008270                            MOVE "00090"   TO LOCAL-MOV
008280                 END-EVALUATE
008290         WHEN 03 MOVE MAY-DEUD         TO MAYOR-MOV
008300                 EVALUATE PUC-USU
008310                     WHEN 1 MOVE "05"      TO SCTA-MOV
008320                            PERFORM ASIGNAR-AUXIL
008330                     WHEN 2 MOVE "05"      TO SCTA-MOV
008340                            PERFORM ASIGNAR-AUXIL
008350                     WHEN 4 MOVE "90"      TO SCTA-MOV
008360                            MOVE "00090"   TO LOCAL-MOV
008370                 END-EVALUATE
008380         WHEN 04 MOVE MAY-DEUD         TO MAYOR-MOV
008390                 EVALUATE PUC-USU
008400                    WHEN 1 MOVE "05"      TO SCTA-MOV
008410                           PERFORM ASIGNAR-AUXIL
008420                    WHEN 2 MOVE "05"      TO SCTA-MOV
008430                           PERFORM ASIGNAR-AUXIL
008440                    WHEN 4 MOVE "90"      TO SCTA-MOV
008450                           MOVE "00090"   TO LOCAL-MOV
008460                 END-EVALUATE
008470         WHEN 05 MOVE "13050500009" TO CUENTA-MOV
008480         WHEN 95 MOVE "11050500009" TO CUENTA-MOV
008490         WHEN 96 MOVE "11050500009" TO CUENTA-MOV
008500         WHEN 97 IF PUC-USU = 2
008510                    MOVE "11050100001" TO CUENTA-MOV
008520                 ELSE
008530                    MOVE "11050500001" TO CUENTA-MOV
008540                    IF SEPARA-CAJA-ALT = "S"
008550                       EVALUATE ITEM-020-LNK
008560                           WHEN 1 MOVE "00001" TO LOCAL-MOV
008570                           WHEN 2 MOVE "00002" TO LOCAL-MOV
008580                           WHEN 3 MOVE "00003" TO LOCAL-MOV
008590                           WHEN 4 MOVE "00004" TO LOCAL-MOV
008600                           WHEN 5 MOVE "00005" TO LOCAL-MOV
008610                           WHEN 6 MOVE "00006" TO LOCAL-MOV
008620                           WHEN 7 MOVE "00007" TO LOCAL-MOV
008630                           WHEN 8 MOVE "00008" TO LOCAL-MOV
008640                           WHEN 9 MOVE "00009" TO LOCAL-MOV
008650                       END-EVALUATE
008660                    END-IF
008670                 END-IF
008680     END-EVALUATE.
008690
008700     MOVE VALOR-TOTAL TO VALOR-MOV
008710     PERFORM GRABAR-MOVIMIENTO
008720
008730     MOVE CUENTA-MOV      TO CTA-MAE
008740     MOVE 4               TO TIPO-MAE
008750     OPEN INPUT ARCHIVO-MAESTROS
008760
008770     READ ARCHIVO-MAESTROS WITH NO LOCK
008780          INVALID KEY 
008790                  PERFORM CREAR-CUENTA
008800     END-READ.
008810     CLOSE ARCHIVO-MAESTROS.
008820
008830
008840 RET-MOV.
008850     MOVE 88     TO I.
008860     IF VALOR-RET-FAC = 0 GO TO AUTORETENCION.
008870
008880     COMPUTE VALOR-MOV = VALOR-RET-FAC * -1.
008890     PERFORM GRABAR-MOVIMIENTO.
008900     MOVE "13551500001"  TO CUENTA-MOV.
008910     MOVE 81 TO I.
008920     MOVE VALOR-RET-FAC  TO VALOR-MOV.
008930     PERFORM GRABAR-MOVIMIENTO.
008940
008950 AUTORETENCION.
008960     IF AUTORET-USU = "S" AND RETENEDOR-TER = "S"
008970         CONTINUE
008980     ELSE
008990        GO TO AUTORETENCION-CREE
009000     END-IF.
009010
009020     IF VALOR-RET-FAC > 0 OR AUTORET-W < 1600
009030        GO TO AUTORETENCION-ICA
009040     END-IF
009050
009060     MOVE "13551500020"   TO CUENTA-MOV
009070     MOVE DESCRIP-TER     TO DETALLE-MOV.
009080     MOVE AUTORET-W       TO VALOR-MOV.
009090     MOVE NIT-FAC         TO ID-MOV.
009100
009110     MOVE 78 TO I.
009120     PERFORM GRABAR-MOVIMIENTO.
009130
009140
009150     MOVE NIT-FAC       TO ID-MOV.
009160     IF PUC-USU = 4
009170        MOVE "243695"   TO CUENTA-MOV
009180     ELSE
009190        MOVE "236575"   TO CUENTA-MOV
009200     END-IF.
009210
009220     MOVE AUXIL-RET-W     TO LOCAL-MOV
009230     COMPUTE VALOR-MOV = VALOR-MOV * -1.
009240
009250     MOVE 79 TO I.
009260     PERFORM GRABAR-MOVIMIENTO.
009270
009280 AUTORETENCION-CREE.
009290* NO APLICA PARA PERSONAS NATURALES
009300     IF NIT-USU < 800000000
009310     OR NIT-USU > 999999999
009320* ESTACION CRAVOSUR
009330     OR NIT-USU = 822000592
009340* ESTACION MOVILGAS
009350     OR NIT-USU = 900045328
009360     OR NIT-USU = 900127676
009370     OR PUC-USU = 2
009380     OR RET-CREE-USU = "N"
009390        GO TO AUTORETENCION-ICA
009400     END-IF.
009410
009420     IF (AUTORET-USU   = "S" AND FECHA-FAC > 20130500)
009430     OR (RETENEDOR-USU = "S" AND FECHA-FAC > 20130900)
009440        CONTINUE
009450     ELSE
009460         GO TO AUTORETENCION-ICA
009470     END-IF.
009480
009490     IF PUC-USU = 4
009500        MOVE "14225500002"   TO CUENTA-MOV
009510     ELSE
009520        MOVE "13551500099"   TO CUENTA-MOV
009530     END-IF.
009540
009550     CALL "CON008R" USING CUENTA-MOV PORC-RET-W.
009560     
009570     IF PORC-RET-W = ZERO
009580        IF PUC-USU = 4
009590           MOVE 0.3 TO PORC-RET-W
009600        ELSE
009610           MOVE 0.6 TO PORC-RET-W
009620        END-IF
009630     END-IF.
009640     
009650     COMPUTE AUTORET-CREE-W ROUNDED = BASE-AUTORET-W * PORC-RET-W / 100.
009660
009670     MOVE DESCRIP-TER        TO DETALLE-MOV
009680     MOVE AUTORET-CREE-W     TO VALOR-MOV
009690     MOVE NIT-FAC            TO ID-MOV
009700     MOVE BASE-AUTORET-W     TO BASE-RET-MOV
009710     MOVE 70 TO I.
009720     PERFORM GRABAR-MOVIMIENTO.
009730
009740     IF PUC-USU = 4
009750        MOVE "24369600002"   TO CUENTA-MOV
009760     ELSE
009770        MOVE "23657500099"   TO CUENTA-MOV
009780     END-IF.
009790
009800     COMPUTE VALOR-MOV = VALOR-MOV * -1.
009810     MOVE 71 TO I.
009820     PERFORM GRABAR-MOVIMIENTO.
009830
009840 AUTORETENCION-ICA.
009850     IF AUTORTEICA-USU = "S"
009860        CONTINUE
009870     ELSE
009880        GO TO FIN
009890     END-IF
009900
009910     IF NIT-USU = 800223811
009920        IF FECHA-FAC > 20150100
009930           CONTINUE
009940        ELSE
009950           GO TO FIN
009960        END-IF
009970     END-IF.
009980
009990     MOVE "13551800001"   TO CUENTA-MOV
010000     CALL "CON008R" USING CUENTA-MOV PORC-RET-W.
010010
010020
010030     IF PORC-RET-W = ZERO
010040        IF PUC-USU = 4
010050           MOVE 0.3 TO PORC-RET-W
010060        ELSE
010070           MOVE 0.6 TO PORC-RET-W
010080        END-IF
010090     END-IF
010100
010110     COMPUTE RET-ICA-W ROUNDED = ((VALOR-BRUTO - VALOR-DES-FAC) * PORC-RET-W ) / 1000.
010120
010130
010140     MOVE DESCRIP-TER        TO DETALLE-MOV.
010150     MOVE RET-ICA-W          TO VALOR-MOV.
010160     MOVE NIT-FAC            TO ID-MOV.
010170
010180     COMPUTE BASE-RET-MOV ROUNDED = (VALOR-BRUTO - VALOR-DES-FAC - EXCLUIR-RET-W)
010190     MOVE 101 TO I.
010200
010210     PERFORM GRABAR-MOVIMIENTO.
010220
010230     MOVE "23680500001"   TO CUENTA-MOV
010240
010250     COMPUTE VALOR-MOV = VALOR-MOV * -1.
010260     MOVE 102 TO I.
010270
010280     PERFORM GRABAR-MOVIMIENTO.
010290
010300
010310 FIN.
010320     INITIALIZE VARIABLES REG-FAC.
010330
010340 CERRAR-ARCHIVOS.
010350     CLOSE ARCHIVO-TERCEROS
010360           MAESTRO-ARTICULOS
010370           ARCHIVO-FACTURAS.
010380
010390 SALIR.
010400     EXIT PROGRAM.
010410
010420 SALIR2.
010430     STOP RUN.
010440
010450 ASIGNAR-AUXIL.
010460     MOVE "00001"       TO LOCAL-MOV.
010470
010480 REGISTRO-MOVIMIENTO.
010490     MOVE CTA-TAB (I) TO CUENTA-MOV.
010500     COMPUTE VALOR-MOV = VLR-TAB (I) * -1.
010510
010520     IF VALOR-MOV IS NOT ZERO
010530        PERFORM GRABAR-MOVIMIENTO
010540     END-IF.
010550
010560 CREAR-CUENTA.
010570     IF CTA-MAE = SPACES
010580        CONTINUE
010590     ELSE
010600        CLOSE ARCHIVO-MAESTROS
010610        OPEN I-O ARCHIVO-MAESTROS
010620        MOVE DESCRIP-TER  TO NOMBRE-MAE
010630        WRITE REGISTRO-MAE
010640     END-IF.
010650
010660 GRABAR-MOVIMIENTO.
010670     OPEN I-O MOVIMIENTO-DIARIO.
010680     MOVE I    TO ITEM.
010690     MOVE ITEM TO SECU-MOV.
010700
010710     IF VALOR-MOV IS NOT ZERO
010720        WRITE MOV-DIARIO
010730     END-IF.
010740
010750     CLOSE MOVIMIENTO-DIARIO.
010760                
010770
010780 DEPURAR-RETENCION.
010790     IF  AUTORET-10  >= AUTORET-15
010800     AND AUTORET-10  >= AUTORET-20
010810     AND AUTORET-10  >= AUTORET-35
010820     AND AUTORET-10  >= AUTORET-40
010830     AND AUTORET-10  >= AUTORET-60
010840     AND AUTORET-10  >= AUTORET-70
010850     AND AUTORET-10  >= AUTORET-100
010860     AND AUTORET-10  >= AUTORET-110
010870         ADD AUTORET-15  TO AUTORET-10
010880         ADD AUTORET-20  TO AUTORET-10
010890         ADD AUTORET-35  TO AUTORET-10
010900         ADD AUTORET-40  TO AUTORET-10
010910         ADD AUTORET-60  TO AUTORET-10
010920         ADD AUTORET-70  TO AUTORET-10
010930         ADD AUTORET-100 TO AUTORET-10
010940         ADD AUTORET-110 TO AUTORET-10
010950         INITIALIZE AUTORET-15  AUTORET-20 AUTORET-35  AUTORET-40
010960                    AUTORET-60  AUTORET-70
010970                    AUTORET-100 AUTORET-110
010980         MOVE AUTORET-10 TO BASE-AUTORET-W
010990         MOVE "00001"    TO AUXIL-RET-W
011000         MOVE 0.010      TO AUTORET-PORC
011010     ELSE
011020         IF  AUTORET-15  >= AUTORET-10
011030         AND AUTORET-15  >= AUTORET-20
011040         AND AUTORET-15  >= AUTORET-35
011050         AND AUTORET-15  >= AUTORET-40
011060         AND AUTORET-15  >= AUTORET-60
011070         AND AUTORET-15  >= AUTORET-70
011080         AND AUTORET-15  >= AUTORET-100
011090         AND AUTORET-15  >= AUTORET-110
011100             ADD AUTORET-10  TO AUTORET-15
011110             ADD AUTORET-20  TO AUTORET-15
011120             ADD AUTORET-35  TO AUTORET-15
011130             ADD AUTORET-40  TO AUTORET-15
011140             ADD AUTORET-60  TO AUTORET-15
011150             ADD AUTORET-70  TO AUTORET-15
011160             ADD AUTORET-110 TO AUTORET-15
011170             INITIALIZE AUTORET-10  AUTORET-20 AUTORET-35
011180                        AUTORET-40  AUTORET-60 AUTORET-70
011190                        AUTORET-100 AUTORET-110
011200             MOVE AUTORET-15 TO BASE-AUTORET-W
011210             MOVE "00005"    TO AUXIL-RET-W
011220             MOVE 0.015      TO AUTORET-PORC
011230         ELSE
011240             IF  AUTORET-20  >= AUTORET-10
011250             AND AUTORET-20  >= AUTORET-15
011260             AND AUTORET-20  >= AUTORET-35
011270             AND AUTORET-20  >= AUTORET-40
011280             AND AUTORET-20  >= AUTORET-60
011290             AND AUTORET-20  >= AUTORET-100
011300             AND AUTORET-20  >= AUTORET-110
011310                 ADD AUTORET-10  TO AUTORET-20
011320                 ADD AUTORET-15  TO AUTORET-20
011330                 ADD AUTORET-35  TO AUTORET-20
011340                 ADD AUTORET-40  TO AUTORET-20
011350                 ADD AUTORET-60  TO AUTORET-20
011360                 ADD AUTORET-100 TO AUTORET-20
011370                 ADD AUTORET-110 TO AUTORET-20
011380                     INITIALIZE AUTORET-10 AUTORET-15 AUTORET-35
011390                                AUTORET-40 AUTORET-60 AUTORET-100
011400                                                      AUTORET-110
011410                     MOVE AUTORET-20 TO BASE-AUTORET-W
011420                     MOVE "00002"    TO AUXIL-RET-W
011430                     MOVE 0.020      TO AUTORET-PORC
011440
011450             ELSE
011460                IF  AUTORET-35  >= AUTORET-10
011470                AND AUTORET-35  >= AUTORET-15
011480                AND AUTORET-35  >= AUTORET-20
011490                AND AUTORET-35  >= AUTORET-40
011500                AND AUTORET-35  >= AUTORET-60
011510                AND AUTORET-35  >= AUTORET-100
011520                AND AUTORET-35  >= AUTORET-110
011530                    ADD AUTORET-10  TO AUTORET-35
011540                    ADD AUTORET-15  TO AUTORET-35
011550                    ADD AUTORET-20  TO AUTORET-35
011560                    ADD AUTORET-40  TO AUTORET-35
011570                    ADD AUTORET-60  TO AUTORET-35
011580                    ADD AUTORET-100 TO AUTORET-35
011590                    ADD AUTORET-110 TO AUTORET-35
011600                    INITIALIZE AUTORET-10 AUTORET-15 AUTORET-20
011610                               AUTORET-40 AUTORET-60 AUTORET-100
011620                                                     AUTORET-110
011630                    MOVE AUTORET-35 TO BASE-AUTORET-W
011640                    MOVE "00010"    TO AUXIL-RET-W
011650                    MOVE 0.035      TO AUTORET-PORC
011660                ELSE
011670                   IF  AUTORET-40  >= AUTORET-10
011680                   AND AUTORET-40  >= AUTORET-15
011690                   AND AUTORET-40  >= AUTORET-20
011700                   AND AUTORET-40  >= AUTORET-35
011710                   AND AUTORET-40  >= AUTORET-60
011720                   AND AUTORET-40  >= AUTORET-100
011730                   AND AUTORET-40  >= AUTORET-110
011740                       ADD AUTORET-10  TO AUTORET-40
011750                       ADD AUTORET-15  TO AUTORET-40
011760                       ADD AUTORET-20  TO AUTORET-40
011770                       ADD AUTORET-35  TO AUTORET-40
011780                       ADD AUTORET-60  TO AUTORET-40
011790                       ADD AUTORET-100 TO AUTORET-40
011800                       ADD AUTORET-110 TO AUTORET-40
011810                       INITIALIZE AUTORET-10 AUTORET-15  AUTORET-20 AUTORET-35 
011820                                  AUTORET-60 AUTORET-100 AUTORET-110
011830                       MOVE AUTORET-40 TO BASE-AUTORET-W
011840                       MOVE 0.040      TO AUTORET-PORC
011850                       MOVE "00004"    TO AUXIL-RET-W
011860                   ELSE
011870                      IF  AUTORET-60  >= AUTORET-10
011880                      AND AUTORET-60  >= AUTORET-15
011890                      AND AUTORET-60  >= AUTORET-20
011900                      AND AUTORET-60  >= AUTORET-35
011910                      AND AUTORET-60  >= AUTORET-40
011920                      AND AUTORET-60  >= AUTORET-100
011930                      AND AUTORET-60  >= AUTORET-110
011940                          ADD AUTORET-10  TO AUTORET-60
011950                          ADD AUTORET-15  TO AUTORET-60
011960                          ADD AUTORET-20  TO AUTORET-60
011970                          ADD AUTORET-35  TO AUTORET-60
011980                          ADD AUTORET-40  TO AUTORET-60
011990                          ADD AUTORET-100 TO AUTORET-60
012000                          ADD AUTORET-110 TO AUTORET-60
012010                          INITIALIZE AUTORET-10 AUTORET-15 AUTORET-20
012020                                     AUTORET-35 AUTORET-40 AUTORET-100
012030                                     AUTORET-110
012040                          MOVE AUTORET-60 TO BASE-AUTORET-W
012050                          MOVE 0.060      TO AUTORET-PORC
012060                          MOVE "00006"    TO AUXIL-RET-W
012070                  
012080                      ELSE
012090                         IF  AUTORET-100 >= AUTORET-10
012100                         AND AUTORET-100 >= AUTORET-15
012110                         AND AUTORET-100 >= AUTORET-20
012120                         AND AUTORET-100 >= AUTORET-35
012130                         AND AUTORET-100 >= AUTORET-40
012140                         AND AUTORET-100 >= AUTORET-60
012150                         AND AUTORET-100 >= AUTORET-110
012160                             ADD AUTORET-10  TO AUTORET-100
012170                             ADD AUTORET-15  TO AUTORET-100
012180                             ADD AUTORET-20  TO AUTORET-100
012190                             ADD AUTORET-35  TO AUTORET-100
012200                             ADD AUTORET-40  TO AUTORET-100
012210                             ADD AUTORET-60  TO AUTORET-100
012220                             ADD AUTORET-110 TO AUTORET-100
012230                             INITIALIZE AUTORET-10 AUTORET-15 AUTORET-20
012240                                        AUTORET-35 AUTORET-40 AUTORET-60
012250                                        AUTORET-110
012260                             MOVE AUTORET-100 TO BASE-AUTORET-W
012270                             MOVE 0.100       TO AUTORET-PORC
012280                             MOVE "00015"    TO AUXIL-RET-W
012290
012300                         ELSE
012310                           IF  AUTORET-110 >= AUTORET-10
012320                           AND AUTORET-110 >= AUTORET-15
012330                           AND AUTORET-110 >= AUTORET-20
012340                           AND AUTORET-110 >= AUTORET-35
012350                           AND AUTORET-110 >= AUTORET-40
012360                           AND AUTORET-110 >= AUTORET-60
012370                           AND AUTORET-110 >= AUTORET-100
012380                               ADD AUTORET-10  TO AUTORET-110
012390                               ADD AUTORET-15  TO AUTORET-110
012400                               ADD AUTORET-20  TO AUTORET-110
012410                               ADD AUTORET-35  TO AUTORET-110
012420                               ADD AUTORET-40  TO AUTORET-110
012430                               ADD AUTORET-60  TO AUTORET-110
012440                               ADD AUTORET-100 TO AUTORET-110
012450                               INITIALIZE AUTORET-10 AUTORET-15 AUTORET-20
012460                                          AUTORET-35 AUTORET-40 AUTORET-60
012470                                          AUTORET-100
012480                               MOVE AUTORET-110 TO BASE-AUTORET-W
012490                               MOVE "00011"     TO AUXIL-RET-W
012500                               MOVE 0.110       TO AUTORET-PORC
012510                           END-IF
012520                         END-IF
012530                      END-IF
012540                   END-IF
012550                END-IF
012560             END-IF
012570         END-IF 
012580     END-IF.
012590     
012600     SUBTRACT VALOR-DES-FAC FROM BASE-AUTORET-W
012610     COMPUTE AUTORET-W ROUNDED = BASE-AUTORET-W * AUTORET-PORC.
012620
012630
012640 LEER-SOBRETASA.
012650
012660     MOVE GRUPO-FACT-W (I)      TO GRUPO-SOBRE
012670     MOVE NUMERO-ART-FACT-W (I) TO COD-ART-SOBRE
012680
012690     READ ARCHIVO-SOBRETASAS WITH NO LOCK
012700          INVALID KEY
012710                  INITIALIZE VALOR-SOBRE VALOR-GLOBAL-SOBRE
012720          NOT INVALID KEY
012730                  IF CTA-SOBRE = SPACES
012740                     MOVE "28150500001"   TO CTA-SOBRE
012750                  END-IF
012760     END-READ
012770
012780     COMPUTE VALOR-SOBRE-T = VALOR-SOBRE  * CANTIDAD-FACT-W (I).
012790     COMPUTE VALOR-GLOBAL-T = VALOR-GLOBAL-SOBRE * CANTIDAD-FACT-W (I).
012800
012810     IF VALOR-SOBRE-T > 0
012820        MOVE 0  TO SW-CTA
012830     ELSE
012840        CONTINUE
012850     END-IF.
012860
012870 BUSCAR-TABLA-SOB.
012880     IF CTA-SOBRE = CTA-TAB (J)
012890        MOVE 1 TO SW-CTA
012900        ADD  VALOR-SOBRE-T TO VLR-TAB (J)
012910     END-IF.
012920
012930 UBICAR-TABLA-SOB.
012940     IF CTA-TAB (J) = SPACES
012950        MOVE CTA-SOBRE     TO CTA-TAB (J)
012960        MOVE VALOR-SOBRE-T TO VLR-TAB (J)
012970        MOVE 1 TO SW-CTA
012980     END-IF.
012990
013000 BUSCAR-TABLA-GLO.
013010     IF CTA-GLOBAL-SOBRE = CTA-TAB (J)
013020        MOVE 1 TO SW-CTA
013030        ADD  VALOR-GLOBAL-T TO VLR-TAB (J)
013040     END-IF.
013050
013060
013070 UBICAR-TABLA-GLO.
013080     IF CTA-TAB (J) = SPACES
013090        MOVE CTA-GLOBAL-SOBRE  TO CTA-TAB (J)
013100        MOVE VALOR-GLOBAL-T    TO VLR-TAB (J)
013110        MOVE 1 TO SW-CTA
013120     END-IF.
013130
013140
013150 LLENAR-TABLA-PROP.
013160     COMPUTE Y = J + 20.
013170     IF VLR-DIST-FAC (J) > ZERO
013180        MOVE CTA-ART            TO CTA-TAB   (Y)
013190        MOVE NIT-DIST-FAC  (J) TO NIT-TAB   (Y)
013200        MOVE VLR-DIST-FAC  (J) TO VLR-TAB   (Y)
013210     END-IF.
013220
