000012* GUARDA ELABORACION DE FACTURA 9-4-1
000020 IDENTIFICATION DIVISION.
000021* PROGRAM-ID. "INV421_R".
000022
000023 PROGRAM-ID. "HttpExtensionProc".
000024 ENVIRONMENT DIVISION.
000025 CONFIGURATION SECTION.
000026 INPUT-OUTPUT SECTION.
000027 FILE-CONTROL.
000080 COPY "P:\PROG\PROYECT\FUENTES\FS-USUNET.CBL".
000150 COPY "P:\PROG\PROYECT\FUENTES\FS-SESION.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FS-FACTURA2.CBL".


           SELECT ARCHIVO-USUARIOS LOCK MODE IS AUTOMATIC
                  ASSIGN TO NOM-USUAR-W
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC;
                  RECORD KEY IS NOMBRE-USU
                  ALTERNATE RECORD KEY IS CTL-USU     WITH DUPLICATES
                  ALTERNATE RECORD KEY IS CLAVE-USU   WITH DUPLICATES
                  ALTERNATE RECORD KEY IS CLAVE-2-USU WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.


           SELECT ARCHIVO-CARROS LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-CAR-W
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS PLACA-CAR
                  ALTERNATE RECORD KEY IS PRO-TPROP-CAR WITH DUPLICATES
                  ALTERNATE RECORD KEY IS TIT-TPROP-CAR WITH DUPLICATES
                  ALTERNATE RECORD KEY IS COND-CAR      WITH DUPLICATES
                  ALTERNATE RECORD KEY IS RELEV-CAR     WITH DUPLICATES
                  ALTERNATE RECORD KEY EMPRESA-CAR      WITH DUPLICATES
                  ALTERNATE RECORD KEY CHASIS-CAR       WITH DUPLICATES
                  ALTERNATE RECORD KEY IS INTERNO-CAR   WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.


           SELECT ARCHIVO-PLACAS LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-PLA-W
                  ORGANIZATION INDEXED;
                  ACCESS MODE DYNAMIC;
                  RECORD KEY IS PLACA-PLA
                  FILE STATUS IS OTR-STAT.


           SELECT MAESTRO-ARTICULOS LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-ART-W
                  ORGANIZATION INDEXED;
                  ACCESS MODE  DYNAMIC;
                  RECORD KEY COD-ART
                  ALTERNATE RECORD KEY CLASE-ART       WITH DUPLICATES
                  ALTERNATE RECORD KEY COD-BARRAS-ART  WITH DUPLICATES
                  ALTERNATE RECORD KEY DESCRIP-ART     WITH DUPLICATES
                  ALTERNATE RECORD KEY USO-ART         WITH DUPLICATES
                  ALTERNATE RECORD KEY CL-ROTAC-ART    WITH DUPLICATES
                  ALTERNATE RECORD KEY UBICAC-ART      WITH DUPLICATES
                  ALTERNATE RECORD KEY FECHA-VENCE-ART WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.


           SELECT ARCHIVO-FACTURAS LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-FACT-W
                  ORGANIZATION INDEXED;
                  ACCESS MODE DYNAMIC;
                  RECORD KEY IS LLAVE-FAC
                  ALTERNATE RECORD KEY IS FECHA-FAC        WITH DUPLICATES
                  ALTERNATE RECORD KEY IS NIT-FAC          WITH DUPLICATES
                  ALTERNATE RECORD KEY IS LLAVE-VEND-FAC   WITH DUPLICATES
                  ALTERNATE RECORD KEY IS VENDEDOR-FAC     WITH DUPLICATES
                  ALTERNATE RECORD KEY IS PLACA-FAC        WITH DUPLICATES
                  ALTERNATE RECORD KEY IS TIQ-BASC-FAC     WITH DUPLICATES
                  ALTERNATE RECORD KEY IS ORD-PEDI-FAC     WITH DUPLICATES
                  ALTERNATE RECORD KEY IS CIUDAD-FAC       WITH DUPLICATES                  
                  ALTERNATE RECORD KEY IS NRO-FACT-DEV-FAC WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.


           SELECT ARCHIVO-PLANO                                                                        
                  ASSIGN NOM-PLANO-W
                  ORGANIZATION IS LINE SEQUENTIAL
                  FILE STATUS IS OTR-STAT.

000390
000400 DATA DIVISION.
000410 FILE SECTION.
000420 COPY "P:\PROG\PROYECT\FUENTES\FD-USUNET.CBL".
000421 COPY "P:\PROG\PROYECT\FUENTES\FD-SESION.CBL".
000450 COPY "P:\PROG\PROYECT\FUENTES\FD-CARRO.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-PLACA.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-ARTIC.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-USUAR.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-FACTURA.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-FACTURA2.CBL".

       FD  ARCHIVO-PLANO
           LABEL RECORD STANDARD.
       01  REG-PLANO.
           02 DATOS-PLANO            PIC X(250). 

000470
000540 WORKING-STORAGE  SECTION.
000550 COPY "P:\PROG\PROYECT\FUENTES\COBW3.CBL".
000560 COPY "P:\PROG\PROYECT\FUENTES\WEB-CARAC.CBL".

       01 NOM-USUAR-W            PIC X(70).
000570 01 NOM-CAR-W              PIC X(70).
       01 NOM-PLA-W              PIC X(70).
       01 NOM-ART-W              PIC X(70).
       01 NOM-PLANO-W            PIC X(90).
       01 NOM-FACT-W             PIC X(70).
       01 NOM-FACT2-LNK          PIC X(70).


000590 01 EDITADO-W              PIC X(15).
000600 01 COD-USER-W             PIC X(15).
000622 01 CLAVE-CTL              PIC X(15).
000633 01  DATO-W.
000635     02 CLAVE-W            PIC X(15).

       01 VARIABLES.
          02 F1-LLEGAD-W          PIC X.
          02 FECHA-LLEGAD-W       PIC 9(8).
          02 PLACA-W              PIC X(6).
          02 COD-TER-W            PIC 9(10).
          02 COD-VEND-W           PIC X(5).
          02 VLR-DESC-EDIT.
             03 VLR-ENT-DESC-EDIT PIC S9(12).
             03 VLR-DEC-DESC-EDIT PIC 99.
          02 VLR-IVA-EDIT.
             03 VLR-ENT-IVA-EDIT  PIC S9(12).
             03 VLR-DEC-IVA-EDIT  PIC 99.
          02 VLR-RET-EDIT.
             03 VLR-ENT-RET-EDIT  PIC S9(12).
             03 VLR-DEC-RET-EDIT  PIC 99.
          02 FORMA-PAGO-W         PIC 99.
          02 DETALLE-W            PIC X(95).
          02 NIVEL-COMB-W         PIC 99.
          02 BASE-ICAV-W          PIC 9(12).
          02 VLR-IVA-1-EDIT.
             03 VLR-ENT-IVA-1-EDIT PIC S9(12).
             03 VLR-DEC-IVA-1-EDIT PIC 99.
          02 VLR-IVA-2-EDIT.
             03 VLR-ENT-IVA-2-EDIT PIC S9(12).
             03 VLR-DEC-IVA-2-EDIT PIC 99.
          02 VLR-IVA-3-EDIT.
             03 VLR-ENT-IVA-3-EDIT PIC S9(12).
             03 VLR-DEC-IVA-3-EDIT PIC 99.
          02 ULT-ITEM-W            PIC 99.
          02 CANT-EDIT.
             03 CANT-ENT-EDIT      PIC S9(12).
             03 CANT-DEC-EDIT      PIC 99.
          02 VLR-TOT-EDIT.
             03 VLR-ENT-TOT-EDIT   PIC S9(12).
             03 VLR-DEC-TOT-EDIT   PIC 99.
          02 FECHA-VENCE-W.
             03 ANO-VENCE-W        PIC 9(4).
             03 MES-VENCE-W        PIC 99.
             03 DIA-VENCE-W        PIC 99.


       01 LINEA-LLEGAD-W         PIC X(500).

       01 DATO-LLEGADA-W.
          02 SESION-LLEGAD-W     PIC X(29).
          02 DIRECTORIO-LLEGAD-W PIC X(30).
          02 CARPTA-LLEGAD-W     PIC X(9).


       01 DATOS-TABLA-W.
          02 TABLA-PLA-W OCCURS 30.
             05 LLAVE-ART-PLA-W.
                07 ALMACEN-PLA-W         PIC X(5).
                07 COD-ART-PLA-W.
                   09 LLAVE-GRUPO-PLA-W.
                      10 TIPO-ART-PLA-W  PIC 9.
                      10 GRUPO-PLA-W.
                         15 GRP1-PLA-W   PIC X.
                         15 GRP2-PLA-W   PIC X.
                   09 NUMERO-ART-PLA-W   PIC X(13).
                   09 CLASE-ART-PLA-W    PIC XX.
             05 CANTIDAD-PLA-W           PIC S9(12)V99.
             05 VALOR-PLA-W              PIC S9(12)V99.
             05 COSTO-PLA-W              PIC S9(12)V99.
             05 CONF-PLA-W               PIC X.


       01 SW-INVALID-W           PIC 99.
       01 MENSAJE-W              PIC X(70).

       01 ULT-FECHA-NUM.
          02 ULT-ANO-NUM        PIC 99.
          02 ULT-MES-NUM        PIC 99.
          02 ULT-DIA-NUM        PIC 99. 

       01 NOMBRE-LNK             PIC X(30).
       01 DIRECTORIO-W           PIC X(35).
       01 INVALID-007            PIC X(80).
       01 DATO-ULT-MOV-LNK.
          02 LOTE-ULT-MOV-LNK.
             03 LOTE1-ULT-MOV-LNK PIC X.
             03 LOTE2-ULT-MOV-LNK PIC X.
             03 LOTE3-ULT-MOV-LNK PIC X.
          02 NRO-ULT-COMP-LNK.
             03 NRO1-ULT-COMP-LNK PIC 9(3).
             03 NRO2-ULT-COMP-LNK PIC 9(6).
          02 FECHA-ULT-MOV-LNK.
             03 ANO-ULT-MOV-LNK  PIC 99.
             03 MES-ULT-MOV-LNK  PIC 99.
             03 DIA-ULT-MOV-LNK  PIC 99.


      *VARIABLES DE INV020 Y INV030
       01 NRO-FACT-020-LNK       PIC 9(6).
       01 TIPO-020-LNK.
          02 ITEM-020-LNK        PIC 9.
          02 PREF-020-LNK        PIC XX.
       01 INVALID-INV            PIC 99. 
       01 MENSAJE-LNK            PIC X(100).
      
       01 LLAVE-FACT-030-LNK.
          02 NRO-FACT-030-LNK    PIC 9(6).
       01 TIPO-030-LNK.
          02 ITEM-030-LNK        PIC 9.
          02 PREF-030-LNK        PIC XX.


       01 DATOS-ENVIO.
          02 DAT0-ENV            PIC XX.
          02 FILLER              PIC X VALUE "|".
          02 DAT1-ENV            PIC X(6).
          02 FILLER              PIC X VALUE "|".

000730 01 COD-TMP.
000740    02 SW-ALFA             PIC 9.
000750    02 TABLA-COD1.
000760       03 COD1-PAC         PIC X OCCURS 15.
000770    02 TABLA-COD2.
000780       03 COD2-PAC         PIC X OCCURS 15.
000790
000791 LINKAGE SECTION.
000792 COPY "P:\PROG\PROYECT\FUENTES\ISAPICTX.CBL".
000793
000794 PROCEDURE DIVISION WITH stdcall LINKAGE USING ISAPI-CTX-CNT.
000795
000810 DECLARATIVES.
000811 I-O-TEST SECTION.
000812     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUNET.         
000813 ESCR-EXCEPTIONES.
000814     IF OTR-STAT = "00"
000815        CONTINUE 
000816     ELSE
000817        MOVE OTR-STAT                TO MSJ1-HTML
000818        MOVE NOM-USU-W               TO MSJ2-HTML
000819        MOVE "INV421_R"              TO MSJ3-HTML
000820        GO TO ENVIAR2-ERROR
000821     END-IF.
001030
001040 I-O-TEST SECTION.
001050     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SESION.         
001060 ESCR-EXCEPTIONES.
001070     IF OTR-STAT = "00"
001080        CONTINUE
001090     ELSE
001100        MOVE OTR-STAT                TO MSJ1-HTML
001101        MOVE NOM-SESION-W            TO MSJ2-HTML
001102        MOVE "INV421_R"              TO MSJ3-HTML
001103        GO TO ENVIAR2-ERROR
001104     END-IF.

001040 I-O-TEST SECTION.
001050     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUARIOS.
001060 ESCR-EXCEPTIONES.
001070     IF OTR-STAT = "00"
001080        CONTINUE
001090     ELSE
001100        MOVE OTR-STAT                TO MSJ1-HTML
001101        MOVE NOM-USUAR-W             TO MSJ2-HTML
001102        MOVE "INV42_R"               TO MSJ3-HTML
001103        GO TO ENVIAR2-ERROR
001104     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-CARROS.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT                TO MSJ1-HTML
006670        MOVE NOM-CAR-W               TO MSJ2-HTML
006680        MOVE "INV421_R"              TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-PLACAS.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT                TO MSJ1-HTML
006670        MOVE NOM-PLA-W               TO MSJ2-HTML
006680        MOVE "INV421_R"              TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON MAESTRO-ARTICULOS.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT                TO MSJ1-HTML
006670        MOVE NOM-ART-W               TO MSJ2-HTML
006680        MOVE "INV421_R"              TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-FACTURAS.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT                TO MSJ1-HTML
006670        MOVE NOM-FACT-W              TO MSJ2-HTML
006680        MOVE "INV421_R"              TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-FACTURAS2.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT                TO MSJ1-HTML
006670        MOVE NOM-FACT2-LNK           TO MSJ2-HTML
006680        MOVE "INV421_R"              TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-PLANO.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT                TO MSJ1-HTML
006670        MOVE NOM-PLANO-W             TO MSJ2-HTML
006680        MOVE "INV421_R"              TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.
001105
001150 END DECLARATIVES.
001160
001161 INICIAR-IIS.
001162     MOVE LOW-VALUE TO COBW3.
001163     MOVE FUNCTION ADDR(ISAPI-CTX-CNT) TO COBW3-CONTEXT.
001164     CALL "COBW3_INIT" USING COBW3.
001220
001221 LEER-DATO-HTML.
001852     MOVE "datosh" TO COBW3-SEARCH-DATA.
001853     CALL "COBW3_GET_VALUE" USING COBW3.
001854     MOVE COBW3-GET-DATA    TO LINEA-LLEGAD-W.

           INITIALIZE DATO-LLEGADA-W VARIABLES

           UNSTRING LINEA-LLEGAD-W DELIMITED BY "|"
              INTO SESION-LLEGAD-W, DIRECTORIO-LLEGAD-W, CARPTA-LLEGAD-W, ADMIN-W, FECHA-LLEGAD-W, PLACA-W
                   COD-TER-W, COD-VEND-W, VLR-DESC-EDIT, VLR-IVA-EDIT, VLR-RET-EDIT, FORMA-PAGO-W, 
                   DETALLE-W, NIVEL-COMB-W, BASE-ICAV-W, VLR-IVA-1-EDIT, VLR-IVA-2-EDIT, VLR-IVA-3-EDIT, 
                   ULT-ITEM-W, FECHA-VENCE-W, F1-LLEGAD-W
           END-UNSTRING.

001855     MOVE SESION-LLEGAD-W    TO LLAVE-SESION-W.
           MOVE FUNCTION CURRENT-DATE TO FECHA-TOTAL.
000830     ACCEPT HORA-TOTAL FROM TIME.

001238 INICIAR-SESION.
001245     MOVE "D:\WEB\MAIN-ELECT\DATOS\SC-SESION.DAT" TO NOM-SESION-W
001246
000820     MOVE FUNCTION CURRENT-DATE TO FECHA-TOTAL.
000830     ACCEPT HORA-TOTAL FROM TIME.
000810     GO TO VALIDAR-SESION.
000850
000860 FIN-VALIDAR-SESION.

001303 ABRIR-USUARIO.
001304     MOVE "D:\WEB\MAIN-ELECT\DATOS\SC-ARCHUSU.DAT" TO NOM-USU-W
001305
001306     OPEN INPUT ARCHIVO-USUNET
001307     EVALUATE OTR-STAT
001308       WHEN "00"  CONTINUE
001309       WHEN "35"  OPEN OUTPUT ARCHIVO-USUNET
001310                  CLOSE       ARCHIVO-USUNET
001311                  OPEN I-O    ARCHIVO-USUNET
001312                  INITIALIZE REG-USUNET
001314                  WRITE REG-USUNET
001315                  CLOSE       ARCHIVO-USUNET
001316                  MOVE "Validacion de usuarios"      TO MSJ1-HTML
001317                  MOVE "Falta configurar usuario"    TO MSJ2-HTML
001318                  MOVE "Sc"                          TO MSJ3-HTML
001319                  GO TO ENVIAR2-ERROR
001320       WHEN OTHER GO TO CERRAR-SESION
001321     END-EVALUATE.
001322
001332     INITIALIZE REG-USUNET.

007110 LEER-USUARIO.
007120     READ ARCHIVO-USUNET NEXT AT END MOVE 0 TO SW-FIN.
007130
007140     CLOSE ARCHIVO-USUNET.
007200     
007210     IF NOMBRE-USUNET = SPACES
007220     OR NIT-USUNET = ZEROS
007230        MOVE "Validacion de Sesion"        TO MSJ1-HTML
007240        MOVE "Falta configurar usuarios"   TO MSJ2-HTML
007250        MOVE "Sc"                          TO MSJ3-HTML
007260        GO TO ENVIAR2-ERROR
007270     END-IF.

       INICIAR-RESTRICION.
           ACCEPT ULT-FECHA-NUM FROM DATE.
           INSPECT IP-DATOS-USUNET REPLACING FIRST "/" BY "\"
001614     INITIALIZE NOM-PLA-W NOM-CAR-W NOM-PLANO-W NOMBRE-LNK DIRECTORIO-W
001615     MOVE "\\" TO NOM-PLA-W NOM-CAR-W 
001616
001617     INSPECT NOM-PLA-W REPLACING FIRST "                    "
001618                                    BY IP-DATOS-USUNET
001621     INSPECT NOM-PLA-W REPLACING FIRST " "
001624                                     BY "\"
007292     INSPECT NOM-PLA-W REPLACING FIRST "                              "
007293                                     BY DIRECTORIO-LLEGAD-W

           MOVE NOM-PLA-W TO NOM-USUAR-W NOM-ART-W NOM-FACT-W NOM-FACT2-LNK

007190     INSPECT NOM-PLA-W REPLACING FIRST "                       "
007200                                    BY "\CONTROL\SC-ARCHPLA.DAT".

           INSPECT NOM-USUAR-W REPLACING FIRST "                       "
                                            BY "\CONTROL\SC-ARCHUSU.DAT".

           INSPECT NOM-ART-W REPLACING FIRST "                       "
                                          BY "\CONTROL\SC-MAESART.DAT".

           INSPECT NOM-FACT-W REPLACING FIRST "                           "
                                           BY "\CONTROL\SC-ARCHFACT-01.DAT".

           INSPECT NOM-FACT2-LNK REPLACING FIRST "                             "
                                              BY "\CONTROL\SC-ARCHEXFACT-01.DAT".


           INSPECT NOM-CAR-W REPLACING FIRST "                    "
                                          BY IP-DATOS-USUNET

           INSPECT NOM-CAR-W REPLACING FIRST "                         "
                                          BY "\PROG\DATOS\SC-CARROS.DAT".


001031     MOVE "\\" TO NOMBRE-LNK.
           INSPECT  NOMBRE-LNK  REPLACING FIRST "                    "
001033                                       BY IP-DATOS-USUNET.

           INSPECT DIRECTORIO-W REPLACING FIRST " "
                                             BY "\"
     
           INSPECT DIRECTORIO-W REPLACING FIRST "                              "
007293                                     BY DIRECTORIO-LLEGAD-W.


       ABRIR-USUARIO.

           OPEN INPUT ARCHIVO-USUARIOS.
           READ ARCHIVO-USUARIOS NEXT WITH NO LOCK AT END 
                CLOSE ARCHIVO-USUARIOS
           END-READ.


       ABRIR-CARROS.

           OPEN INPUT ARCHIVO-CARROS.

           MOVE PLACA-W         TO PLACA-CAR

           READ ARCHIVO-CARROS WITH NO LOCK
                INVALID KEY 
                           MOVE "99"             TO MSJ1-HTML
                           MOVE PLACA-CAR  TO MSJ2-HTML
                           MOVE "INV422_R"       TO MSJ3-HTML
                           GO TO ENVIAR2-ERROR
           END-READ.

           CLOSE ARCHIVO-CARROS.

       ABRIR-PLACAS.
           OPEN INPUT ARCHIVO-PLACAS.

           MOVE PLACA-CAR   TO PLACA-PLA

           READ ARCHIVO-PLACAS WITH NO LOCK
                INVALID KEY
                        MOVE "99"              TO MSJ1-HTML
                        MOVE "No existe placa" TO MSJ2-HTML
                        MOVE "INV421"          TO MSJ3-HTML
                        GO TO ENVIAR2-ERROR
           END-READ

           CLOSE ARCHIVO-PLACAS.

       ABRIR-PLANO.
           MOVE "C:\PROSOFT\TEMP\TABLAIVA-XXXXXXXXXXXXXXXXXXXXXXXXXXXXX.TXT"  TO NOM-PLANO-W
           INSPECT NOM-PLANO-W REPLACING FIRST "XXXXXXXXXXXXXXXXXXXXXXXXXXXXX" BY SESION-LLEGAD-W

           OPEN INPUT ARCHIVO-PLANO.
           INITIALIZE REG-PLANO DATOS-TABLA-W J.

       LEER-PLANO.
           READ ARCHIVO-PLANO NEXT WITH NO LOCK AT END GO TO CERRAR-PLANO.

           IF DATOS-PLANO = SPACES OR LOW-VALUE 
              GO TO LEER-PLANO
           ELSE
              ADD 1 TO J
              UNSTRING DATOS-PLANO DELIMITED BY "|"
                  INTO ALMACEN-PLA-W (J), COD-ART-PLA-W (J), CANT-EDIT, VLR-TOT-EDIT
              END-UNSTRING

              MOVE CANT-EDIT       TO CANTIDAD-PLA-W (J)
              MOVE VLR-TOT-EDIT    TO VALOR-PLA-W    (J)

              INSPECT NUMERO-ART-PLA-W (J) REPLACING ALL "x" BY "*"

              OPEN INPUT MAESTRO-ARTICULOS
              MOVE COD-ART-PLA-W (J)   TO COD-ART
              READ MAESTRO-ARTICULOS WITH NO LOCK
                   INVALID KEY
                           MOVE "99"        TO MSJ1-HTML
                           MOVE COD-ART     TO MSJ2-HTML
                           MOVE "INV421_R"  TO MSJ3-HTML
                           GO TO ENVIAR2-ERROR
              END-READ
              CLOSE MAESTRO-ARTICULOS
           END-IF
           GO TO LEER-PLANO.


       CERRAR-PLANO.
           CLOSE ARCHIVO-PLANO.


           OPEN I-O ARCHIVO-PLACAS

           INITIALIZE J DATOS-PLA
           PERFORM LLENAR-TABLA VARYING I FROM 1 BY 1
                                         UNTIL I > 30.


           MOVE FECHA-LLEGAD-W   TO FECHA-PLA
      *     MOVE PLACA-W          TO PLACA-PLA
           MOVE COD-TER-W        TO NIT-PLA
           MOVE COD-VEND-W       TO VENDEDOR-PLA
           MOVE VLR-DESC-EDIT    TO VALOR-DES-PLA
           MOVE VLR-IVA-EDIT     TO VALOR-IVA-PLA
           MOVE VLR-RET-EDIT     TO VALOR-RET-PLA
           MOVE FORMA-PAGO-W     TO FORMA-PAGO-PLA
           MOVE DETALLE-W        TO DETALLE-PLA
           MOVE NIVEL-COMB-W     TO NIVEL-COB-PLA
           MOVE BASE-ICAV-W      TO BASE-ICAV-PLA
           MOVE VLR-IVA-1-EDIT   TO VALOR-IVA-1-PLA
           MOVE VLR-IVA-2-EDIT   TO VALOR-IVA-2-PLA
           MOVE VLR-IVA-3-EDIT   TO VALOR-IVA-3-PLA
           MOVE ULT-ITEM-W       TO ULT-ITEM-PLA
           MOVE FECHA-VENCE-W    TO FECHA-VENCE-PLA (1)

           REWRITE REG-PLACAS END-REWRITE.
           CLOSE ARCHIVO-PLACAS.

           IF F1-LLEGAD-W = "S"
              INITIALIZE DAT1-ENV
              GO TO UBICAR-CLIENTE
           END-IF.

       BUSCAR-NUMERO.

           MOVE "F01"         TO LOTE-ULT-MOV-LNK
           MOVE ULT-FECHA-NUM TO FECHA-ULT-MOV-LNK
           

           CALL "CON007" USING NOMBRE-LNK DIRECTORIO-W INVALID-007 DATO-ULT-MOV-LNK SW-INVALID-W MENSAJE-W

           IF INVALID-007 > 0
              MOVE INVALID-007             TO MSJ1-HTML
              MOVE MENSAJE-W               TO MSJ2-HTML
              MOVE DIRECTORIO-W            TO MSJ3-HTML
              GO TO ENVIAR2-ERROR
           END-IF.
           OPEN I-O ARCHIVO-FACTURAS
                    ARCHIVO-FACTURAS2.

       GRABAR-FACTURA.
           INITIALIZE REG-FAC
           MOVE NRO2-ULT-COMP-LNK    TO NRO-FAC.
           READ ARCHIVO-FACTURAS WITH NO LOCK
                INVALID KEY
                        PERFORM LLENAR-TABLA-FACT VARYING I FROM 1 BY 1
                                                       UNTIL I > 30
                        PERFORM LLENAR-FACTU
                        MOVE 00            TO NIVEL-COBRO-FAC
                        MOVE MENSAJE       TO ID-MAQUINA-FAC
                        ACCEPT HORA-ELAB-FAC FROM TIME
                        WRITE REG-FAC END-WRITE
                        OPEN I-O ARCHIVO-PLACAS
                        DELETE ARCHIVO-PLACAS END-DELETE
                        CLOSE ARCHIVO-PLACAS
                NOT INVALID KEY
                        ADD 1 TO NRO2-ULT-COMP-LNK
                        GO TO GRABAR-FACTURA
           END-READ


           CLOSE ARCHIVO-FACTURAS
                 ARCHIVO-FACTURAS2.

           INITIALIZE INVALID-007 MENSAJE-W DATO-ULT-MOV-LNK 

           MOVE "F01"         TO LOTE-ULT-MOV-LNK
           MOVE ULT-FECHA-NUM TO FECHA-ULT-MOV-LNK
           MOVE NRO-FAC       TO NRO2-ULT-COMP-LNK.

           CALL "CON007X" USING NOMBRE-LNK DIRECTORIO-W INVALID-007 MENSAJE-W DATO-ULT-MOV-LNK.

           IF INVALID-007 > 0
              MOVE INVALID-007             TO MSJ1-HTML
              MOVE MENSAJE-W TO MSJ2-HTML
              MOVE DIRECTORIO-W            TO MSJ3-HTML
              GO TO ENVIAR2-ERROR
           END-IF.

       DATOS-MOVIMIENTO.
           MOVE 1        TO ITEM-020-LNK ITEM-030-LNK
           MOVE NRO-FAC  TO NRO-FACT-020-LNK  NRO-FACT-030-LNK DAT1-ENV
           MOVE DIRECTORIO-LLEGAD-W TO DIRECTORIO-W

           INSPECT DIRECTORIO-W REPLACING ALL "/" BY " ".

           INITIALIZE INVALID-INV.    
           CALL  "INV020" USING ADMIN-W NRO-FACT-020-LNK TIPO-020-LNK DIRECTORIO-W NOMBRE-LNK INVALID-INV MENSAJE-LNK
           IF INVALID-INV > 0
              MOVE INVALID-INV        TO MENSAJE1-HTML
              MOVE MENSAJE-LNK        TO MENSAJE2-HTML
              MOVE "INV020"           TO MENSAJE3-HTML
              GO TO ENVIAR-ERROR
           END-IF

           INITIALIZE INVALID-INV MENSAJE-LNK.
           IF INVENT-USU = "S"
              CALL "INV030" USING LLAVE-FACT-030-LNK TIPO-030-LNK DIRECTORIO-W NOMBRE-LNK INVALID-INV MENSAJE-LNK
              IF INVALID-INV > 0
                 MOVE INVALID-INV        TO MENSAJE1-HTML
                 MOVE MENSAJE-LNK        TO MENSAJE2-HTML
                 MOVE "INV030"           TO MENSAJE3-HTML
                 GO TO ENVIAR-ERROR
               END-IF
           END-IF.

       UBICAR-CLIENTE.

           MOVE 00                TO DAT0-ENV.

002147 ENVIO-DATOS.
004378     MOVE "datosrecibidos"  TO COBW3-CNV-NAME
004393     MOVE DATOS-ENVIO       TO COBW3-CNV-VALUE
004403     CALL "COBW3_SET_CNV"   USING COBW3
004413     MOVE "../PAGINAS/RECIBIDOS.ASPX"  TO SALIDA-HTML
004430     PERFORM ABRIR-HTML.

002545 CERRAR-SESION.
002546     CALL "COBW3_FREE" USING COBW3.
002547     MOVE 1 TO PROGRAM-STATUS.
002548     EXIT PROGRAM.
002549
002240 EDITAR-NUMERO.
002241     INSPECT EDITADO-W  CONVERTING  "ABCDEFGHIJKLMNOPQRSTUVWXYZ"
002242                                 TO "                          ". 
002243
002244     MOVE EDITADO-W  TO TABLA-COD1.
002245     INITIALIZE    TABLA-COD2 SW-ALFA.
002246     MOVE 15 TO LP.
002247     PERFORM MOVER-COD VARYING LN FROM 15 BY -1
002248                         UNTIL LN < 1 OR LP < 1.
002249
002250     INSPECT TABLA-COD2 REPLACING ALL " " BY "0".
002251         
002252 MOVER-COD.
002253     IF COD1-PAC (LN) IS NUMERIC
002254     OR COD1-PAC (LN) = "-"     
002255        MOVE COD1-PAC (LN) TO COD2-PAC (LP)
002256        SUBTRACT 1 FROM LP
002257     END-IF.

        LLENAR-TABLA.
           IF TABLA-PLA-W (I) = SPACES OR LOW-VALUES
              CONTINUE
           ELSE
              ADD 1 TO J
              MOVE TABLA-PLA-W (I)  TO TABLA-PLA (J)
           END-IF.

       LLENAR-TABLA-FACT.
           IF LLAVE-ART-PLA (I) = SPACES OR LOW-VALUES
              CONTINUE
           ELSE
               MOVE NRO-FAC TO NRO-FAC2
               MOVE I       TO ITEM-FAC2
               READ ARCHIVO-FACTURAS2 WITH NO LOCK
                    INVALID KEY
                            INITIALIZE LLAVE-ART-FAC2 DATOS-FAC2
                            MOVE LLAVE-ART-PLA (I) TO LLAVE-ART-FAC2
                            MOVE CANTIDAD-PLA  (I) TO CANTIDAD-FAC2
                            MOVE VALOR-PLA     (I) TO VALOR-FAC2
                            WRITE REG-FAC2 END-WRITE
               END-READ
           END-IF.

       LLENAR-FACTU.
           MOVE FECHA-PLA             TO FECHA-FAC
           MOVE PLACA-PLA             TO PLACA-FAC
           MOVE NIT-PLA               TO NIT-FAC
           MOVE VENDEDOR-PLA          TO VENDEDOR-FAC
           MOVE VALOR-DES-PLA         TO VALOR-DES-FAC
           MOVE VALOR-IVA-PLA         TO VALOR-IVA-FAC
           MOVE VALOR-RET-PLA         TO VALOR-RET-FAC
           MOVE FORMA-PAGO-PLA        TO FORMA-PAGO-FAC
           MOVE DETALLE-PLA           TO DETALLE-FAC
           MOVE NIVEL-COB-PLA         TO NIVEL-COBRO-FAC
           MOVE BASE-ICAV-PLA         TO BASE-ICAV-FAC
           MOVE VALOR-IVA-1-PLA       TO VALOR-IVA-1-FAC
           MOVE VALOR-IVA-2-PLA       TO VALOR-IVA-2-FAC
           MOVE VALOR-IVA-3-PLA       TO VALOR-IVA-3-FAC
           MOVE FECHA-VENCE-PLA (1)   TO FECHA-VENCE-FAC (1)
           MOVE VALOR-RET-PLA         TO VLR-VENCE-FAC   (1).


002566 COPY "P:\PROG\PROYECT\FUENTES\SC-WEB.CBL".
002567
