000012* VERIFICA SI LA ISLA Y EL NUMERO DE SURTIDORES EXISTE 
000020 IDENTIFICATION DIVISION.
000021* PROGRAM-ID. "BOM101".
000022
000023 PROGRAM-ID. "HttpExtensionProc".
000024 ENVIRONMENT DIVISION.
000025 CONFIGURATION SECTION.
000026 INPUT-OUTPUT SECTION.
000027 FILE-CONTROL.
000080 COPY "P:\PROG\PROYECT\FUENTES\FS-USUNET.CBL".
000150 COPY "P:\PROG\PROYECT\FUENTES\FS-SESION.CBL".


           SELECT ARCHIVO-USUARIOS LOCK MODE IS AUTOMATIC
                  ASSIGN TO NOM-USUAR-W
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC;
                  RECORD KEY IS NOMBRE-USU
                  ALTERNATE RECORD KEY IS CTL-USU     WITH DUPLICATES
                  ALTERNATE RECORD KEY IS CLAVE-USU   WITH DUPLICATES
                  ALTERNATE RECORD KEY IS CLAVE-2-USU WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.


           SELECT ARCHIVO-CARROS LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-CAR-W
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS PLACA-CAR
                  ALTERNATE RECORD KEY IS PRO-TPROP-CAR WITH DUPLICATES
                  ALTERNATE RECORD KEY IS TIT-TPROP-CAR WITH DUPLICATES
                  ALTERNATE RECORD KEY IS COND-CAR      WITH DUPLICATES
                  ALTERNATE RECORD KEY IS RELEV-CAR     WITH DUPLICATES
                  ALTERNATE RECORD KEY EMPRESA-CAR      WITH DUPLICATES
                  ALTERNATE RECORD KEY CHASIS-CAR       WITH DUPLICATES
                  ALTERNATE RECORD KEY IS INTERNO-CAR   WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.


           SELECT ARCHIVO-PLACAS LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-PLA-W
                  ORGANIZATION INDEXED;
                  ACCESS MODE DYNAMIC;
                  RECORD KEY IS PLACA-PLA
                  FILE STATUS IS OTR-STAT.


           SELECT MAESTRO-ARTICULOS LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-ART-W
                  ORGANIZATION INDEXED;
                  ACCESS MODE  DYNAMIC;
                  RECORD KEY COD-ART
                  ALTERNATE RECORD KEY CLASE-ART       WITH DUPLICATES
                  ALTERNATE RECORD KEY COD-BARRAS-ART  WITH DUPLICATES
                  ALTERNATE RECORD KEY DESCRIP-ART     WITH DUPLICATES
                  ALTERNATE RECORD KEY USO-ART         WITH DUPLICATES
                  ALTERNATE RECORD KEY CL-ROTAC-ART    WITH DUPLICATES
                  ALTERNATE RECORD KEY UBICAC-ART      WITH DUPLICATES
                  ALTERNATE RECORD KEY FECHA-VENCE-ART WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.


005030     SELECT ARCHIVO-JSON
005040            ASSIGN NOM-PLANO-W
005050            ORGANIZATION IS LINE SEQUENTIAL
005060            FILE STATUS IS OTR-STAT.

000390
000400 DATA DIVISION.
000410 FILE SECTION.
000420 COPY "P:\PROG\PROYECT\FUENTES\FD-USUNET.CBL".
000421 COPY "P:\PROG\PROYECT\FUENTES\FD-SESION.CBL".
000450 COPY "P:\PROG\PROYECT\FUENTES\FD-CARRO.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-PLACA.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-ARTIC.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-USUAR.CBL".


005140 FD  ARCHIVO-JSON
005150     LABEL RECORD STANDARD.
005160 01  REG-PLANO.
005170     02 DATOS-PLANO     PIC X(500).

000470
000540 WORKING-STORAGE  SECTION.
000550 COPY "P:\PROG\PROYECT\FUENTES\COBW3.CBL".
000560 COPY "P:\PROG\PROYECT\FUENTES\WEB-CARAC.CBL".

       01 NOM-USUAR-W            PIC X(70).
000570 01 NOM-CAR-W              PIC X(70).
       01 NOM-PLA-W              PIC X(70).
       01 NOM-ART-W              PIC X(70).
       01 NOM-PLANO-W            PIC X(90).
000590 01 EDITADO-W              PIC X(15).
000600 01 COD-USER-W             PIC X(15).
000622 01 CLAVE-CTL              PIC X(15).
000633 01  DATO-W.
000635     02 CLAVE-W            PIC X(15).


       01 VARIABLES.
          02 TAR-W               PIC 99.
          02 VLR-ART-W           PIC S9(13)V99.
          02 BASE-ICAV-W         PIC S9(13)V99.
          02 CANTIDAD-EDIT       PIC ZZZ,ZZZ,ZZZ,ZZZ.ZZ-.
          02 VLR-ART-EDIT        PIC ZZZZ,ZZZ,ZZZ,ZZZ.ZZ-.
          02 BASE-ICAV-EDIT      PIC ZZZZ,ZZZ,ZZZ,ZZZ.ZZ-.
          02 VALOR-BRUTO         PIC S9(12)V99.
          02 VALOR-BASE-IVA      PIC S9(12)V99.
          02 VALOR-BASE-IVA2     PIC S9(12)V99.
          02 VALOR-BASE-IVA3     PIC S9(12)V99.
          02 VALOR-TOTAL         PIC S9(13)V99.
          02 VALOR-EDIT          PIC ZZZ,ZZZ,ZZZ,ZZZ.ZZ-.
          02 VALOR2-EDIT         PIC ZZZZ,ZZZ,ZZZ,ZZZ.ZZ-.


       01 LINEA-LLEGAD-W         PIC X(100).

       01 DATO-LLEGADA-W.
          02 SESION-LLEGAD-W     PIC X(29).
          02 DIRECTORIO-LLEGAD-W PIC X(30).
          02 CARPTA-LLEGAD-W     PIC X(9).
          02 PLACA-W             PIC X(6).


       01 DATOS-ENVIO.
          02 DAT0-ENV            PIC XX.
          02 FILLER              PIC X VALUE "|".
          02 NIVEL-COB-ENV       PIC X(2).
          02 FILLER              PIC X VALUE "|".
          02 VALOR-BRUTO-ENV     PIC X(19).
          02 FILLER              PIC X VALUE "|".
          02 VALOR-IVA-ENV       PIC X(19).
          02 FILLER              PIC X VALUE "|".
          02 VALOR-TOTAL-ENV     PIC X(20).
          02 FILLER              PIC X VALUE "|".
          02 BASE-ICAV-ENV       PIC X(12).
          02 FILLER              PIC X VALUE "|".
          02 NIT-PLA-ENV         PIC X(10).
          02 FILLER              PIC X VALUE "|".
          02 VEND-PLA-ENV        PIC X(5).
          02 FILLER              PIC X VALUE "|".
          02 ULT-ITEM-ENV        PIC XX.
          02 FILLER              PIC X VALUE "|".
          02 OPC-VALID-ENV       PIC X.
          02 FILLER              PIC X VALUE "|".



       01 LIN-1.
          02 FILLER                  PIC X(7)   VALUE "{*COD*:".
          02 FILLER                  PIC X      VALUE "*".
          02 COD-ART-J               PIC X(18).
          02 FILLER                  PIC XX     VALUE "*,".       
          02 FILLER                  PIC X(10)  VALUE "*DESCRIP*:".
          02 FILLER                  PIC X      VALUE "*".
          02 DESCRIP-ART-J           PIC X(50).
          02 FILLER                  PIC XX     VALUE "*,".       
          02 FILLER                  PIC X(6)   VALUE "*ALM*:".
          02 FILLER                  PIC X      VALUE "*".
          02 ALMACEN-ART-J           PIC X(5).
          02 FILLER                  PIC XX     VALUE "*,".       
          02 FILLER                  PIC X(11)  VALUE "*CANTIDAD*:".
          02 FILLER                  PIC X      VALUE "*".
          02 CANTIDAD-ART-J          PIC X(19).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(6)   VALUE "*IVA*:".
          02 FILLER                  PIC X      VALUE "*".
          02 IVA-ART-J               PIC X.
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(8)   VALUE "*VALOR*:".
          02 FILLER                  PIC X      VALUE "*".
          02 VLR-ART-J               PIC X(19).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(7)   VALUE "*BASE*:".
          02 FILLER                  PIC X      VALUE "*".
          02 BASE-ICAV-J             PIC X(19).
003710    02 FILLER                  PIC XX     VALUE "*}".
005040    02 CIERRE-LIN-1            PIC X.


000730 01 COD-TMP.
000740    02 SW-ALFA             PIC 9.
000750    02 TABLA-COD1.
000760       03 COD1-PAC         PIC X OCCURS 15.
000770    02 TABLA-COD2.
000780       03 COD2-PAC         PIC X OCCURS 15.
000790
000791 LINKAGE SECTION.
000792 COPY "P:\PROG\PROYECT\FUENTES\ISAPICTX.CBL".
000793
000794 PROCEDURE DIVISION WITH stdcall LINKAGE USING ISAPI-CTX-CNT.
000795
000810 DECLARATIVES.
000811 I-O-TEST SECTION.
000812     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUNET.         
000813 ESCR-EXCEPTIONES.
000814     IF OTR-STAT = "00"
000815        CONTINUE 
000816     ELSE
000817        MOVE OTR-STAT                TO MSJ1-HTML
000818        MOVE NOM-USU-W               TO MSJ2-HTML
000819        MOVE "INV421"                TO MSJ3-HTML
000820        GO TO ENVIAR2-ERROR
000821     END-IF.
001030
001040 I-O-TEST SECTION.
001050     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SESION.         
001060 ESCR-EXCEPTIONES.
001070     IF OTR-STAT = "00"
001080        CONTINUE
001090     ELSE
001100        MOVE OTR-STAT                TO MSJ1-HTML
001101        MOVE NOM-SESION-W            TO MSJ2-HTML
001102        MOVE "INV421"                TO MSJ3-HTML
001103        GO TO ENVIAR2-ERROR
001104     END-IF.

001040 I-O-TEST SECTION.
001050     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUARIOS.
001060 ESCR-EXCEPTIONES.
001070     IF OTR-STAT = "00"
001080        CONTINUE
001090     ELSE
001100        MOVE OTR-STAT                TO MSJ1-HTML
001101        MOVE NOM-USUAR-W             TO MSJ2-HTML
001102        MOVE "INV421"                TO MSJ3-HTML
001103        GO TO ENVIAR2-ERROR
001104     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-CARROS.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT                TO MSJ1-HTML
006670        MOVE NOM-CAR-W               TO MSJ2-HTML
006680        MOVE "INV421"                TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON MAESTRO-ARTICULOS.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT                TO MSJ1-HTML
006670        MOVE NOM-ART-W               TO MSJ2-HTML
006680        MOVE "INV421"                TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-JSON.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT                TO MSJ1-HTML
006670        MOVE NOM-PLANO-W             TO MSJ2-HTML
006680        MOVE "INV421"                TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.
001105
001150 END DECLARATIVES.
001160
001161 INICIAR-IIS.
001162     MOVE LOW-VALUE TO COBW3.
001163     MOVE FUNCTION ADDR(ISAPI-CTX-CNT) TO COBW3-CONTEXT.
001164     CALL "COBW3_INIT" USING COBW3.
001220
001221 LEER-DATO-HTML.
001852     MOVE "datosh" TO COBW3-SEARCH-DATA.
001853     CALL "COBW3_GET_VALUE" USING COBW3.
001854     MOVE COBW3-GET-DATA    TO LINEA-LLEGAD-W.

           INITIALIZE DATO-LLEGADA-W

           UNSTRING LINEA-LLEGAD-W DELIMITED BY "|"
              INTO SESION-LLEGAD-W, DIRECTORIO-LLEGAD-W, CARPTA-LLEGAD-W, PLACA-W
           END-UNSTRING.

001855     MOVE SESION-LLEGAD-W    TO LLAVE-SESION-W.
           MOVE FUNCTION CURRENT-DATE TO FECHA-TOTAL.
000830     ACCEPT HORA-TOTAL FROM TIME.

001238 INICIAR-SESION.
001245     MOVE "D:\WEB\MAIN-ELECT\DATOS\SC-SESION.DAT" TO NOM-SESION-W
001246
000820     MOVE FUNCTION CURRENT-DATE TO FECHA-TOTAL.
000830     ACCEPT HORA-TOTAL FROM TIME.
000810     GO TO VALIDAR-SESION.
000850
000860 FIN-VALIDAR-SESION.

001303 ABRIR-USUARIO.
001304     MOVE "D:\WEB\MAIN-ELECT\DATOS\SC-ARCHUSU.DAT" TO NOM-USU-W
001305
001306     OPEN INPUT ARCHIVO-USUNET
001307     EVALUATE OTR-STAT
001308       WHEN "00"  CONTINUE
001309       WHEN "35"  OPEN OUTPUT ARCHIVO-USUNET
001310                  CLOSE       ARCHIVO-USUNET
001311                  OPEN I-O    ARCHIVO-USUNET
001312                  INITIALIZE REG-USUNET
001314                  WRITE REG-USUNET
001315                  CLOSE       ARCHIVO-USUNET
001316                  MOVE "Validacion de usuarios"      TO MSJ1-HTML
001317                  MOVE "Falta configurar usuario"    TO MSJ2-HTML
001318                  MOVE "Sc"                          TO MSJ3-HTML
001319                  GO TO ENVIAR2-ERROR
001320       WHEN OTHER GO TO CERRAR-SESION
001321     END-EVALUATE.
001322
001332     INITIALIZE REG-USUNET.

007110 LEER-USUARIO.
007120     READ ARCHIVO-USUNET NEXT AT END MOVE 0 TO SW-FIN.
007130
007140     CLOSE ARCHIVO-USUNET.
007200     
007210     IF NOMBRE-USUNET = SPACES
007220     OR NIT-USUNET = ZEROS
007230        MOVE "Validacion de Sesion"        TO MSJ1-HTML
007240        MOVE "Falta configurar usuarios"   TO MSJ2-HTML
007250        MOVE "Sc"                          TO MSJ3-HTML
007260        GO TO ENVIAR2-ERROR
007270     END-IF.

       INICIAR-RESTRICION.

           INSPECT IP-DATOS-USUNET REPLACING FIRST "/" BY "\"
001614     INITIALIZE NOM-PLA-W NOM-CAR-W NOM-PLANO-W
001615     MOVE "\\" TO NOM-PLA-W NOM-CAR-W NOM-PLANO-W
001616
001617     INSPECT NOM-PLA-W REPLACING FIRST "                    "
001618                                    BY IP-DATOS-USUNET
001621     INSPECT NOM-PLA-W REPLACING FIRST " "
001624                                     BY "\"
007292     INSPECT NOM-PLA-W REPLACING FIRST "                              "
007293                                     BY DIRECTORIO-LLEGAD-W

           MOVE NOM-PLA-W TO NOM-USUAR-W NOM-ART-W

007190     INSPECT NOM-PLA-W REPLACING FIRST "                       "
007200                                    BY "\CONTROL\SC-ARCHPLA.DAT".

           INSPECT NOM-USUAR-W REPLACING FIRST "                       "
                                            BY "\CONTROL\SC-ARCHUSU.DAT".

           INSPECT NOM-ART-W REPLACING FIRST "                       "
                                          BY "\CONTROL\SC-MAESART.DAT".



           INSPECT NOM-CAR-W REPLACING FIRST "                    "
                                          BY IP-DATOS-USUNET
           INSPECT NOM-CAR-W REPLACING FIRST "                         "
                                          BY "\PROG\DATOS\SC-CARROS.DAT".



           MOVE "C:\PROSOFT\TEMP\SC-TABLIVA-XXXXXXXXXXXXXXXXXXXXXXXXXXXXX.JSON" TO  NOM-PLANO-W

           INSPECT NOM-PLANO-W  REPLACING FIRST "XXXXXXXXXXXXXXXXXXXXXXXXXXXXX"
                                             BY SESION-LLEGAD-W.

       ABRIR-USUARIO.

           OPEN INPUT ARCHIVO-USUARIOS.
           READ ARCHIVO-USUARIOS NEXT WITH NO LOCK AT END 
                CLOSE ARCHIVO-USUARIOS
           END-READ.


       ABRIR-CARROS.

           OPEN INPUT ARCHIVO-CARROS.

           MOVE PLACA-W         TO PLACA-CAR

           READ ARCHIVO-CARROS WITH NO LOCK
                INVALID KEY 
                           MOVE "99"              TO MSJ1-HTML
                           MOVE "Carro no existe" TO MSJ2-HTML
                           MOVE "INV421"          TO MSJ3-HTML
                           GO TO ENVIAR2-ERROR
           END-READ.

           CLOSE ARCHIVO-CARROS.

       ABRIR-PLACAS.
           OPEN INPUT ARCHIVO-PLACAS.

           INITIALIZE REG-PLACAS
           MOVE "0"  TO OPC-VALID-ENV
           MOVE PLACA-CAR   TO PLACA-PLA

           READ ARCHIVO-PLACAS WITH NO LOCK
                INVALID KEY
                        MOVE "1" TO OPC-VALID-ENV
                        CLOSE ARCHIVO-PLACAS
                        OPEN I-O ARCHIVO-PLACAS
                        WRITE REG-PLACAS END-WRITE
                        OPEN INPUT ARCHIVO-PLACAS
           END-READ

           CLOSE ARCHIVO-PLACAS.

           INITIALIZE VARIABLES.

           IF NIT-ADMON-CAR > 0
              MOVE NIT-ADMON-CAR TO NIT-PLA
           END-IF.

           IF NIVEL-COB-PLA IS ZERO
      *        MOVE 1 TO I K
              MOVE 1 TO OPC-VALID-ENV
              GO TO UBICAR-CLIENTE
           ELSE
              COMPUTE I = NIVEL-COB-PLA + 1
           END-IF.

      *     IF I < 12 MOVE  1 TO K.
      *     IF I > 11 COMPUTE K = I - 11.

           OPEN OUTPUT ARCHIVO-JSON.
           OPEN INPUT MAESTRO-ARTICULOS.
           

           INITIALIZE REG-PLANO.
           MOVE "{*TABLA-IVA*:[" TO  DATOS-PLANO
           INSPECT DATOS-PLANO REPLACING ALL "*" BY CARAC-COMILLA
           WRITE REG-PLANO.

           PERFORM LLENAR-TABLA-IVA VARYING J FROM 1 BY 1
                                             UNTIL J > 30.

           INITIALIZE COD-ART-J DESCRIP-ART-J ALMACEN-ART-J CANTIDAD-ART-J 
                      IVA-ART-J VLR-ART-J BASE-ICAV-J CIERRE-LIN-1.

           INSPECT LIN-1 REPLACING ALL "*" BY CARAC-COMILLA

           MOVE LIN-1 TO DATOS-PLANO
           WRITE REG-PLANO END-WRITE

           MOVE "]}"      TO DATOS-PLANO
           WRITE REG-PLANO END-WRITE

           CLOSE ARCHIVO-JSON
                 MAESTRO-ARTICULOS.


           COMPUTE VALOR-IVA-1-PLA ROUNDED = (VALOR-BASE-IVA  * IVA-USU   / 100 )

           COMPUTE VALOR-IVA-2-PLA ROUNDED = (VALOR-BASE-IVA2 * IVA-2-USU   / 100 ).

           COMPUTE VALOR-IVA-3-PLA ROUNDED = (VALOR-BASE-IVA3 * IVA-3-USU   / 100 ).

           COMPUTE VALOR-IVA-PLA ROUNDED =  VALOR-IVA-1-PLA + VALOR-IVA-2-PLA + VALOR-IVA-3-PLA.


           COMPUTE VALOR-TOTAL =  VALOR-BRUTO - VALOR-DES-PLA +  VALOR-IVA-PLA   - VALOR-RET-PLA.

       UBICAR-CLIENTE.

           MOVE 00                TO DAT0-ENV
           MOVE NIVEL-COB-PLA     TO NIVEL-COB-ENV

           MOVE VALOR-BRUTO       TO VALOR-EDIT
           MOVE VALOR-EDIT        TO VALOR-BRUTO-ENV

           MOVE BASE-ICAV-PLA     TO BASE-ICAV-ENV

           MOVE VALOR-IVA-PLA     TO VALOR-EDIT
           MOVE VALOR-EDIT        TO VALOR-IVA-ENV

           MOVE VALOR-TOTAL       TO VALOR2-EDIT
           MOVE VALOR2-EDIT       TO VALOR-TOTAL-ENV


           MOVE NIT-PLA           TO NIT-PLA-ENV
           MOVE VENDEDOR-PLA      TO VEND-PLA-ENV.



002147 ENVIO-DATOS.
004378     MOVE "datosrecibidos"  TO COBW3-CNV-NAME
004393     MOVE DATOS-ENVIO       TO COBW3-CNV-VALUE
004403     CALL "COBW3_SET_CNV"   USING COBW3
004413     MOVE "../PAGINAS/RECIBIDOS.ASPX"  TO SALIDA-HTML
004430     PERFORM ABRIR-HTML.

002545 CERRAR-SESION.
002546     CALL "COBW3_FREE" USING COBW3.
002547     MOVE 1 TO PROGRAM-STATUS.
002548     EXIT PROGRAM.
002549
002240 EDITAR-NUMERO.
002241     INSPECT EDITADO-W  CONVERTING  "ABCDEFGHIJKLMNOPQRSTUVWXYZ"
002242                                 TO "                          ".
002243
002244     MOVE EDITADO-W  TO TABLA-COD1.
002245     INITIALIZE    TABLA-COD2 SW-ALFA.
002246     MOVE 15 TO LP.
002247     PERFORM MOVER-COD VARYING LN FROM 15 BY -1
002248                         UNTIL LN < 1 OR LP < 1.
002249
002250     INSPECT TABLA-COD2 REPLACING ALL " " BY "0".
002251         
002252 MOVER-COD.
002253     IF COD1-PAC (LN) IS NUMERIC
002254     OR COD1-PAC (LN) = "-"     
002255        MOVE COD1-PAC (LN) TO COD2-PAC (LP)
002256        SUBTRACT 1 FROM LP
002257     END-IF.

       LLENAR-TABLA-IVA.
           IF GRUPO-PLA (J) = SPACES OR LOW-VALUES OR ALMACEN-PLA (J) = SPACES OR LOW-VALUES
              INITIALIZE AUTORET-ART
           ELSE
             MOVE COD-ART-PLA (J) TO COD-ART
             READ MAESTRO-ARTICULOS WITH NO LOCK
                  INVALID KEY 
                          MOVE "- CODIGO NO EXISTE -  "  TO DESCRIP-ART
                          MOVE 0 TO IVA-ART
             END-READ

             IF IVA-ART = "S" MOVE 1 TO IVA-ART END-IF
             IF IVA-ART = "N" MOVE 0 TO IVA-ART END-IF

             IF IVA-S-USU = "C"
                MOVE IVA-ART TO IVA-ART-J
             ELSE
                MOVE 0       TO IVA-ART-J
             END-IF

             EVALUATE IVA-ART-J
               WHEN 0 MOVE 0         TO TAR-W
               WHEN 1 MOVE IVA-USU   TO TAR-W
               WHEN 2 MOVE IVA-2-USU TO TAR-W
               WHEN 3 MOVE IVA-3-USU TO TAR-W
             END-EVALUATE

             IF ASUME-IVA-USU = "S"
                COMPUTE VLR-ART-W ROUNDED = VALOR-PLA (J) * (100 + TAR-W) / 100
             ELSE
                MOVE VALOR-PLA (J) TO VLR-ART-W
             END-IF


             MOVE COD-ART      TO COD-ART-J
             INSPECT COD-ART-J REPLACING ALL "*" BY "x"
             INSPECT COD-ART-J REPLACING ALL '"' BY " "
             INSPECT COD-ART-J REPLACING ALL "'" BY " "


             MOVE DESCRIP-ART          TO DESCRIP-ART-J
             INSPECT DESCRIP-ART-J     REPLACING ALL "*" BY "x"
             INSPECT DESCRIP-ART-J     REPLACING ALL "\" BY "/"
             INSPECT DESCRIP-ART-J     REPLACING ALL CARAC-COMILLA BY "p"

             MOVE ALMACEN-PLA (J)      TO ALMACEN-ART-J
             MOVE CANTIDAD-PLA (J)     TO CANTIDAD-EDIT
             MOVE CANTIDAD-EDIT        TO CANTIDAD-ART-J
             MOVE VLR-ART-W            TO VLR-ART-EDIT
             MOVE VLR-ART-EDIT         TO VLR-ART-J

             IF GRUPO-PLA (I) = 01 AND AUTORET-ART > 0
                COMPUTE BASE-ICAV-W  ROUNDED = (VALOR-PLA (J) * AUTORET-ART) / 100
             ELSE
                INITIALIZE BASE-ICAV-W
             END-IF

             MOVE BASE-ICAV-W    TO BASE-ICAV-EDIT
             MOVE BASE-ICAV-EDIT TO BASE-ICAV-J

             MOVE ","               TO CIERRE-LIN-1
             INSPECT LIN-1 REPLACING ALL "*" BY CARAC-COMILLA

             MOVE LIN-1 TO DATOS-PLANO
             WRITE REG-PLANO END-WRITE


             IF ASUME-IVA-USU = "S"
                COMPUTE VALOR-PLA (J) ROUNDED = VLR-ART-W  / (100 + TAR-W) * 100
             ELSE
                MOVE VLR-ART-W  TO VALOR-PLA (J)
             END-IF

             ADD VALOR-PLA (J)     TO VALOR-BRUTO

             EVALUATE IVA-ART-J
                 WHEN 1 ADD VALOR-PLA (J)   TO VALOR-BASE-IVA
                 WHEN 2 ADD VALOR-PLA (J)   TO VALOR-BASE-IVA2
                 WHEN 3 ADD VALOR-PLA (J)   TO VALOR-BASE-IVA3
             END-EVALUATE

             IF VALOR-PLA (J) > 0 
                ADD VALOR-PLA (J)    TO BASE-ICAV-PLA
             END-IF
           END-IF.           

002566 COPY "P:\PROG\PROYECT\FUENTES\SC-WEB.CBL".
002567
