000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. INV808F.
000030*   INVENTARIO VALORIZADO CON CORTE A FECHA PARCIAL..
000040
000050 ENVIRONMENT     DIVISION.
000060 INPUT-OUTPUT SECTION.
000070 FILE-CONTROL.
000080
000190     SELECT ARCHIVO-USUARIOS LOCK MODE IS AUTOMATIC
000200            ASSIGN NOM-USUAR-W
000210            ORGANIZATION IS INDEXED
000220            ACCESS MODE IS DYNAMIC;
000230            RECORD KEY IS NOMBRE-USU
000240            ALTERNATE RECORD KEY IS CTL-USU     WITH DUPLICATES
000250            ALTERNATE RECORD KEY IS CLAVE-USU   WITH DUPLICATES
000260            ALTERNATE RECORD KEY IS CLAVE-2-USU WITH DUPLICATES
000270            FILE STATUS IS OTR-STAT.
000271
000272
000275     SELECT MOVIMIENTO-INVENT LOCK MODE IS AUTOMATIC
000276            ASSIGN NOM-INVENT-W
000277            ORGANIZATION IS INDEXED;
000278            ACCESS MODE IS DYNAMIC
000279            RECORD KEY IS LLAVE-INV
000280            ALTERNATE RECORD KEY COD-ART-INV       WITH DUPLICATES
000281            ALTERNATE RECORD KEY SECUENCIA-INV
000282            ALTERNATE RECORD KEY NIT-INV           WITH DUPLICATES
000283            ALTERNATE RECORD KEY FECHA-INV         WITH DUPLICATES
000284            ALTERNATE RECORD KEY LLAVE-DOC-CTL-INV WITH DUPLICATES
000285            FILE STATUS IS OTR-STAT.
000290
000291
000292     SELECT ARCHIVO-SALDOS LOCK MODE IS AUTOMATIC
000293            ASSIGN NOM-SALDOS-W
000294            ORGANIZATION INDEXED;
000295            ACCESS MODE  DYNAMIC;
000296            RECORD KEY LLAVE-SAL
000297            ALTERNATE RECORD KEY COD-ART-SAL  WITH DUPLICATES
000298            ALTERNATE RECORD KEY COD-LOTE-SAL WITH DUPLICATES
000299            FILE STATUS IS OTR-STAT.
000300
000301
000302
000303 DATA DIVISION.
000304 FILE SECTION.
000310 COPY "P:\PROG\PROYECT\FUENTES\FD-USUAR.CBL".
000320 COPY "P:\PROG\PROYECT\FUENTES\FD-INVEN.CBL".
000330 COPY "P:\PROG\PROYECT\FUENTES\FD-SALDO.CBL".
000380
000390 WORKING-STORAGE SECTION.
000400 COPY "P:\PROG\PROYECT\FUENTES\WEB-CARAC.CBL".
000410 
000411 77 NOM-USUAR-W                     PIC X(70).
000412 77 NOM-INVENT-W                    PIC X(70).
000413 77 NOM-SALDOS-W                    PIC X(70).
000414 77 MES-ACT-W                       PIC X(4).
000415 77 SDO-ACT-CANT                    PIC S9(12)V99.
000416 77 SDO-ACT-VLR                     PIC S9(12)V99.
000417
000418
001320
001330 LINKAGE SECTION.
001340 01  LLAVE-W.
001341     02  LOCAL-W      PIC X(5).
001342     02  CTA-W.
001343         05 TIPO-W    PIC 9.
001344         05 GRUPO-W   PIC XX.
001345         05 NUMERO-W  PIC X(13).
001346         05 CLASE-W   PIC XX.
001347     02  COD-LOTE-W   PIC 9(9).
001348 01  SDO-ACT-W        PIC S9(12)V999.
001349 01  FECHA-W.
001350     02 ANO-W         PIC 9(4).
001351     02 MES-W         PIC 9(2).
001352     02 DIA-W         PIC 9(2).
001353 01 DIRECTORIO-W      PIC X(50).
001373 01 MENSAJE-LNK       PIC X(30).
001383 01 INVALID-INV       PIC 99. 
001430 
001450 PROCEDURE DIVISION USING LLAVE-W SDO-ACT-W FECHA-W DIRECTORIO-W MENSAJE-LNK INVALID-INV.
001460
001470 DECLARATIVES.
001480 I-O-TEST SECTION.
001490     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUARIOS.
001500
001510 ESCR-EXCEPTIONES.
001520     IF OTR-STAT = "00"
001530        CONTINUE      
001540     ELSE
001550        MOVE OTR-STAT             TO INVALID-INV    
001560        MOVE "ARCHIVO-USUARIOS"   TO MENSAJE-LNK
001570        GO TO SALIR     
001580     END-IF.
001590
001600 I-O-TEST SECTION.
001610     USE AFTER EXCEPTION PROCEDURE ON MOVIMIENTO-INVENT.
001620
001630 ESCR-EXCEPTIONES.
001640     IF OTR-STAT = "00"
001650        CONTINUE      
001660     ELSE
001670        MOVE OTR-STAT             TO INVALID-INV       
001680        MOVE "MOVIMIENTO-INVENT"  TO MENSAJE-LNK   
001690        GO TO SALIR     
001700     END-IF.
001710
001720 I-O-TEST SECTION.
001730     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SALDOS.
001740
001750 ESCR-EXCEPTIONES.
001760     IF OTR-STAT = "00"
001770        CONTINUE      
001780     ELSE
001790        MOVE OTR-STAT            TO INVALID-INV      
001800        MOVE "ARCHIVO-SALDOS"    TO MENSAJE-LNK    
001810        GO TO SALIR     
001820     END-IF.
001830
002200 END DECLARATIVES.
002210 PROCEDURAL SECTION.
002220
002230 ACOMODAR-NOMBRES.
002240     MOVE DIRECTORIO-W TO NOM-USUAR-W NOM-INVENT-W NOM-SALDOS-W.
002241
002242     INSPECT NOM-USUAR-W REPLACING FIRST "                       "
002243                                    BY "\CONTROL\SC-ARCHUSU.DAT".
002244
002245
002250     EVALUATE MES-W
002260         WHEN "01" MOVE "\ENE"   TO MES-ACT-W
002270         WHEN "02" MOVE "\FEB"   TO MES-ACT-W
002280         WHEN "03" MOVE "\MAR"   TO MES-ACT-W
002290         WHEN "04" MOVE "\ABR"   TO MES-ACT-W
002300         WHEN "05" MOVE "\MAY"   TO MES-ACT-W
002310         WHEN "06" MOVE "\JUN"   TO MES-ACT-W
002320         WHEN "07" MOVE "\JUL"   TO MES-ACT-W
002330         WHEN "08" MOVE "\AGT"   TO MES-ACT-W
002340         WHEN "09" MOVE "\SEP"   TO MES-ACT-W
002350         WHEN "10" MOVE "\OCT"   TO MES-ACT-W
002360         WHEN "11" MOVE "\NOV"   TO MES-ACT-W
002370         WHEN "12" MOVE "\DIC"   TO MES-ACT-W
002380     END-EVALUATE.     
002390
002391     INSPECT NOM-INVENT-W REPLACING FIRST "    " BY MES-ACT-W
002392
002393     INSPECT NOM-INVENT-W REPLACING FIRST "              "
002400                                       BY "\SC-MOVINV.DAT".
002401
002402     MOVE NOM-INVENT-W  TO NOM-SALDOS-W
002403
002404     INSPECT NOM-SALDOS-W REPLACING FIRST "SC-MOVINV.DAT"
002405                                       BY "SC-SALDO.DAT ".
002406
002416
002883 LEER-USUARIO.
002893     OPEN INPUT ARCHIVO-USUARIOS.
002910     READ ARCHIVO-USUARIOS NEXT WITH NO LOCK AT END 
002911          MOVE 0 TO SW-FIN
002912     END-READ.
002930     CLOSE ARCHIVO-USUARIOS.
002940
002950 ABRIR-ARCHIVOS.
002951     OPEN INPUT  MOVIMIENTO-INVENT
002952                 ARCHIVO-SALDOS.
002953     INITIALIZE REG-SALDOS SDO-ACT-W LN COD-LOTE-W.
002955
002971     MOVE LLAVE-W TO LLAVE-SAL
002972     READ ARCHIVO-SALDOS WITH NO LOCK
002973          INVALID KEY INITIALIZE DATOS-SAL
002978     END-READ.
002979
002980     GO TO ARRANCAR-MOVIMIENTO.
002981
002982 LEER-MOVIM.
002983     READ ARCHIVO-SALDOS NEXT WITH NO LOCK AT END GO TO ARRANCAR-MOVIMIENTO.
002985
002986     IF COD-ALM-SAL = "ALM01"
002987        IF COD-ART-SAL =  CTA-W
002988           MOVE "66"                TO INVALID-INV    
002989           MOVE LLAVE-SAL   TO MENSAJE-LNK
002990           GO TO SALIR
002991        END-IF
002992     ELSE
002993        GO TO LEER-MOVIM
002994     END-IF
002996
003001     GO TO LEER-MOVIM.
003004
003005 ARRANCAR-MOVIMIENTO.
003006     INITIALIZE ACUM-ENT-CANT (1)
003007                ACUM-ENT-VLR  (1)
003008                ACUM-SAL-CANT (1)
003009                ACUM-SAL-VLR  (1).
003010
003011     MOVE LLAVE-SAL TO LLAVE-ART-INV.
003012     START MOVIMIENTO-INVENT KEY = LLAVE-ART-INV
003013           INVALID KEY GO TO MOSTRAR-SALDO
003018     END-START.
003019
003021 LEER-MOVIMIENTO.
003022     READ MOVIMIENTO-INVENT NEXT WITH NO LOCK AT END GO TO MOSTRAR-SALDO.
003023
003024
003025     IF LLAVE-SAL = LLAVE-ART-INV
003026        CONTINUE
003027     ELSE
003028        GO TO MOSTRAR-SALDO
003029     END-IF
003030
003031     IF  FECHA-INV > FECHA-W GO TO MOSTRAR-SALDO.
003032
003033     IF COD1-TRANS-INV > 1
003034        ADD CANT-INV TO ACUM-SAL-CANT (1)
003035        ADD VLR-INV  TO ACUM-SAL-VLR  (1)
003036     ELSE
003037        ADD CANT-INV TO ACUM-ENT-CANT (1)
003038        ADD VLR-INV  TO ACUM-ENT-VLR  (1)
003039     END-IF
003040
003041
003042     GO TO LEER-MOVIMIENTO.
003043
003044
003045 MOSTRAR-SALDO.
003046
003047     COMPUTE SDO-ACT-CANT = ACUM-ENT-CANT (32)
003048                          + ACUM-ENT-CANT (1)
003049                          - ACUM-SAL-CANT (1).
003050
003051     COMPUTE SDO-ACT-VLR = ACUM-ENT-VLR (32)
003052                         + ACUM-ENT-VLR (1)
003053                         - ACUM-SAL-VLR (1).
003054
003055
003056     ADD SDO-ACT-CANT  TO SDO-ACT-W.
003057
003058
007720 CERRAR-ARCHIVOS.
007730     CLOSE MOVIMIENTO-INVENT
007731           ARCHIVO-SALDOS.
007740
007760
007770 SALIR.
007780     EXIT PROGRAM.
007790
007800 SALIR2.
007810     STOP RUN.
007820
