004820*=================================================================
004830* CREA ARCHIVO JSON PARA VENTANA SALDOS 
004840*=================================================================
004850 IDENTIFICATION DIVISION.
004860 PROGRAM-ID. "HttpExtensionProc".
004870 ENVIRONMENT DIVISION.
004880 CONFIGURATION SECTION.
004890 INPUT-OUTPUT SECTION.
004900 FILE-CONTROL.
004910     COPY "P:\PROG\PROYECT\FUENTES\FS-USUNET.CBL".
004920     COPY "P:\PROG\PROYECT\FUENTES\FS-SESION.CBL".
004930
000170     SELECT ARCHIVO-USUARIOS LOCK MODE IS AUTOMATIC
000180            ASSIGN NOM-USUAR-W
000190            ORGANIZATION IS INDEXED
000200            ACCESS MODE IS DYNAMIC;
000210            RECORD KEY IS NOMBRE-USU
000220            ALTERNATE RECORD KEY IS CTL-USU     WITH DUPLICATES
000230            ALTERNATE RECORD KEY IS CLAVE-USU   WITH DUPLICATES
000240            ALTERNATE RECORD KEY IS CLAVE-2-USU WITH DUPLICATES
000250            FILE STATUS IS OTR-STAT.


000349     SELECT MAESTRO-ARTICULOS LOCK MODE IS AUTOMATIC
000350            ASSIGN NOM-ART-W
000351            ORGANIZATION INDEXED;
000352            ACCESS MODE  DYNAMIC;
000353            RECORD KEY COD-ART
000354            ALTERNATE RECORD KEY CLASE-ART       WITH DUPLICATES
000355            ALTERNATE RECORD KEY COD-BARRAS-ART  WITH DUPLICATES
000356            ALTERNATE RECORD KEY DESCRIP-ART     WITH DUPLICATES
000357            ALTERNATE RECORD KEY USO-ART         WITH DUPLICATES
000358            ALTERNATE RECORD KEY CL-ROTAC-ART    WITH DUPLICATES
000359            ALTERNATE RECORD KEY UBICAC-ART      WITH DUPLICATES
000360            ALTERNATE RECORD KEY FECHA-VENCE-ART WITH DUPLICATES
000361            FILE STATUS IS OTR-STAT.

           SELECT ARCHIVO-SALDOS LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-SAL-W
                  ORGANIZATION INDEXED;
                  ACCESS MODE  DYNAMIC;
                  RECORD KEY LLAVE-SAL
                  ALTERNATE RECORD KEY COD-ART-SAL  WITH DUPLICATES
                  ALTERNATE RECORD KEY COD-LOTE-SAL WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.

005020
005030     SELECT ARCHIVO-JSON
005040            ASSIGN NOM-PLANO-W
005050            ORGANIZATION IS LINE SEQUENTIAL
005060            FILE STATUS IS OTR-STAT.
005070
005080 DATA DIVISION.
005090 FILE SECTION.
005100 COPY "P:\PROG\PROYECT\FUENTES\FD-USUNET.CBL".
005110 COPY "P:\PROG\PROYECT\FUENTES\FD-SESION.CBL".
000690 COPY "P:\PROG\PROYECT\FUENTES\FD-USUAR.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-ARTIC.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-SALDO.CBL".


005140 FD  ARCHIVO-JSON
005150     LABEL RECORD STANDARD.
005160 01  REG-PLANO.
005170     02 DATOS-PLANO     PIC X(500).
005180
005190 WORKING-STORAGE SECTION.
005200 COPY "P:\PROG\PROYECT\FUENTES\COBW3.CBL".
005210 COPY "P:\PROG\PROYECT\FUENTES\WEB-CARAC.CBL".
005220 
       77 NOM-ART-W                 PIC X(70).
       77 NOM-PLANO-W               PIC X(90).
       77 NOM-USUAR-W               PIC X(70).
       77 NOM-SAL-W                 PIC X(70).
       77 NUMERO-EDIT               PIC ZZZZZZZZZZZZZ.ZZ.
       77 VR-VENTA1-EDIT            PIC ZZZZZZZZZZZZ.ZZ.
       77 VLR-UNIT                  PIC 9(9)V99.
       77 VLR-UNIT-EDIT             PIC ZZZZZZZZZ.ZZ.


       01 LINEA-LLEGAD-W             PIC X(100).

       01 DATO-LLEGADA-W.
          02 SESION-LLEGAD-W        PIC X(29).
          02 DIRECTORIO-LLEGAD-W    PIC X(30).
          02 CARPTA-LLEGAD-W        PIC X(5).

       01 LLAVE-W.
          02 LOCAL-W      PIC X(5).
          02 CTA-W.
             05 TIPO-W    PIC 9.
             05 GRUPO-W   PIC XX.
             05 NUMERO-W  PIC X(13).
             05 CLASE-W   PIC XX.
          02 COD-LOTE-W   PIC X(4).

       01 LIN-1.
          02 FILLER                  PIC X(10)  VALUE "{*OTROS1*:".
          02 FILLER                  PIC X      VALUE "*".
          02 OTROS1-J                PIC X(50).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(6)   VALUE "*USO*:".
          02 FILLER                  PIC X      VALUE "*".
          02 USO-J                   PIC XX.
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(11)  VALUE "*VR-VENT1*:".
          02 FILLER                  PIC X      VALUE "*".
          02 VR-VENTA1-ART-J         PIC X(15).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(15)  VALUE "*SDO-ANT-CANT*:".
          02 FILLER                  PIC X      VALUE "*".
          02 SDO-ANT-CANT-J          PIC X(16).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(16)  VALUE "*ACUM-ENT-CANT*:".
          02 FILLER                  PIC X      VALUE "*".
          02 ACUM-ENT-CANT-J         PIC X(16).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(16)  VALUE "*ACUM-SAL-CANT*:".
          02 FILLER                  PIC X      VALUE "*".
          02 ACUM-SAL-CANT-J         PIC X(16).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(15)  VALUE "*SDO-ACT-CANT*:".
          02 FILLER                  PIC X      VALUE "*".
          02 SDO-ACT-CANT-J          PIC X(16).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(14)  VALUE "*VLR-REF-ART*:".
          02 FILLER                  PIC X      VALUE "*".
          02 VLR-REF-ART-J           PIC X(15).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(11)  VALUE "*VLR-UNIT*:".
          02 FILLER                  PIC X      VALUE "*".
          02 VLR-UNIT-J              PIC X(16).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(14)  VALUE "*COD-LOT-SAL*:".
          02 FILLER                  PIC X      VALUE "*".
          02 COD-LOT-SAL-J           PIC X(5).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(14)  VALUE "*COD-ALM-SAL*:".
          02 FILLER                  PIC X      VALUE "*".
          02 COD-ALM-SAL-J           PIC X(5).
003710    02 FILLER                  PIC XX     VALUE "*}".
005040    02 CIERRE-LIN-1            PIC X.



006310 LINKAGE SECTION.
006320 COPY "P:\PROG\PROYECT\FUENTES\ISAPICTX.CBL".
006330 PROCEDURE DIVISION WITH stdcall LINKAGE USING ISAPI-CTX-CNT.
006340
006350 DECLARATIVES.
002570 I-O-TEST SECTION.
002580     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUARIOS.         
002590 ESCR-EXCEPTIONES.
002600     IF OTR-STAT = "00" 
002610        CONTINUE 
002620     ELSE
002630        MOVE OTR-STAT         TO MENSAJE1-HTML
002640        MOVE NOM-USUAR-W      TO MENSAJE2-HTML
002650        MOVE "INV808"         TO MENSAJE3-HTML
002660        GO TO MOSTRAR-ERROR
002670     END-IF.

006360 I-O-TEST SECTION.
006370     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUNET.         
006380 ESCR-EXCEPTIONES.
006390     IF OTR-STAT = "00"
006400        CONTINUE 
006410     ELSE
006420        MOVE OTR-STAT         TO MENSAJE1-HTML
006430        MOVE NOM-USU-W        TO MENSAJE2-HTML
006440        MOVE "INV808"         TO MENSAJE3-HTML
006450        GO TO ENVIAR-ERROR
006460     END-IF.
006470
006480 I-O-TEST SECTION.
006490     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SESION.
006500 ESCR-EXCEPTIONES.
006510     IF OTR-STAT = "00" 
006520        CONTINUE 
006530     ELSE
006540        MOVE OTR-STAT         TO MENSAJE1-HTML
006550        MOVE NOM-SESION-W     TO MENSAJE2-HTML
006560        MOVE "INV808"         TO MENSAJE3-HTML
006570        GO TO ENVIAR-ERROR
006580     END-IF.
006590  

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON MAESTRO-ARTICULOS.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MENSAJE1-HTML
006670        MOVE NOM-ART-W        TO MENSAJE2-HTML
006680        MOVE "INV808"         TO MENSAJE3-HTML
006690        GO TO ENVIAR-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SALDOS.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MENSAJE1-HTML
006670        MOVE NOM-SAL-W        TO MENSAJE2-HTML
006680        MOVE "INV808"         TO MENSAJE3-HTML
006690        GO TO ENVIAR-ERROR
006700     END-IF.

006590  
006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-JSON.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" OR "35"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MENSAJE1-HTML
006670        MOVE NOM-PLANO-W      TO MENSAJE2-HTML
006680        MOVE "INV808"         TO MENSAJE3-HTML
006690        GO TO ENVIAR-ERROR
006700     END-IF.
006710
006720  END DECLARATIVES.
006730
006740 INICIAR-IIS.
006750     MOVE LOW-VALUE TO COBW3.
006760     MOVE FUNCTION ADDR(ISAPI-CTX-CNT) TO COBW3-CONTEXT.
006770     CALL "COBW3_INIT" USING COBW3.
006780
006790 LEER-DATO-HTML.
006800     MOVE "datosh" TO COBW3-SEARCH-DATA.
006810     CALL "COBW3_GET_VALUE" USING COBW3.
006820     MOVE COBW3-GET-DATA    TO LINEA-LLEGAD-W.

           INITIALIZE DATO-LLEGADA-W

           UNSTRING LINEA-LLEGAD-W DELIMITED BY "|"
              INTO SESION-LLEGAD-W, DIRECTORIO-LLEGAD-W, CARPTA-LLEGAD-W, LLAVE-W
           END-UNSTRING.

           MOVE SESION-LLEGAD-W    TO LLAVE-SESION-W.
           MOVE FUNCTION CURRENT-DATE TO FECHA-TOTAL.
           ACCEPT HORA-TOTAL FROM TIME.

000797 INICIAR-SESION.
000806     MOVE "D:\WEB\MAIN-ELECT\DATOS\SC-SESION.DAT" TO NOM-SESION-W
000810     GO TO VALIDAR-SESION.
000850
000860 FIN-VALIDAR-SESION.
006840     
006900 ABRIR-USUARIO.
006910     INITIALIZE OTR-STAT.
006920     MOVE "D:\WEB\MAIN-ELECT\DATOS\SC-ARCHUSU.DAT" TO NOM-USU-W
006930
006940     OPEN INPUT ARCHIVO-USUNET
006950     EVALUATE OTR-STAT
006960       WHEN "00"  CONTINUE
006970       WHEN "35"  OPEN OUTPUT ARCHIVO-USUNET
006980                  INITIALIZE REG-USUNET
006990                  WRITE REG-USUNET
007000                  CLOSE ARCHIVO-USUNET
007010                  MOVE "Validacion de Usuario"       TO MENSAJE1-HTML
007020                  MOVE "Falta configurar usuarios"   TO MENSAJE2-HTML
007030                  MOVE "Sc"                          TO MENSAJE3-HTML
007040                  GO TO ENVIAR-ERROR
007050       WHEN OTHER GO TO CERRAR-SESION
007060     END-EVALUATE.
007070
007080     INITIALIZE LLAVE-USUNET.

007110 LEER-USUARIO.
007120     READ ARCHIVO-USUNET NEXT AT END MOVE 0 TO SW-FIN.
007130
007140     CLOSE ARCHIVO-USUNET.
007200     
007210     IF NOMBRE-USUNET = SPACES
007220     OR NIT-USUNET = ZEROS
007230        MOVE "Validacion de Sesion"        TO MENSAJE1-HTML
007240        MOVE "Falta configurar usuarios"   TO MENSAJE2-HTML
007250        MOVE "Sc"                          TO MENSAJE3-HTML
007260        GO TO ENVIAR-ERROR
007270     END-IF.
007280 
007350
       ASIGNAR-NOMBRES.

           INITIALIZE NOM-PLANO-W NOM-USUAR-W 


           INSPECT IP-DATOS-USUNET REPLACING FIRST "/" BY "\"
007287     MOVE "\\" TO NOM-USUAR-W
007288     INSPECT NOM-USUAR-W REPLACING FIRST "                    "
007289                                    BY IP-DATOS-USUNET
007290     INSPECT NOM-USUAR-W REPLACING FIRST " "
007291                                    BY "\"
007292     INSPECT NOM-USUAR-W REPLACING FIRST "                              "
007293                                    BY DIRECTORIO-LLEGAD-W
007294     INSPECT NOM-USUAR-W REPLACING FIRST "                       "
007295                                      BY "\CONTROL\SC-ARCHUSU.DAT".

           MOVE NOM-USUAR-W    TO NOM-ART-W NOM-SAL-W

           INSPECT NOM-ART-W REPLACING FIRST "SC-ARCHUSU.DAT"
                                          BY "SC-MAESART.DAT".

           INSPECT NOM-SAL-W REPLACING FIRST "SC-ARCHUSU.DAT"
                                          BY "SC-SALDO.DAT  ".



           MOVE "C:\PROSOFT\TEMP\SC-SDOACT-XXXXXXXXXXXXXXXXXXXXXXXXXXXXX.JSON" TO  NOM-PLANO-W

           INSPECT NOM-PLANO-W  REPLACING FIRST "XXXXXXXXXXXXXXXXXXXXXXXXXXXXX"
                                             BY SESION-LLEGAD-W.

        ABRIR-USUARIOS.

           OPEN INPUT ARCHIVO-USUARIOS
           READ ARCHIVO-USUARIOS NEXT WITH NO LOCK AT END 
                CLOSE ARCHIVO-USUARIOS
           END-READ.

       ABRIR-ARTICULOS.
           OPEN INPUT MAESTRO-ARTICULOS.

           MOVE CTA-W TO COD-ART.
           READ MAESTRO-ARTICULOS WITH NO LOCK
                INVALID KEY INITIALIZE DATOS-ART
           END-READ
           CLOSE MAESTRO-ARTICULOS.

       ABRIR-JSON.

008123     OPEN OUTPUT ARCHIVO-JSON.
008150
008160     INITIALIZE REG-PLANO.
008170     MOVE "{*SALDOS*:[" TO  DATOS-PLANO
008180     INSPECT DATOS-PLANO REPLACING ALL "*" BY CARAC-COMILLA
008190     WRITE REG-PLANO.
008200     MOVE 0 TO SW-FIN.


       ABRIR-SALDOS.
           OPEN INPUT ARCHIVO-SALDOS.

           START ARCHIVO-SALDOS KEY = COD-ART-SAL
                 INVALID KEY
                         INITIALIZE DATOS-SAL
                         GO TO CERRAR-SALDOS
           END-START.


       LEER-SALDOS.
008300     READ ARCHIVO-SALDOS NEXT WITH NO LOCK AT END GO TO CERRAR-SALDOS.

           IF COD-ART-SAL = CTA-W
              CONTINUE
           ELSE
               GO TO CERRAR-SALDOS
           END-IF


           PERFORM CALCULAR-SALDO-ACTUAL VARYING DIA-SDO-W FROM 1 BY 1
                                                   UNTIL DIA-SDO-W > 31

           MOVE OTROS1-ART             TO OTROS1-J
           MOVE USO-ART                TO USO-J
           MOVE VR-VENTA1-ART (1)      TO VR-VENTA1-EDIT
           MOVE VR-VENTA1-EDIT         TO VR-VENTA1-ART-J

           MOVE ACUM-ENT-CANT (32)     TO NUMERO-EDIT
           MOVE NUMERO-EDIT            TO SDO-ANT-CANT-J

           MOVE ACUM-ENT-CANT (01)     TO NUMERO-EDIT
           MOVE NUMERO-EDIT            TO ACUM-ENT-CANT-J

           MOVE ACUM-SAL-CANT (01)     TO NUMERO-EDIT
           MOVE NUMERO-EDIT            TO ACUM-SAL-CANT-J

           MOVE SDO-ACT-CANT-W         TO NUMERO-EDIT
           MOVE NUMERO-EDIT            TO SDO-ACT-CANT-J

           MOVE VLR-REF-ART            TO NUMERO-EDIT
           MOVE NUMERO-EDIT            TO VLR-REF-ART-J

           IF (NIT-USU = 800202522 OR 822006141)
              MOVE 0 TO VLR-UNIT
           ELSE
              COMPUTE VLR-UNIT = SDO-ACT-VLR-W / SDO-ACT-CANT-W
           END-IF

           MOVE VLR-UNIT               TO VLR-UNIT-EDIT
           MOVE VLR-UNIT-EDIT          TO VLR-UNIT-J

           MOVE COD-LOTE-SAL           TO COD-LOT-SAL-J
           MOVE COD-ALM-SAL            TO COD-ALM-SAL-J

           MOVE "," TO CIERRE-LIN-1
           INSPECT LIN-1 REPLACING ALL "*" BY CARAC-COMILLA

           MOVE LIN-1 TO DATOS-PLANO
           WRITE REG-PLANO END-WRITE

008850     GO TO LEER-SALDOS.
008860
008870 CERRAR-SALDOS.
008880     INITIALIZE OTROS1-J USO-J VR-VENTA1-ART-J SDO-ANT-CANT-J 
                      ACUM-ENT-CANT-J ACUM-SAL-CANT-J SDO-ACT-CANT-J VLR-REF-ART-J
                      VLR-UNIT-J COD-LOT-SAL-J COD-ALM-SAL-J CIERRE-LIN-1

           INSPECT LIN-1 REPLACING ALL "*" BY CARAC-COMILLA

008890     MOVE LIN-1 TO DATOS-PLANO
008900     WRITE REG-PLANO.
008910
008920     MOVE "]}" TO DATOS-PLANO
008930     WRITE REG-PLANO.
008940          
008950     CLOSE ARCHIVO-SALDOS
                 ARCHIVO-JSON.  

010700 PAGINA-CONFIG.  
010720     MOVE "datosrecibidos" TO COBW3-CNV-NAME
010730     MOVE 00               TO COBW3-CNV-VALUE
010740     CALL "COBW3_SET_CNV" USING COBW3
010750
010760     MOVE "..\PAGINAS\RECIBIDOS.ASPX" TO SALIDA-HTML  
010770     PERFORM ABRIR-HTML.

007980   
007990 CERRAR-SESION.
008000     CALL "COBW3_FREE" USING COBW3.
008010     MOVE 1 TO PROGRAM-STATUS.
008020     EXIT PROGRAM.


008000 CALCULAR-SALDO-ACTUAL.
008010     IF DIA-SDO-W = 1
008020        ADD  ACUM-ENT-CANT     (32)    TO SDO-ACT-CANT-W SDO-INI-CANT-W
008030        ADD  ACUM-ENT-VLR      (32)    TO SDO-ACT-VLR-W  SDO-INI-VLR-W
008040        ADD  DEP-ENT-VLR       (32)    TO SDO-ACT-DEP-W  SDO-INI-DEP-W
008050        ADD  INF-ENT-VLR       (32)    TO SDO-ACT-INF-W  SDO-INI-INF-W
008060        ADD  INFD-ENT-VLR      (32)    TO SDO-ACT-INFD-W SDO-INI-INFD-W
008070     END-IF
008080
008090     ADD ACUM-ENT-CANT (DIA-SDO-W) TO SDO-AC-CANT-ENT-W SDO-ACT-CANT-W
008100     ADD ACUM-ENT-VLR  (DIA-SDO-W) TO SDO-AC-VLR-ENT-W  SDO-ACT-VLR-W
008110     ADD DEP-ENT-VLR   (DIA-SDO-W) TO SDO-AC-DEP-ENT-W  SDO-ACT-DEP-W
008120     ADD INF-ENT-VLR   (DIA-SDO-W) TO SDO-AC-INF-ENT-W  SDO-ACT-INF-W 
008130     ADD INFD-ENT-VLR  (DIA-SDO-W) TO SDO-AC-INFD-ENT-W SDO-ACT-INFD-W.
008140     
008150     ADD ACUM-SAL-CANT (DIA-SDO-W) TO SDO-AC-CANT-SAL-W 
008160     ADD ACUM-SAL-VLR  (DIA-SDO-W) TO SDO-AC-VLR-SAL-W  
008170     ADD DEP-SAL-VLR   (DIA-SDO-W) TO SDO-AC-DEP-SAL-W  
008180     ADD INF-SAL-VLR   (DIA-SDO-W) TO SDO-AC-INF-SAL-W  
008190     ADD INFD-SAL-VLR  (DIA-SDO-W) TO SDO-AC-INFD-SAL-W.
008200
008210     SUBTRACT ACUM-SAL-CANT (DIA-SDO-W) FROM SDO-ACT-CANT-W
008220     SUBTRACT ACUM-SAL-VLR  (DIA-SDO-W) FROM SDO-ACT-VLR-W
008230     SUBTRACT DEP-SAL-VLR   (DIA-SDO-W) FROM SDO-ACT-DEP-W
008240     SUBTRACT INF-SAL-VLR   (DIA-SDO-W) FROM SDO-ACT-INF-W 
008250     SUBTRACT INFD-SAL-VLR  (DIA-SDO-W) FROM SDO-ACT-INFD-W.

008030
008040 COPY "P:\PROG\PROYECT\FUENTES\SC-WEB.CBL".
