000010 EDITAR-SECUENCIA.
000020     IF SEC-W < 100
000030        MOVE SEC-W TO SEC-X
000040        MOVE SEC-X TO SECU-MOV
000050     ELSE
000060        EVALUATE SEC-W
000070        WHEN 100 MOVE "A0" TO SECU-MOV
000080        WHEN 101 MOVE "A1" TO SECU-MOV
000090        WHEN 102 MOVE "A2" TO SECU-MOV
000100        WHEN 103 MOVE "A3" TO SECU-MOV
000110        WHEN 104 MOVE "A4" TO SECU-MOV
000120        WHEN 105 MOVE "A5" TO SECU-MOV
000130        WHEN 106 MOVE "A6" TO SECU-MOV
000140        WHEN 107 MOVE "A7" TO SECU-MOV
000150        WHEN 108 MOVE "A8" TO SECU-MOV
000160        WHEN 109 MOVE "A9" TO SECU-MOV
000170        WHEN 110 MOVE "AA" TO SECU-MOV
000180        WHEN 111 MOVE "AB" TO SECU-MOV
000190        WHEN 112 MOVE "AC" TO SECU-MOV
000200        WHEN 113 MOVE "AD" TO SECU-MOV
000210        WHEN 114 MOVE "AE" TO SECU-MOV
000220        WHEN 115 MOVE "AF" TO SECU-MOV
000230        WHEN 116 MOVE "AG" TO SECU-MOV
000240        WHEN 117 MOVE "AH" TO SECU-MOV
000250        WHEN 118 MOVE "AI" TO SECU-MOV
000260        WHEN 119 MOVE "AJ" TO SECU-MOV
000270        WHEN 120 MOVE "AK" TO SECU-MOV
000280        WHEN 121 MOVE "AL" TO SECU-MOV
000290        WHEN 122 MOVE "AM" TO SECU-MOV
000300        WHEN 123 MOVE "AN" TO SECU-MOV
000310        WHEN 124 MOVE "AO" TO SECU-MOV
000320        WHEN 125 MOVE "AP" TO SECU-MOV
000330        WHEN 126 MOVE "AQ" TO SECU-MOV
000340        WHEN 127 MOVE "AR" TO SECU-MOV
000350        WHEN 128 MOVE "AS" TO SECU-MOV
000360        WHEN 129 MOVE "AT" TO SECU-MOV
000370        WHEN 130 MOVE "AU" TO SECU-MOV
000380        WHEN 131 MOVE "AV" TO SECU-MOV
000390        WHEN 132 MOVE "AW" TO SECU-MOV
000400        WHEN 133 MOVE "AX" TO SECU-MOV
000410        WHEN 134 MOVE "AY" TO SECU-MOV
000420        WHEN 135 MOVE "AZ" TO SECU-MOV
000430        WHEN 136 MOVE "B0" TO SECU-MOV
000440        WHEN 137 MOVE "B1" TO SECU-MOV
000450        WHEN 138 MOVE "B2" TO SECU-MOV
000460        WHEN 139 MOVE "B3" TO SECU-MOV
000470        WHEN 140 MOVE "B4" TO SECU-MOV
000480        WHEN 141 MOVE "B5" TO SECU-MOV
000490        WHEN 142 MOVE "B6" TO SECU-MOV
000500        WHEN 143 MOVE "B7" TO SECU-MOV
000510        WHEN 144 MOVE "B8" TO SECU-MOV
000520        WHEN 145 MOVE "B9" TO SECU-MOV
000530        WHEN 146 MOVE "BA" TO SECU-MOV
000540        WHEN 147 MOVE "BB" TO SECU-MOV
000550        WHEN 148 MOVE "BC" TO SECU-MOV
000560        WHEN 149 MOVE "BD" TO SECU-MOV
000570        WHEN 150 MOVE "BE" TO SECU-MOV
000580        WHEN 151 MOVE "BF" TO SECU-MOV
000590        WHEN 152 MOVE "BG" TO SECU-MOV
000600        WHEN 153 MOVE "BH" TO SECU-MOV
000610        WHEN 154 MOVE "BI" TO SECU-MOV
000620        WHEN 155 MOVE "BJ" TO SECU-MOV
000630        WHEN 156 MOVE "BK" TO SECU-MOV
000640        WHEN 157 MOVE "BL" TO SECU-MOV
000650        WHEN 158 MOVE "BM" TO SECU-MOV
000660        WHEN 159 MOVE "BN" TO SECU-MOV
000670        WHEN 160 MOVE "BO" TO SECU-MOV
000680        WHEN 161 MOVE "BP" TO SECU-MOV
000690        WHEN 162 MOVE "BQ" TO SECU-MOV
000700        WHEN 163 MOVE "BR" TO SECU-MOV
000710        WHEN 164 MOVE "BS" TO SECU-MOV
000720        WHEN 165 MOVE "BT" TO SECU-MOV
000730        WHEN 166 MOVE "BU" TO SECU-MOV
000740        WHEN 167 MOVE "BV" TO SECU-MOV
000750        WHEN 168 MOVE "BW" TO SECU-MOV
000760        WHEN 169 MOVE "BX" TO SECU-MOV
000770        WHEN 170 MOVE "BY" TO SECU-MOV
000780        WHEN 171 MOVE "BZ" TO SECU-MOV
000790        WHEN 172 MOVE "C0" TO SECU-MOV
000800        WHEN 173 MOVE "C1" TO SECU-MOV
000810        WHEN 174 MOVE "C2" TO SECU-MOV
000820        WHEN 175 MOVE "C3" TO SECU-MOV
000830        WHEN 176 MOVE "C4" TO SECU-MOV
000840        WHEN 177 MOVE "C5" TO SECU-MOV
000850        WHEN 178 MOVE "C6" TO SECU-MOV
000860        WHEN 179 MOVE "C7" TO SECU-MOV
000870        WHEN 180 MOVE "C8" TO SECU-MOV
000880        WHEN 181 MOVE "C9" TO SECU-MOV
000890        WHEN 182 MOVE "CA" TO SECU-MOV
000900        WHEN 183 MOVE "CB" TO SECU-MOV
000910        WHEN 184 MOVE "CC" TO SECU-MOV
000920        WHEN 185 MOVE "CD" TO SECU-MOV
000930        WHEN 186 MOVE "CE" TO SECU-MOV
000940        WHEN 187 MOVE "CF" TO SECU-MOV
000950        WHEN 188 MOVE "CG" TO SECU-MOV
000960        WHEN 189 MOVE "CH" TO SECU-MOV
000970        WHEN 190 MOVE "CI" TO SECU-MOV
000980        WHEN 191 MOVE "CJ" TO SECU-MOV
000990        WHEN 192 MOVE "CK" TO SECU-MOV
001000        WHEN 193 MOVE "CL" TO SECU-MOV
001010        WHEN 194 MOVE "CM" TO SECU-MOV
001020        WHEN 195 MOVE "CN" TO SECU-MOV
001030        WHEN 196 MOVE "CO" TO SECU-MOV
001040        WHEN 197 MOVE "CP" TO SECU-MOV
001050        WHEN 198 MOVE "CQ" TO SECU-MOV
001060        WHEN 199 MOVE "CR" TO SECU-MOV
001070        WHEN 200 MOVE "CS" TO SECU-MOV
001080        WHEN 201 MOVE "CT" TO SECU-MOV
001090        WHEN 202 MOVE "CU" TO SECU-MOV
001100        WHEN 203 MOVE "CV" TO SECU-MOV
001110        WHEN 204 MOVE "CW" TO SECU-MOV
001120        WHEN 205 MOVE "CX" TO SECU-MOV
001130        WHEN 206 MOVE "CY" TO SECU-MOV
001140        WHEN 207 MOVE "CZ" TO SECU-MOV
001150        WHEN 208 MOVE "D0" TO SECU-MOV
001160        WHEN 209 MOVE "D1" TO SECU-MOV
001170        WHEN 210 MOVE "D2" TO SECU-MOV
001180        WHEN 211 MOVE "D3" TO SECU-MOV
001190        WHEN 212 MOVE "D4" TO SECU-MOV
001200        WHEN 213 MOVE "D5" TO SECU-MOV
001210        WHEN 214 MOVE "D6" TO SECU-MOV
001220        WHEN 215 MOVE "D7" TO SECU-MOV
001230        WHEN 216 MOVE "D8" TO SECU-MOV
001240        WHEN 217 MOVE "D9" TO SECU-MOV
001250        WHEN 218 MOVE "DA" TO SECU-MOV
001260        WHEN 219 MOVE "DB" TO SECU-MOV
001270        WHEN 220 MOVE "DC" TO SECU-MOV
001280        WHEN 221 MOVE "DD" TO SECU-MOV
001290        WHEN 222 MOVE "DE" TO SECU-MOV
001300        WHEN 223 MOVE "DF" TO SECU-MOV
001310        WHEN 224 MOVE "DG" TO SECU-MOV
001320        WHEN 225 MOVE "DH" TO SECU-MOV
001330        WHEN 226 MOVE "DI" TO SECU-MOV
001340        WHEN 227 MOVE "DJ" TO SECU-MOV
001350        WHEN 228 MOVE "DK" TO SECU-MOV
001360        WHEN 229 MOVE "DL" TO SECU-MOV
001370        WHEN 230 MOVE "DM" TO SECU-MOV
001380        WHEN 231 MOVE "DN" TO SECU-MOV
001390        WHEN 232 MOVE "DO" TO SECU-MOV
001400        WHEN 233 MOVE "DP" TO SECU-MOV
001410        WHEN 234 MOVE "DQ" TO SECU-MOV
001420        WHEN 235 MOVE "DR" TO SECU-MOV
001430        WHEN 236 MOVE "DS" TO SECU-MOV
001440        WHEN 237 MOVE "DT" TO SECU-MOV
001450        WHEN 238 MOVE "DU" TO SECU-MOV
001460        WHEN 239 MOVE "DV" TO SECU-MOV
001470        WHEN 240 MOVE "DW" TO SECU-MOV
001480        WHEN 241 MOVE "DX" TO SECU-MOV
001490        WHEN 242 MOVE "DY" TO SECU-MOV
001500        WHEN 243 MOVE "DZ" TO SECU-MOV
001510        WHEN 244 MOVE "E0" TO SECU-MOV
001520        WHEN 245 MOVE "E1" TO SECU-MOV
001530        WHEN 246 MOVE "E2" TO SECU-MOV
001540        WHEN 247 MOVE "E3" TO SECU-MOV
001550        WHEN 248 MOVE "E4" TO SECU-MOV
001560        WHEN 249 MOVE "E5" TO SECU-MOV
001570        WHEN 250 MOVE "E6" TO SECU-MOV
001580        WHEN 251 MOVE "E7" TO SECU-MOV
001590        WHEN 252 MOVE "E8" TO SECU-MOV
001600        WHEN 253 MOVE "E9" TO SECU-MOV
001610        WHEN 254 MOVE "EA" TO SECU-MOV
001620        WHEN 255 MOVE "EB" TO SECU-MOV
001630        WHEN 256 MOVE "EC" TO SECU-MOV
001640        WHEN 257 MOVE "ED" TO SECU-MOV
001650        WHEN 258 MOVE "EE" TO SECU-MOV
001660        WHEN 259 MOVE "EF" TO SECU-MOV
001670        WHEN 260 MOVE "EG" TO SECU-MOV
001680        WHEN 261 MOVE "EH" TO SECU-MOV
001690        WHEN 262 MOVE "EI" TO SECU-MOV
001700        WHEN 263 MOVE "EJ" TO SECU-MOV
001710        WHEN 264 MOVE "EK" TO SECU-MOV
001720        WHEN 265 MOVE "EL" TO SECU-MOV
001730        WHEN 266 MOVE "EM" TO SECU-MOV
001740        WHEN 267 MOVE "EN" TO SECU-MOV
001750        WHEN 268 MOVE "EO" TO SECU-MOV
001760        WHEN 269 MOVE "EP" TO SECU-MOV
001770        WHEN 270 MOVE "EQ" TO SECU-MOV
001780        WHEN 271 MOVE "ER" TO SECU-MOV
001790        WHEN 272 MOVE "ES" TO SECU-MOV
001800        WHEN 273 MOVE "ET" TO SECU-MOV
001810        WHEN 274 MOVE "EU" TO SECU-MOV
001820        WHEN 275 MOVE "EV" TO SECU-MOV
001830        WHEN 276 MOVE "EW" TO SECU-MOV
001840        WHEN 277 MOVE "EX" TO SECU-MOV
001850        WHEN 278 MOVE "EY" TO SECU-MOV
001860        WHEN 279 MOVE "EZ" TO SECU-MOV
001870        WHEN 280 MOVE "F0" TO SECU-MOV
001880        WHEN 281 MOVE "F1" TO SECU-MOV
001890        WHEN 282 MOVE "F2" TO SECU-MOV
001900        WHEN 283 MOVE "F3" TO SECU-MOV
001910        WHEN 284 MOVE "F4" TO SECU-MOV
001920        WHEN 285 MOVE "F5" TO SECU-MOV
001930        WHEN 286 MOVE "F6" TO SECU-MOV
001940        WHEN 287 MOVE "F7" TO SECU-MOV
001950        WHEN 288 MOVE "F8" TO SECU-MOV
001960        WHEN 289 MOVE "F9" TO SECU-MOV
001970        WHEN 290 MOVE "FA" TO SECU-MOV
001980        WHEN 291 MOVE "FB" TO SECU-MOV
001990        WHEN 292 MOVE "FC" TO SECU-MOV
002000        WHEN 293 MOVE "FD" TO SECU-MOV
002010        WHEN 294 MOVE "FE" TO SECU-MOV
002020        WHEN 295 MOVE "FF" TO SECU-MOV
002030        WHEN 296 MOVE "FG" TO SECU-MOV
002040        WHEN 297 MOVE "FH" TO SECU-MOV
002050        WHEN 298 MOVE "FI" TO SECU-MOV
002060        WHEN 299 MOVE "FJ" TO SECU-MOV
002070        WHEN 300 MOVE "FK" TO SECU-MOV
002080        WHEN 301 MOVE "FL" TO SECU-MOV
002090        WHEN 302 MOVE "FM" TO SECU-MOV
002100        WHEN 303 MOVE "FN" TO SECU-MOV
002110        WHEN 304 MOVE "FO" TO SECU-MOV
002120        WHEN 305 MOVE "FP" TO SECU-MOV
002130        WHEN 306 MOVE "FQ" TO SECU-MOV
002140        WHEN 307 MOVE "FR" TO SECU-MOV
002150        WHEN 308 MOVE "FS" TO SECU-MOV
002160        WHEN 309 MOVE "FT" TO SECU-MOV
002170        WHEN 310 MOVE "FU" TO SECU-MOV
002180        WHEN 311 MOVE "FV" TO SECU-MOV
002190        WHEN 312 MOVE "FW" TO SECU-MOV
002200        WHEN 313 MOVE "FX" TO SECU-MOV
002210        WHEN 314 MOVE "FY" TO SECU-MOV
002220        WHEN 315 MOVE "FZ" TO SECU-MOV
002230        WHEN 316 MOVE "G0" TO SECU-MOV
002240        WHEN 317 MOVE "G1" TO SECU-MOV
002250        WHEN 318 MOVE "G2" TO SECU-MOV
002260        WHEN 319 MOVE "G3" TO SECU-MOV
002270        WHEN 320 MOVE "G4" TO SECU-MOV
002280        WHEN 321 MOVE "G5" TO SECU-MOV
002290        WHEN 322 MOVE "G6" TO SECU-MOV
002300        WHEN 323 MOVE "G7" TO SECU-MOV
002310        WHEN 324 MOVE "G8" TO SECU-MOV
002320        WHEN 325 MOVE "G9" TO SECU-MOV
002330        WHEN 326 MOVE "GA" TO SECU-MOV
002340        WHEN 327 MOVE "GB" TO SECU-MOV
002350        WHEN 328 MOVE "GC" TO SECU-MOV
002360        WHEN 329 MOVE "GD" TO SECU-MOV
002370        WHEN 330 MOVE "GE" TO SECU-MOV
002380        WHEN 331 MOVE "GF" TO SECU-MOV
002390        WHEN 332 MOVE "GG" TO SECU-MOV
002400        WHEN 333 MOVE "GH" TO SECU-MOV
002410        WHEN 334 MOVE "GI" TO SECU-MOV
002420        WHEN 335 MOVE "GJ" TO SECU-MOV
002430        WHEN 336 MOVE "GK" TO SECU-MOV
002440        WHEN 337 MOVE "GL" TO SECU-MOV
002450        WHEN 338 MOVE "GM" TO SECU-MOV
002460        WHEN 339 MOVE "GN" TO SECU-MOV
002470        WHEN 340 MOVE "GO" TO SECU-MOV
002480        WHEN 341 MOVE "GP" TO SECU-MOV
002490        WHEN 342 MOVE "GQ" TO SECU-MOV
002500        WHEN 343 MOVE "GR" TO SECU-MOV
002510        WHEN 344 MOVE "GS" TO SECU-MOV
002520        WHEN 345 MOVE "GT" TO SECU-MOV
002530        WHEN 346 MOVE "GU" TO SECU-MOV
002540        WHEN 347 MOVE "GV" TO SECU-MOV
002550        WHEN 348 MOVE "GW" TO SECU-MOV
002560        WHEN 349 MOVE "GX" TO SECU-MOV
002570        WHEN 350 MOVE "GY" TO SECU-MOV
002580        WHEN 351 MOVE "GZ" TO SECU-MOV
002590        WHEN 352 MOVE "H0" TO SECU-MOV
002600        WHEN 353 MOVE "H1" TO SECU-MOV
002610        WHEN 354 MOVE "H2" TO SECU-MOV
002620        WHEN 355 MOVE "H3" TO SECU-MOV
002630        WHEN 356 MOVE "H4" TO SECU-MOV
002640        WHEN 357 MOVE "H5" TO SECU-MOV
002650        WHEN 358 MOVE "H6" TO SECU-MOV
002660        WHEN 359 MOVE "H7" TO SECU-MOV
002670        WHEN 360 MOVE "H8" TO SECU-MOV
002680        WHEN 361 MOVE "H9" TO SECU-MOV
002690        WHEN 362 MOVE "HA" TO SECU-MOV
002700        WHEN 363 MOVE "HB" TO SECU-MOV
002710        WHEN 364 MOVE "HC" TO SECU-MOV
002720        WHEN 365 MOVE "HD" TO SECU-MOV
002730        WHEN 366 MOVE "HE" TO SECU-MOV
002740        WHEN 367 MOVE "HF" TO SECU-MOV
002750        WHEN 368 MOVE "HG" TO SECU-MOV
002760        WHEN 369 MOVE "HH" TO SECU-MOV
002770        WHEN 370 MOVE "HI" TO SECU-MOV
002780        WHEN 371 MOVE "HJ" TO SECU-MOV
002790        WHEN 372 MOVE "HK" TO SECU-MOV
002800        WHEN 373 MOVE "HL" TO SECU-MOV
002810        WHEN 374 MOVE "HM" TO SECU-MOV
002820        WHEN 375 MOVE "HN" TO SECU-MOV
002830        WHEN 376 MOVE "HO" TO SECU-MOV
002840        WHEN 377 MOVE "HP" TO SECU-MOV
002850        WHEN 378 MOVE "HQ" TO SECU-MOV
002860        WHEN 379 MOVE "HR" TO SECU-MOV
002870        WHEN 380 MOVE "HS" TO SECU-MOV
002880        WHEN 381 MOVE "HT" TO SECU-MOV
002890        WHEN 382 MOVE "HU" TO SECU-MOV
002900        WHEN 383 MOVE "HV" TO SECU-MOV
002910        WHEN 384 MOVE "HW" TO SECU-MOV
002920        WHEN 385 MOVE "HX" TO SECU-MOV
002930        WHEN 386 MOVE "HY" TO SECU-MOV
002940        WHEN 387 MOVE "HZ" TO SECU-MOV
002950        WHEN 388 MOVE "I0" TO SECU-MOV
002960        WHEN 389 MOVE "I1" TO SECU-MOV
002970        WHEN 390 MOVE "I2" TO SECU-MOV
002980        WHEN 391 MOVE "I3" TO SECU-MOV
002990        WHEN 392 MOVE "I4" TO SECU-MOV
003000        WHEN 393 MOVE "I5" TO SECU-MOV
003010        WHEN 394 MOVE "I6" TO SECU-MOV
003020        WHEN 395 MOVE "I7" TO SECU-MOV
003030        WHEN 396 MOVE "I8" TO SECU-MOV
003040        WHEN 397 MOVE "I9" TO SECU-MOV
003050        WHEN 398 MOVE "IA" TO SECU-MOV
003060        WHEN 399 MOVE "IB" TO SECU-MOV
003070        WHEN 400 MOVE "IC" TO SECU-MOV
003080        WHEN 401 MOVE "ID" TO SECU-MOV
003090        WHEN 402 MOVE "IE" TO SECU-MOV
003100        WHEN 403 MOVE "IF" TO SECU-MOV
003110        WHEN 404 MOVE "IG" TO SECU-MOV
003120        WHEN 405 MOVE "IH" TO SECU-MOV
003130        WHEN 406 MOVE "II" TO SECU-MOV
003140        WHEN 407 MOVE "IJ" TO SECU-MOV
003150        WHEN 408 MOVE "IK" TO SECU-MOV
003160        WHEN 409 MOVE "IL" TO SECU-MOV
003170        WHEN 410 MOVE "IM" TO SECU-MOV
003180        WHEN 411 MOVE "IN" TO SECU-MOV
003190        WHEN 412 MOVE "IO" TO SECU-MOV
003200        WHEN 413 MOVE "IP" TO SECU-MOV
003210        WHEN 414 MOVE "IQ" TO SECU-MOV
003220        WHEN 415 MOVE "IR" TO SECU-MOV
003230        WHEN 416 MOVE "IS" TO SECU-MOV
003240        WHEN 417 MOVE "IT" TO SECU-MOV
003250        WHEN 418 MOVE "IU" TO SECU-MOV
003260        WHEN 419 MOVE "IV" TO SECU-MOV
003270        WHEN 420 MOVE "IW" TO SECU-MOV
003280        WHEN 421 MOVE "IX" TO SECU-MOV
003290        WHEN 422 MOVE "IY" TO SECU-MOV
003300        WHEN 423 MOVE "IZ" TO SECU-MOV
003310        WHEN 424 MOVE "J0" TO SECU-MOV
003320        WHEN 425 MOVE "J1" TO SECU-MOV
003330        WHEN 426 MOVE "J2" TO SECU-MOV
003340        WHEN 427 MOVE "J3" TO SECU-MOV
003350        WHEN 428 MOVE "J4" TO SECU-MOV
003360        WHEN 429 MOVE "J5" TO SECU-MOV
003370        WHEN 430 MOVE "J6" TO SECU-MOV
003380        WHEN 431 MOVE "J7" TO SECU-MOV
003390        WHEN 432 MOVE "J8" TO SECU-MOV
003400        WHEN 433 MOVE "J9" TO SECU-MOV
003410        WHEN 434 MOVE "JA" TO SECU-MOV
003420        WHEN 435 MOVE "JB" TO SECU-MOV
003430        WHEN 436 MOVE "JC" TO SECU-MOV
003440        WHEN 437 MOVE "JD" TO SECU-MOV
003450        WHEN 438 MOVE "JE" TO SECU-MOV
003460        WHEN 439 MOVE "JF" TO SECU-MOV
003470        WHEN 440 MOVE "JG" TO SECU-MOV
003480        WHEN 441 MOVE "JH" TO SECU-MOV
003490        WHEN 442 MOVE "JI" TO SECU-MOV
003500        WHEN 443 MOVE "JJ" TO SECU-MOV
003510        WHEN 444 MOVE "JK" TO SECU-MOV
003520        WHEN 445 MOVE "JL" TO SECU-MOV
003530        WHEN 446 MOVE "JM" TO SECU-MOV
003540        WHEN 447 MOVE "JN" TO SECU-MOV
003550        WHEN 448 MOVE "JO" TO SECU-MOV
003560        WHEN 449 MOVE "JP" TO SECU-MOV
003570        WHEN 450 MOVE "JQ" TO SECU-MOV
003580        WHEN 451 MOVE "JR" TO SECU-MOV
003590        WHEN 452 MOVE "JS" TO SECU-MOV
003600        WHEN 453 MOVE "JT" TO SECU-MOV
003610        WHEN 454 MOVE "JU" TO SECU-MOV
003620        WHEN 455 MOVE "JV" TO SECU-MOV
003630        WHEN 456 MOVE "JW" TO SECU-MOV
003640        WHEN 457 MOVE "JX" TO SECU-MOV
003650        WHEN 458 MOVE "JY" TO SECU-MOV
003660        WHEN 459 MOVE "JZ" TO SECU-MOV
003670        WHEN 460 MOVE "K0" TO SECU-MOV
003680        WHEN 461 MOVE "K1" TO SECU-MOV
003690        WHEN 462 MOVE "K2" TO SECU-MOV
003700        WHEN 463 MOVE "K3" TO SECU-MOV
003710        WHEN 464 MOVE "K4" TO SECU-MOV
003720        WHEN 465 MOVE "K5" TO SECU-MOV
003730        WHEN 466 MOVE "K6" TO SECU-MOV
003740        WHEN 467 MOVE "K7" TO SECU-MOV
003750        WHEN 468 MOVE "K8" TO SECU-MOV
003760        WHEN 469 MOVE "K9" TO SECU-MOV
003770        WHEN 470 MOVE "KA" TO SECU-MOV
003780        WHEN 471 MOVE "KB" TO SECU-MOV
003790        WHEN 472 MOVE "KC" TO SECU-MOV
003800        WHEN 473 MOVE "KD" TO SECU-MOV
003810        WHEN 474 MOVE "KE" TO SECU-MOV
003820        WHEN 475 MOVE "KF" TO SECU-MOV
003830        WHEN 476 MOVE "KG" TO SECU-MOV
003840        WHEN 477 MOVE "KH" TO SECU-MOV
003850        WHEN 478 MOVE "KI" TO SECU-MOV
003860        WHEN 479 MOVE "KJ" TO SECU-MOV
003870        WHEN 480 MOVE "KK" TO SECU-MOV
003880        WHEN 481 MOVE "KL" TO SECU-MOV
003890        WHEN 482 MOVE "KM" TO SECU-MOV
003900        WHEN 483 MOVE "KN" TO SECU-MOV
003910        WHEN 484 MOVE "KO" TO SECU-MOV
003920        WHEN 485 MOVE "KP" TO SECU-MOV
003930        WHEN 486 MOVE "KQ" TO SECU-MOV
003940        WHEN 487 MOVE "KR" TO SECU-MOV
003950        WHEN 488 MOVE "KS" TO SECU-MOV
003960        WHEN 489 MOVE "KT" TO SECU-MOV
003970        WHEN 490 MOVE "KU" TO SECU-MOV
003980        WHEN 491 MOVE "KV" TO SECU-MOV
003990        WHEN 492 MOVE "KW" TO SECU-MOV
004000        WHEN 493 MOVE "KX" TO SECU-MOV
004010        WHEN 494 MOVE "KY" TO SECU-MOV
004020        WHEN 495 MOVE "KZ" TO SECU-MOV
004030        WHEN 496 MOVE "L0" TO SECU-MOV
004040        WHEN 497 MOVE "L1" TO SECU-MOV
004050        WHEN 498 MOVE "L2" TO SECU-MOV
004060        WHEN 499 MOVE "L3" TO SECU-MOV
004070        WHEN 500 MOVE "L4" TO SECU-MOV
004080        WHEN 501 MOVE "L5" TO SECU-MOV
004090        WHEN 502 MOVE "L6" TO SECU-MOV
004100        WHEN 503 MOVE "L7" TO SECU-MOV
004110        WHEN 504 MOVE "L8" TO SECU-MOV
004120        WHEN 505 MOVE "L9" TO SECU-MOV
004130        WHEN 506 MOVE "LA" TO SECU-MOV
004140        WHEN 507 MOVE "LB" TO SECU-MOV
004150        WHEN 508 MOVE "LC" TO SECU-MOV
004160        WHEN 509 MOVE "LD" TO SECU-MOV
004170        WHEN 510 MOVE "LE" TO SECU-MOV
004180        WHEN 511 MOVE "LF" TO SECU-MOV
004190        WHEN 512 MOVE "LG" TO SECU-MOV
004200        WHEN 513 MOVE "LH" TO SECU-MOV
004210        WHEN 514 MOVE "LI" TO SECU-MOV
004220        WHEN 515 MOVE "LJ" TO SECU-MOV
004230        WHEN 516 MOVE "LK" TO SECU-MOV
004240        WHEN 517 MOVE "LL" TO SECU-MOV
004250        WHEN 518 MOVE "LM" TO SECU-MOV
004260        WHEN 519 MOVE "LN" TO SECU-MOV
004270        WHEN 520 MOVE "LO" TO SECU-MOV
004280        WHEN 521 MOVE "LP" TO SECU-MOV
004290        WHEN 522 MOVE "LQ" TO SECU-MOV
004300        WHEN 523 MOVE "LR" TO SECU-MOV
004310        WHEN 524 MOVE "LS" TO SECU-MOV
004320        WHEN 525 MOVE "LT" TO SECU-MOV
004330        WHEN 526 MOVE "LU" TO SECU-MOV
004340        WHEN 527 MOVE "LV" TO SECU-MOV
004350        WHEN 528 MOVE "LW" TO SECU-MOV
004360        WHEN 529 MOVE "LX" TO SECU-MOV
004370        WHEN 530 MOVE "LY" TO SECU-MOV
004380        WHEN 531 MOVE "LZ" TO SECU-MOV
004390        WHEN 532 MOVE "M0" TO SECU-MOV
004400        WHEN 533 MOVE "M1" TO SECU-MOV
004410        WHEN 534 MOVE "M2" TO SECU-MOV
004420        WHEN 535 MOVE "M3" TO SECU-MOV
004430        WHEN 536 MOVE "M4" TO SECU-MOV
004440        WHEN 537 MOVE "M5" TO SECU-MOV
004450        WHEN 538 MOVE "M6" TO SECU-MOV
004460        WHEN 539 MOVE "M7" TO SECU-MOV
004470        WHEN 540 MOVE "M8" TO SECU-MOV
004480        WHEN 541 MOVE "M9" TO SECU-MOV
004490        WHEN 542 MOVE "MA" TO SECU-MOV
004500        WHEN 543 MOVE "MB" TO SECU-MOV
004510        WHEN 544 MOVE "MC" TO SECU-MOV
004520        WHEN 545 MOVE "MD" TO SECU-MOV
004530        WHEN 546 MOVE "ME" TO SECU-MOV
004540        WHEN 547 MOVE "MF" TO SECU-MOV
004550        WHEN 548 MOVE "MG" TO SECU-MOV
004560        WHEN 549 MOVE "MH" TO SECU-MOV
004570        WHEN 550 MOVE "MI" TO SECU-MOV
004580        WHEN 551 MOVE "MJ" TO SECU-MOV
004590        WHEN 552 MOVE "MK" TO SECU-MOV
004600        WHEN 553 MOVE "ML" TO SECU-MOV
004610        WHEN 554 MOVE "MM" TO SECU-MOV
004620        WHEN 555 MOVE "MN" TO SECU-MOV
004630        WHEN 556 MOVE "MO" TO SECU-MOV
004640        WHEN 557 MOVE "MP" TO SECU-MOV
004650        WHEN 558 MOVE "MQ" TO SECU-MOV
004660        WHEN 559 MOVE "MR" TO SECU-MOV
004670        WHEN 560 MOVE "MS" TO SECU-MOV
004680        WHEN 561 MOVE "MT" TO SECU-MOV
004690        WHEN 562 MOVE "MU" TO SECU-MOV
004700        WHEN 563 MOVE "MV" TO SECU-MOV
004710        WHEN 564 MOVE "MW" TO SECU-MOV
004720        WHEN 565 MOVE "MX" TO SECU-MOV
004730        WHEN 566 MOVE "MY" TO SECU-MOV
004740        WHEN 567 MOVE "MZ" TO SECU-MOV
004750        WHEN 568 MOVE "N0" TO SECU-MOV
004760        WHEN 569 MOVE "N1" TO SECU-MOV
004770        WHEN 570 MOVE "N2" TO SECU-MOV
004780        WHEN 571 MOVE "N3" TO SECU-MOV
004790        WHEN 572 MOVE "N4" TO SECU-MOV
004800        WHEN 573 MOVE "N5" TO SECU-MOV
004810        WHEN 574 MOVE "N6" TO SECU-MOV
004820        WHEN 575 MOVE "N7" TO SECU-MOV
004830        WHEN 576 MOVE "N8" TO SECU-MOV
004840        WHEN 577 MOVE "N9" TO SECU-MOV
004850        WHEN 578 MOVE "NA" TO SECU-MOV
004860        WHEN 579 MOVE "NB" TO SECU-MOV
004870        WHEN 580 MOVE "NC" TO SECU-MOV
004880        WHEN 581 MOVE "ND" TO SECU-MOV
004890        WHEN 582 MOVE "NE" TO SECU-MOV
004900        WHEN 583 MOVE "NF" TO SECU-MOV
004910        WHEN 584 MOVE "NG" TO SECU-MOV
004920        WHEN 585 MOVE "NH" TO SECU-MOV
004930        WHEN 586 MOVE "NI" TO SECU-MOV
004940        WHEN 587 MOVE "NJ" TO SECU-MOV
004950        WHEN 588 MOVE "NK" TO SECU-MOV
004960        WHEN 589 MOVE "NL" TO SECU-MOV
004970        WHEN 590 MOVE "NM" TO SECU-MOV
004980        WHEN 591 MOVE "NN" TO SECU-MOV
004990        WHEN 592 MOVE "NO" TO SECU-MOV
005000        WHEN 593 MOVE "NP" TO SECU-MOV
005010        WHEN 594 MOVE "NQ" TO SECU-MOV
005020        WHEN 595 MOVE "NR" TO SECU-MOV
005030        WHEN 596 MOVE "NS" TO SECU-MOV
005040        WHEN 597 MOVE "NT" TO SECU-MOV
005050        WHEN 598 MOVE "NU" TO SECU-MOV
005060        WHEN 599 MOVE "NV" TO SECU-MOV
005070        WHEN 600 MOVE "NW" TO SECU-MOV
005080        WHEN 601 MOVE "NX" TO SECU-MOV
005090        WHEN 602 MOVE "NY" TO SECU-MOV
005100        WHEN 603 MOVE "NZ" TO SECU-MOV
005110        WHEN 604 MOVE "O0" TO SECU-MOV
005120        WHEN 605 MOVE "O1" TO SECU-MOV
005130        WHEN 606 MOVE "O2" TO SECU-MOV
005140        WHEN 607 MOVE "O3" TO SECU-MOV
005150        WHEN 608 MOVE "O4" TO SECU-MOV
005160        WHEN 609 MOVE "O5" TO SECU-MOV
005170        WHEN 610 MOVE "O6" TO SECU-MOV
005180        WHEN 611 MOVE "O7" TO SECU-MOV
005190        WHEN 612 MOVE "O8" TO SECU-MOV
005200        WHEN 613 MOVE "O9" TO SECU-MOV
005210        WHEN 614 MOVE "OA" TO SECU-MOV
005220        WHEN 615 MOVE "OB" TO SECU-MOV
005230        WHEN 616 MOVE "OC" TO SECU-MOV
005240        WHEN 617 MOVE "OD" TO SECU-MOV
005250        WHEN 618 MOVE "OE" TO SECU-MOV
005260        WHEN 619 MOVE "OF" TO SECU-MOV
005270        WHEN 620 MOVE "OG" TO SECU-MOV
005280        WHEN 621 MOVE "OH" TO SECU-MOV
005290        WHEN 622 MOVE "OI" TO SECU-MOV
005300        WHEN 623 MOVE "OJ" TO SECU-MOV
005310        WHEN 624 MOVE "OK" TO SECU-MOV
005320        WHEN 625 MOVE "OL" TO SECU-MOV
005330        WHEN 626 MOVE "OM" TO SECU-MOV
005340        WHEN 627 MOVE "ON" TO SECU-MOV
005350        WHEN 628 MOVE "OO" TO SECU-MOV
005360        WHEN 629 MOVE "OP" TO SECU-MOV
005370        WHEN 630 MOVE "OQ" TO SECU-MOV
005380        WHEN 631 MOVE "OR" TO SECU-MOV
005390        WHEN 632 MOVE "OS" TO SECU-MOV
005400        WHEN 633 MOVE "OT" TO SECU-MOV
005410        WHEN 634 MOVE "OU" TO SECU-MOV
005420        WHEN 635 MOVE "OV" TO SECU-MOV
005430        WHEN 636 MOVE "OW" TO SECU-MOV
005440        WHEN 637 MOVE "OX" TO SECU-MOV
005450        WHEN 638 MOVE "OY" TO SECU-MOV
005460        WHEN 639 MOVE "OZ" TO SECU-MOV
005470        WHEN 640 MOVE "P0" TO SECU-MOV
005480        WHEN 641 MOVE "P1" TO SECU-MOV
005490        WHEN 642 MOVE "P2" TO SECU-MOV
005500        WHEN 643 MOVE "P3" TO SECU-MOV
005510        WHEN 644 MOVE "P4" TO SECU-MOV
005520        WHEN 645 MOVE "P5" TO SECU-MOV
005530        WHEN 646 MOVE "P6" TO SECU-MOV
005540        WHEN 647 MOVE "P7" TO SECU-MOV
005550        WHEN 648 MOVE "P8" TO SECU-MOV
005560        WHEN 649 MOVE "P9" TO SECU-MOV
005570        WHEN 650 MOVE "PA" TO SECU-MOV
005580        WHEN 651 MOVE "PB" TO SECU-MOV
005590        WHEN 652 MOVE "PC" TO SECU-MOV
005600        WHEN 653 MOVE "PD" TO SECU-MOV
005610        WHEN 654 MOVE "PE" TO SECU-MOV
005620        WHEN 655 MOVE "PF" TO SECU-MOV
005630        WHEN 656 MOVE "PG" TO SECU-MOV
005640        WHEN 657 MOVE "PH" TO SECU-MOV
005650        WHEN 658 MOVE "PI" TO SECU-MOV
005660        WHEN 659 MOVE "PJ" TO SECU-MOV
005670        WHEN 660 MOVE "PK" TO SECU-MOV
005680        WHEN 661 MOVE "PL" TO SECU-MOV
005690        WHEN 662 MOVE "PM" TO SECU-MOV
005700        WHEN 663 MOVE "PN" TO SECU-MOV
005710        WHEN 664 MOVE "PO" TO SECU-MOV
005720        WHEN 665 MOVE "PP" TO SECU-MOV
005730        WHEN 666 MOVE "PQ" TO SECU-MOV
005740        WHEN 667 MOVE "PR" TO SECU-MOV
005750        WHEN 668 MOVE "PS" TO SECU-MOV
005760        WHEN 669 MOVE "PT" TO SECU-MOV
005770        WHEN 670 MOVE "PU" TO SECU-MOV
005780        WHEN 671 MOVE "PV" TO SECU-MOV
005790        WHEN 672 MOVE "PW" TO SECU-MOV
005800        WHEN 673 MOVE "PX" TO SECU-MOV
005810        WHEN 674 MOVE "PY" TO SECU-MOV
005820        WHEN 675 MOVE "PZ" TO SECU-MOV
005830        WHEN 676 MOVE "Q0" TO SECU-MOV
005840        WHEN 677 MOVE "Q1" TO SECU-MOV
005850        WHEN 678 MOVE "Q2" TO SECU-MOV
005860        WHEN 679 MOVE "Q3" TO SECU-MOV
005870        WHEN 680 MOVE "Q4" TO SECU-MOV
005880        WHEN 681 MOVE "Q5" TO SECU-MOV
005890        WHEN 682 MOVE "Q6" TO SECU-MOV
005900        WHEN 683 MOVE "Q7" TO SECU-MOV
005910        WHEN 684 MOVE "Q8" TO SECU-MOV
005920        WHEN 685 MOVE "Q9" TO SECU-MOV
005930        WHEN 686 MOVE "QA" TO SECU-MOV
005940        WHEN 687 MOVE "QB" TO SECU-MOV
005950        WHEN 688 MOVE "QC" TO SECU-MOV
005960        WHEN 689 MOVE "QD" TO SECU-MOV
005970        WHEN 690 MOVE "QE" TO SECU-MOV
005980        WHEN 691 MOVE "QF" TO SECU-MOV
005990        WHEN 692 MOVE "QG" TO SECU-MOV
006000        WHEN 693 MOVE "QH" TO SECU-MOV
006010        WHEN 694 MOVE "QI" TO SECU-MOV
006020        WHEN 695 MOVE "QJ" TO SECU-MOV
006030        WHEN 696 MOVE "QK" TO SECU-MOV
006040        WHEN 697 MOVE "QL" TO SECU-MOV
006050        WHEN 698 MOVE "QM" TO SECU-MOV
006060        WHEN 699 MOVE "QN" TO SECU-MOV
006070        WHEN 700 MOVE "QO" TO SECU-MOV
006080        WHEN 701 MOVE "QP" TO SECU-MOV
006090        WHEN 702 MOVE "QQ" TO SECU-MOV
006100        WHEN 703 MOVE "QR" TO SECU-MOV
006110        WHEN 704 MOVE "QS" TO SECU-MOV
006120        WHEN 705 MOVE "QT" TO SECU-MOV
006130        WHEN 706 MOVE "QU" TO SECU-MOV
006140        WHEN 707 MOVE "QV" TO SECU-MOV
006150        WHEN 708 MOVE "QW" TO SECU-MOV
006160        WHEN 709 MOVE "QX" TO SECU-MOV
006170        WHEN 710 MOVE "QY" TO SECU-MOV
006180        WHEN 711 MOVE "QZ" TO SECU-MOV
006190        WHEN 712 MOVE "R0" TO SECU-MOV
006200        WHEN 713 MOVE "R1" TO SECU-MOV
006210        WHEN 714 MOVE "R2" TO SECU-MOV
006220        WHEN 715 MOVE "R3" TO SECU-MOV
006230        WHEN 716 MOVE "R4" TO SECU-MOV
006240        WHEN 717 MOVE "R5" TO SECU-MOV
006250        WHEN 718 MOVE "R6" TO SECU-MOV
006260        WHEN 719 MOVE "R7" TO SECU-MOV
006270        WHEN 720 MOVE "R8" TO SECU-MOV
006280        WHEN 721 MOVE "R9" TO SECU-MOV
006290        WHEN 722 MOVE "RA" TO SECU-MOV
006300        WHEN 723 MOVE "RB" TO SECU-MOV
006310        WHEN 724 MOVE "RC" TO SECU-MOV
006320        WHEN 725 MOVE "RD" TO SECU-MOV
006330        WHEN 726 MOVE "RE" TO SECU-MOV
006340        WHEN 727 MOVE "RF" TO SECU-MOV
006350        WHEN 728 MOVE "RG" TO SECU-MOV
006360        WHEN 729 MOVE "RH" TO SECU-MOV
006370        WHEN 730 MOVE "RI" TO SECU-MOV
006380        WHEN 731 MOVE "RJ" TO SECU-MOV
006390        WHEN 732 MOVE "RK" TO SECU-MOV
006400        WHEN 733 MOVE "RL" TO SECU-MOV
006410        WHEN 734 MOVE "RM" TO SECU-MOV
006420        WHEN 735 MOVE "RN" TO SECU-MOV
006430        WHEN 736 MOVE "RO" TO SECU-MOV
006440        WHEN 737 MOVE "RP" TO SECU-MOV
006450        WHEN 738 MOVE "RQ" TO SECU-MOV
006460        WHEN 739 MOVE "RR" TO SECU-MOV
006470        WHEN 740 MOVE "RS" TO SECU-MOV
006480        WHEN 741 MOVE "RT" TO SECU-MOV
006490        WHEN 742 MOVE "RU" TO SECU-MOV
006500        WHEN 743 MOVE "RV" TO SECU-MOV
006510        WHEN 744 MOVE "RW" TO SECU-MOV
006520        WHEN 745 MOVE "RX" TO SECU-MOV
006530        WHEN 746 MOVE "RY" TO SECU-MOV
006540        WHEN 747 MOVE "RZ" TO SECU-MOV
006550        WHEN 748 MOVE "S0" TO SECU-MOV
006560        WHEN 749 MOVE "S1" TO SECU-MOV
006570        WHEN 750 MOVE "S2" TO SECU-MOV
006580        WHEN 751 MOVE "S3" TO SECU-MOV
006590        WHEN 752 MOVE "S4" TO SECU-MOV
006600        WHEN 753 MOVE "S5" TO SECU-MOV
006610        WHEN 754 MOVE "S6" TO SECU-MOV
006620        WHEN 755 MOVE "S7" TO SECU-MOV
006630        WHEN 756 MOVE "S8" TO SECU-MOV
006640        WHEN 757 MOVE "S9" TO SECU-MOV
006650        WHEN 758 MOVE "SA" TO SECU-MOV
006660        WHEN 759 MOVE "SB" TO SECU-MOV
006670        WHEN 760 MOVE "SC" TO SECU-MOV
006680        WHEN 761 MOVE "SD" TO SECU-MOV
006690        WHEN 762 MOVE "SE" TO SECU-MOV
006700        WHEN 763 MOVE "SF" TO SECU-MOV
006710        WHEN 764 MOVE "SG" TO SECU-MOV
006720        WHEN 765 MOVE "SH" TO SECU-MOV
006730        WHEN 766 MOVE "SI" TO SECU-MOV
006740        WHEN 767 MOVE "SJ" TO SECU-MOV
006750        WHEN 768 MOVE "SK" TO SECU-MOV
006760        WHEN 769 MOVE "SL" TO SECU-MOV
006770        WHEN 770 MOVE "SM" TO SECU-MOV
006780        WHEN 771 MOVE "SN" TO SECU-MOV
006790        WHEN 772 MOVE "SO" TO SECU-MOV
006800        WHEN 773 MOVE "SP" TO SECU-MOV
006810        WHEN 774 MOVE "SQ" TO SECU-MOV
006820        WHEN 775 MOVE "SR" TO SECU-MOV
006830        WHEN 776 MOVE "SS" TO SECU-MOV
006840        WHEN 777 MOVE "ST" TO SECU-MOV
006850        WHEN 778 MOVE "SU" TO SECU-MOV
006860        WHEN 779 MOVE "SV" TO SECU-MOV
006870        WHEN 780 MOVE "SW" TO SECU-MOV
006880        WHEN 781 MOVE "SX" TO SECU-MOV
006890        WHEN 782 MOVE "SY" TO SECU-MOV
006900        WHEN 783 MOVE "SZ" TO SECU-MOV
006910        WHEN 784 MOVE "T0" TO SECU-MOV
006920        WHEN 785 MOVE "T1" TO SECU-MOV
006930        WHEN 786 MOVE "T2" TO SECU-MOV
006940        WHEN 787 MOVE "T3" TO SECU-MOV
006950        WHEN 788 MOVE "T4" TO SECU-MOV
006960        WHEN 789 MOVE "T5" TO SECU-MOV
006970        WHEN 790 MOVE "T6" TO SECU-MOV
006980        WHEN 791 MOVE "T7" TO SECU-MOV
006990        WHEN 792 MOVE "T8" TO SECU-MOV
007000        WHEN 793 MOVE "T9" TO SECU-MOV
007010        WHEN 794 MOVE "TA" TO SECU-MOV
007020        WHEN 795 MOVE "TB" TO SECU-MOV
007030        WHEN 796 MOVE "TC" TO SECU-MOV
007040        WHEN 797 MOVE "TD" TO SECU-MOV
007050        WHEN 798 MOVE "TE" TO SECU-MOV
007060        WHEN 799 MOVE "TF" TO SECU-MOV
007070        WHEN 800 MOVE "TG" TO SECU-MOV
007080        WHEN 801 MOVE "TH" TO SECU-MOV
007090        WHEN 802 MOVE "TI" TO SECU-MOV
007100        WHEN 803 MOVE "TJ" TO SECU-MOV
007110        WHEN 804 MOVE "TK" TO SECU-MOV
007120        WHEN 805 MOVE "TL" TO SECU-MOV
007130        WHEN 806 MOVE "TM" TO SECU-MOV
007140        WHEN 807 MOVE "TN" TO SECU-MOV
007150        WHEN 808 MOVE "TO" TO SECU-MOV
007160        WHEN 809 MOVE "TP" TO SECU-MOV
007170        WHEN 810 MOVE "TQ" TO SECU-MOV
007180        WHEN 811 MOVE "TR" TO SECU-MOV
007190        WHEN 812 MOVE "TS" TO SECU-MOV
007200        WHEN 813 MOVE "TT" TO SECU-MOV
007210        WHEN 814 MOVE "TU" TO SECU-MOV
007220        WHEN 815 MOVE "TV" TO SECU-MOV
007230        WHEN 816 MOVE "TW" TO SECU-MOV
007240        WHEN 817 MOVE "TX" TO SECU-MOV
007250        WHEN 818 MOVE "TY" TO SECU-MOV
007260        WHEN 819 MOVE "TZ" TO SECU-MOV
007270        WHEN 820 MOVE "U0" TO SECU-MOV
007280        WHEN 821 MOVE "U1" TO SECU-MOV
007290        WHEN 822 MOVE "U2" TO SECU-MOV
007300        WHEN 823 MOVE "U3" TO SECU-MOV
007310        WHEN 824 MOVE "U4" TO SECU-MOV
007320        WHEN 825 MOVE "U5" TO SECU-MOV
007330        WHEN 826 MOVE "U6" TO SECU-MOV
007340        WHEN 827 MOVE "U7" TO SECU-MOV
007350        WHEN 828 MOVE "U8" TO SECU-MOV
007360        WHEN 829 MOVE "U9" TO SECU-MOV
007370        WHEN 830 MOVE "UA" TO SECU-MOV
007380        WHEN 831 MOVE "UB" TO SECU-MOV
007390        WHEN 832 MOVE "UC" TO SECU-MOV
007400        WHEN 833 MOVE "UD" TO SECU-MOV
007410        WHEN 834 MOVE "UE" TO SECU-MOV
007420        WHEN 835 MOVE "UF" TO SECU-MOV
007430        WHEN 836 MOVE "UG" TO SECU-MOV
007440        WHEN 837 MOVE "UH" TO SECU-MOV
007450        WHEN 838 MOVE "UI" TO SECU-MOV
007460        WHEN 839 MOVE "UJ" TO SECU-MOV
007470        WHEN 840 MOVE "UK" TO SECU-MOV
007480        WHEN 841 MOVE "UL" TO SECU-MOV
007490        WHEN 842 MOVE "UM" TO SECU-MOV
007500        WHEN 843 MOVE "UN" TO SECU-MOV
007510        WHEN 844 MOVE "UO" TO SECU-MOV
007520        WHEN 845 MOVE "UP" TO SECU-MOV
007530        WHEN 846 MOVE "UQ" TO SECU-MOV
007540        WHEN 847 MOVE "UR" TO SECU-MOV
007550        WHEN 848 MOVE "US" TO SECU-MOV
007560        WHEN 849 MOVE "UT" TO SECU-MOV
007570        WHEN 850 MOVE "UU" TO SECU-MOV
007580        WHEN 851 MOVE "UV" TO SECU-MOV
007590        WHEN 852 MOVE "UW" TO SECU-MOV
007600        WHEN 853 MOVE "UX" TO SECU-MOV
007610        WHEN 854 MOVE "UY" TO SECU-MOV
007620        WHEN 855 MOVE "UZ" TO SECU-MOV
007630        WHEN 856 MOVE "V0" TO SECU-MOV
007640        WHEN 857 MOVE "V1" TO SECU-MOV
007650        WHEN 858 MOVE "V2" TO SECU-MOV
007660        WHEN 859 MOVE "V3" TO SECU-MOV
007670        WHEN 860 MOVE "V4" TO SECU-MOV
007680        WHEN 861 MOVE "V5" TO SECU-MOV
007690        WHEN 862 MOVE "V6" TO SECU-MOV
007700        WHEN 863 MOVE "V7" TO SECU-MOV
007710        WHEN 864 MOVE "V8" TO SECU-MOV
007720        WHEN 865 MOVE "V9" TO SECU-MOV
007730        WHEN 866 MOVE "VA" TO SECU-MOV
007740        WHEN 867 MOVE "VB" TO SECU-MOV
007750        WHEN 868 MOVE "VC" TO SECU-MOV
007760        WHEN 869 MOVE "VD" TO SECU-MOV
007770        WHEN 870 MOVE "VE" TO SECU-MOV
007780        WHEN 871 MOVE "VF" TO SECU-MOV
007790        WHEN 872 MOVE "VG" TO SECU-MOV
007800        WHEN 873 MOVE "VH" TO SECU-MOV
007810        WHEN 874 MOVE "VI" TO SECU-MOV
007820        WHEN 875 MOVE "VJ" TO SECU-MOV
007830        WHEN 876 MOVE "VK" TO SECU-MOV
007840        WHEN 877 MOVE "VL" TO SECU-MOV
007850        WHEN 878 MOVE "VM" TO SECU-MOV
007860        WHEN 879 MOVE "VN" TO SECU-MOV
007870        WHEN 880 MOVE "VO" TO SECU-MOV
007880        WHEN 881 MOVE "VP" TO SECU-MOV
007890        WHEN 882 MOVE "VQ" TO SECU-MOV
007900        WHEN 883 MOVE "VR" TO SECU-MOV
007910        WHEN 884 MOVE "VS" TO SECU-MOV
007920        WHEN 885 MOVE "VT" TO SECU-MOV
007930        WHEN 886 MOVE "VU" TO SECU-MOV
007940        WHEN 887 MOVE "VV" TO SECU-MOV
007950        WHEN 888 MOVE "VW" TO SECU-MOV
007960        WHEN 889 MOVE "VX" TO SECU-MOV
007970        WHEN 890 MOVE "VY" TO SECU-MOV 
007980        WHEN 891 MOVE "VZ" TO SECU-MOV
007990        WHEN 892 MOVE "W0" TO SECU-MOV
008000        WHEN 893 MOVE "W1" TO SECU-MOV
008010        WHEN 894 MOVE "W2" TO SECU-MOV
008020        WHEN 895 MOVE "W3" TO SECU-MOV
008030        WHEN 896 MOVE "W4" TO SECU-MOV
008040        WHEN 897 MOVE "W5" TO SECU-MOV
008050        WHEN 898 MOVE "W6" TO SECU-MOV
008060        WHEN 899 MOVE "W7" TO SECU-MOV
008070        WHEN 900 MOVE "W8" TO SECU-MOV
008080        WHEN 901 MOVE "W9" TO SECU-MOV
008090        WHEN 902 MOVE "WA" TO SECU-MOV
008100        WHEN 903 MOVE "WB" TO SECU-MOV
008110        WHEN 904 MOVE "WC" TO SECU-MOV
008120        WHEN 905 MOVE "WD" TO SECU-MOV
008130        WHEN 906 MOVE "WE" TO SECU-MOV
008140        WHEN 907 MOVE "WF" TO SECU-MOV
008150        WHEN 908 MOVE "WG" TO SECU-MOV
008160        WHEN 909 MOVE "WH" TO SECU-MOV
008170        WHEN 910 MOVE "WI" TO SECU-MOV
008180        WHEN 911 MOVE "WJ" TO SECU-MOV
008190        WHEN 912 MOVE "WK" TO SECU-MOV
008200        WHEN 913 MOVE "WL" TO SECU-MOV
008210        WHEN 914 MOVE "WM" TO SECU-MOV
008220        WHEN 915 MOVE "WN" TO SECU-MOV
008230        WHEN 916 MOVE "WO" TO SECU-MOV
008240        WHEN 917 MOVE "WP" TO SECU-MOV
008250        WHEN 918 MOVE "WQ" TO SECU-MOV
008260        WHEN 919 MOVE "WR" TO SECU-MOV
008270        WHEN 920 MOVE "WS" TO SECU-MOV
008280        WHEN 921 MOVE "WT" TO SECU-MOV
008290        WHEN 922 MOVE "WU" TO SECU-MOV
008300        WHEN 923 MOVE "WV" TO SECU-MOV
008310        WHEN 924 MOVE "WW" TO SECU-MOV
008320        WHEN 925 MOVE "WX" TO SECU-MOV
008330        WHEN 926 MOVE "WY" TO SECU-MOV
008340        WHEN 927 MOVE "WZ" TO SECU-MOV
008350        WHEN 928 MOVE "X0" TO SECU-MOV
008360        WHEN 929 MOVE "X1" TO SECU-MOV
008370        WHEN 930 MOVE "X2" TO SECU-MOV
008380        WHEN 931 MOVE "X3" TO SECU-MOV
008390        WHEN 932 MOVE "X4" TO SECU-MOV
008400        WHEN 933 MOVE "X5" TO SECU-MOV
008410        WHEN 934 MOVE "X6" TO SECU-MOV
008420        WHEN 935 MOVE "X7" TO SECU-MOV
008430        WHEN 936 MOVE "X8" TO SECU-MOV
008440        WHEN 937 MOVE "X9" TO SECU-MOV
008450        WHEN 938 MOVE "XA" TO SECU-MOV
008460        WHEN 939 MOVE "XB" TO SECU-MOV
008470        WHEN 940 MOVE "XC" TO SECU-MOV
008480        WHEN 941 MOVE "XD" TO SECU-MOV
008490        WHEN 942 MOVE "XE" TO SECU-MOV
008500        WHEN 943 MOVE "XF" TO SECU-MOV
008510        WHEN 944 MOVE "XG" TO SECU-MOV
008520        WHEN 945 MOVE "XH" TO SECU-MOV
008530        WHEN 946 MOVE "XI" TO SECU-MOV
008540        WHEN 947 MOVE "XJ" TO SECU-MOV
008550        WHEN 948 MOVE "XK" TO SECU-MOV
008560        WHEN 949 MOVE "XL" TO SECU-MOV
008570        WHEN 950 MOVE "XM" TO SECU-MOV
008580        WHEN 951 MOVE "XN" TO SECU-MOV
008590        WHEN 952 MOVE "XO" TO SECU-MOV
008600        WHEN 953 MOVE "XP" TO SECU-MOV
008610        WHEN 954 MOVE "XQ" TO SECU-MOV
008620        WHEN 955 MOVE "XR" TO SECU-MOV
008630        WHEN 956 MOVE "XS" TO SECU-MOV
008640        WHEN 957 MOVE "XT" TO SECU-MOV
008650        WHEN 958 MOVE "XU" TO SECU-MOV
008660        WHEN 959 MOVE "XV" TO SECU-MOV
008670        WHEN 960 MOVE "XW" TO SECU-MOV
008680        WHEN 961 MOVE "XX" TO SECU-MOV
008690        WHEN 962 MOVE "XY" TO SECU-MOV
008700        WHEN 963 MOVE "XZ" TO SECU-MOV
008710        WHEN 964 MOVE "Y0" TO SECU-MOV
008720        WHEN 965 MOVE "Y1" TO SECU-MOV
008730        WHEN 966 MOVE "Y2" TO SECU-MOV
008740        WHEN 967 MOVE "Y3" TO SECU-MOV
008750        WHEN 968 MOVE "Y4" TO SECU-MOV
008760        WHEN 969 MOVE "Y5" TO SECU-MOV
008770        WHEN 970 MOVE "Y6" TO SECU-MOV
008780        WHEN 971 MOVE "Y7" TO SECU-MOV
008790        WHEN 972 MOVE "Y8" TO SECU-MOV
008800        WHEN 973 MOVE "Y9" TO SECU-MOV
008810        WHEN 974 MOVE "YA" TO SECU-MOV
008820        WHEN 975 MOVE "YB" TO SECU-MOV
008830        WHEN 976 MOVE "YC" TO SECU-MOV
008840        WHEN 977 MOVE "YD" TO SECU-MOV
008850        WHEN 978 MOVE "YE" TO SECU-MOV
008860        WHEN 979 MOVE "YF" TO SECU-MOV
008870        WHEN 980 MOVE "YG" TO SECU-MOV
008880        WHEN 981 MOVE "YH" TO SECU-MOV 
008890        WHEN 982 MOVE "YI" TO SECU-MOV
008900        WHEN 983 MOVE "YJ" TO SECU-MOV
008910        WHEN 984 MOVE "YK" TO SECU-MOV
008920        WHEN 985 MOVE "YL" TO SECU-MOV
008930        WHEN 986 MOVE "YM" TO SECU-MOV
008940        WHEN 987 MOVE "YN" TO SECU-MOV
008950        WHEN 988 MOVE "YO" TO SECU-MOV
008960        WHEN 989 MOVE "YP" TO SECU-MOV
008970        WHEN 990 MOVE "YQ" TO SECU-MOV 
008980        WHEN 991 MOVE "YR" TO SECU-MOV
008990        WHEN 992 MOVE "YS" TO SECU-MOV
009000        WHEN 993 MOVE "YT" TO SECU-MOV
009010        WHEN 994 MOVE "YU" TO SECU-MOV
009020        WHEN 995 MOVE "YV" TO SECU-MOV
009030        WHEN 996 MOVE "YW" TO SECU-MOV
009040        WHEN 997 MOVE "YX" TO SECU-MOV
009050        WHEN 998 MOVE "YY" TO SECU-MOV
009060        WHEN 999 MOVE "YZ" TO SECU-MOV
009070			  END-EVALUATE
009080	       END-IF.
