000002 IDENTIFICATION DIVISION. 
000003 PROGRAM-ID. CON007X.
000004*   CONTABILIDAD - GRABA EL ULTIMO NUMERO DE UNA SECUENCIA.
000008
000009 ENVIRONMENT     DIVISION.
000010 INPUT-OUTPUT SECTION.
000011 FILE-CONTROL.
000021* COPY "P:\PROG\PROYECT\FUENTES\FS-MOVIM.CBL".
000031
000041     SELECT MOVIMIENTO-DIARIO LOCK MODE IS AUTOMATIC
000042            ASSIGN NOM-MOV-W
000043            ORGANIZATION IS INDEXED;
000044            ACCESS MODE IS DYNAMIC
000045            RECORD KEY IS LLAVE-MOV
000046            ALTERNATE RECORD KEY SECUENCIA-MOV
000047            ALTERNATE RECORD KEY LLAVE-FEC
000048            ALTERNATE RECORD KEY LLAVE-DOC-MOV   WITH DUPLICATES
000049            ALTERNATE RECORD KEY COSTO-MOV       WITH DUPLICATES
000050            ALTERNATE RECORD KEY NRO-ORD-MOV     WITH DUPLICATES
000051            ALTERNATE RECORD KEY LLAVE-LIBRE-MOV WITH DUPLICATES
000052            FILE STATUS IS OTR-STAT.
000053          
000054     SELECT ARCHIVO-LOTES LOCK MODE IS AUTOMATIC
000055	          ASSIGN NOM-LOTE-LNK
000056            ORGANIZATION IS INDEXED;
000057            ACCESS MODE  IS DYNAMIC
000058            RECORD KEY   IS COD-LOTE
000059            ALTERNATE RECORD KEY IS NOMBRE-LOTE WITH DUPLICATES
000060            FILE STATUS IS OTR-STAT.
000061
000062 DATA DIVISION.
000063 FILE SECTION.
000064 COPY "P:\PROG\PROYECT\FUENTES\FD-LOTES.CBL".
000065 COPY "P:\PROG\PROYECT\FUENTES\FD-MOVIM.CBL".
000066
000067 WORKING-STORAGE SECTION.
000068 COPY "P:\PROG\PROYECT\FUENTES\WEB-CARAC.CBL".
000069
000070 77 COMP-ANT                              PIC 9(6).
000071 77 NOM-MOV-W                             PIC X(70).
000072 77 NRO-ULT-COMP-W                        PIC 9(9).
000073 77 SW9                                   PIC 9.
000074 77 SUC-NUM-LNK                           PIC 99.
000075 77 SUC-HEXA-LNK                          PIC X.
000076
000077 01 DIR-CAJ-W                             PIC X(40).
000078 01 SECUENC-EDIT.
000079    02 SEC1-EDIT                          PIC X.
000080    02 SEC2-EDIT                          PIC XX.
000081
000085 LINKAGE SECTION. 
000086 01 NOMBRE-LNK               PIC X(30).
000089 01 DIRECTORIO-W             PIC X(35).
000090 01 INVALID-007              PIC 99.
000091 01 MENSAJE-W                PIC X(50).
000092 01 DATO-ULT-MOV-LNK.
000093    02 LOTE-ULT-MOV-LNK.
000094       03 LOTE1-ULT-MOV-LNK  PIC X.
000095       03 LOTE2-ULT-MOV-LNK  PIC X.
000096       03 LOTE3-ULT-MOV-LNK  PIC X.
000097    02 NRO-ULT-COMP-LNK.
000098       03 NRO1-ULT-COMP-LNK  PIC 9(3).
000099       03 NRO2-ULT-COMP-LNK  PIC 9(6).
000100    02 FECHA-ULT-MOV-LNK.
000101       03 ANO-ULT-MOV-LNK    PIC 99.
000102       03 MES-ULT-MOV-LNK    PIC 99.
000103       03 DIA-ULT-MOV-LNK    PIC 99.
000104
000105 PROCEDURE DIVISION USING NOMBRE-LNK DIRECTORIO-W INVALID-007 MENSAJE-W DATO-ULT-MOV-LNK.
000106
000107 DECLARATIVES.
000117 I-O-TEST SECTION.
000118     USE AFTER EXCEPTION PROCEDURE ON MOVIMIENTO-DIARIO.
000119 ESCR-EXCEPTIONES.
000120     IF OTR-STAT = "00"
000121        CONTINUE
000122     ELSE
000123        MOVE OTR-STAT         TO INVALID-007                              
000124        MOVE NOM-MOV-W     TO MENSAJE-W
000125        GO TO SALIR
000126     END-IF.
000127
000128 I-O-TEST SECTION.
000129     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-LOTES.         
000130 ESCR-EXCEPTIONES.
000131     IF OTR-STAT = "00" 
000132        CONTINUE 
000133     ELSE
000134        MOVE OTR-STAT         TO INVALID-007
000135        MOVE NOM-LOTE-LNK          TO MENSAJE-W
000136        GO TO SALIR
000137     END-IF.
000139
000140
000141 END DECLARATIVES.
000142 PROCEDURAL SECTION.
000143 ABRIR-USUARIO.
000153
000162     MOVE NOMBRE-LNK TO NOM-LOTE-LNK
000163     INSPECT NOM-LOTE-LNK   REPLACING FIRST "                           "
000168                                         BY "\PROG\DATOS\SC-ARCHLOTE.DAT".
000169
000170     MOVE LOTE-ULT-MOV-LNK  TO SECUENC-EDIT
000171     IF SEC1-EDIT = "F"
000172        MOVE SEC2-EDIT TO SUC-NUM-LNK
000173        PERFORM PROCESAR-HEXA
000174        MOVE SEC1-EDIT     TO COD-LOTE1
000175        MOVE SUC-HEXA-LNK  TO COD-LOTE2
000176     ELSE
000177        MOVE LOTE-ULT-MOV-LNK   TO COD-LOTE
000178     END-IF
000181
000182     OPEN INPUT ARCHIVO-LOTES
000183
000184     
000185     READ ARCHIVO-LOTES WITH NO LOCK
000186          INVALID KEY
000187            IF LOTE2-ULT-MOV-LNK = "Q"
000188               MOVE 0 TO CONSEC-LOTE
000189            ELSE
000190               MOVE 1 TO CONSEC-LOTE 
000191            END-IF
000192     END-READ
000193     CLOSE ARCHIVO-LOTES.
000194
000195     IF LOTE2-ULT-MOV-LNK = "Q"
000196        MOVE 0 TO CONSEC-LOTE
000197     END-IF
000198
000199     INITIALIZE DIR-CAJ-W NOM-MOV-W
000200     MOVE DIRECTORIO-W TO DIR-CAJ-W.
000201     INSPECT DIR-CAJ-W REPLACING FIRST "\ENE "  BY    "     ".
000202     INSPECT DIR-CAJ-W REPLACING FIRST "\FEB "  BY    "     ".
000203     INSPECT DIR-CAJ-W REPLACING FIRST "\MAR "  BY    "     ".
000204     INSPECT DIR-CAJ-W REPLACING FIRST "\ABR "  BY    "     ".
000205     INSPECT DIR-CAJ-W REPLACING FIRST "\MAY "  BY    "     ".
000206     INSPECT DIR-CAJ-W REPLACING FIRST "\JUN "  BY    "     ".
000207     INSPECT DIR-CAJ-W REPLACING FIRST "\JUL "  BY    "     ".
000208     INSPECT DIR-CAJ-W REPLACING FIRST "\AGT "  BY    "     ".
000209     INSPECT DIR-CAJ-W REPLACING FIRST "\SEP "  BY    "     ".
000210     INSPECT DIR-CAJ-W REPLACING FIRST "\OCT "  BY    "     ".
000211     INSPECT DIR-CAJ-W REPLACING FIRST "\NOV "  BY    "     ".
000212     INSPECT DIR-CAJ-W REPLACING FIRST "\DIC "  BY    "     ".
000213     INSPECT DIR-CAJ-W REPLACING FIRST "\CIE "  BY    "     ".
000214
000215     MOVE NOMBRE-LNK TO NOM-MOV-W
000216     IF CONSEC-LOTE = 1
000217        INSPECT NOM-MOV-W REPLACING FIRST "                                        "
000218                                       BY DIR-CAJ-W
000219        INSPECT NOM-MOV-W REPLACING FIRST "                       "
000220                                       BY "\CONTROL\SC-ARCHMOV.DAT"
000221     ELSE
000222        INSPECT NOM-MOV-W REPLACING FIRST "                                   "
000223                                       BY DIRECTORIO-W
000224        INSPECT NOM-MOV-W REPLACING FIRST "               "
000225                                       BY "\SC-ARCHMOV.DAT"
000226     END-IF.
000227
000229 ABRIR-MOVIMIENTO.
000230     OPEN I-O MOVIMIENTO-DIARIO.
000231
000232
000233     EVALUATE OTR-STAT
000234        WHEN "00"  GO TO LEER-NUMERACION
000235        WHEN "35"  OPEN OUTPUT MOVIMIENTO-DIARIO
000236                   CLOSE       MOVIMIENTO-DIARIO
000237                   GO TO ABRIR-MOVIMIENTO
000238
000239        WHEN OTHER GO TO SALIR
000240     END-EVALUATE.
000241
000242
000243 LEER-NUMERACION.
000244     INITIALIZE MOV-DIARIO.
000245     MOVE "99999999"        TO LLAVE-COMP-MOV.
000246     MOVE LOTE-ULT-MOV-LNK  TO SECU-MOV
000250
000257     READ MOVIMIENTO-DIARIO RECORD KEY IS SECUENCIA-MOV
000258         INVALID KEY 
000260            MOVE NRO2-ULT-COMP-LNK  TO REFER-MOV
000261            MOVE FECHA-ULT-MOV-LNK  TO FECHA-VENCE-MOV
000263            PERFORM EDITAR-DETALLE
000264            PERFORM ACTUALIZAR-NUMERO
000265            WRITE MOV-DIARIO END-WRITE
000266         NOT INVALID KEY
000267            MOVE NRO2-ULT-COMP-LNK  TO REFER-MOV
000268            PERFORM ACTUALIZAR-NUMERO
000274            IF DETALLE-MOV = "ULTIMO COMPROBANTE"
000275            OR DETALLE-MOV = SPACES
000276               PERFORM EDITAR-DETALLE
000277            END-IF
000278            REWRITE MOV-DIARIO END-REWRITE
000279     END-READ.
000280
000281
000282 CERRAR-ARCHIVOS.
000283     CLOSE MOVIMIENTO-DIARIO.
000284
000285 SALIR.
000286     EXIT PROGRAM.
000287
000288 EDITAR-DETALLE.
000289     EVALUATE LOTE-ULT-MOV-LNK
000290        WHEN "1R" MOVE "RECIBOS DE CAJA PPAL"     TO DETALLE-MOV
000291        WHEN "2R" MOVE "RECIBOS DE CAJA SUC "     TO DETALLE-MOV
000292        WHEN "3R" MOVE "RECIBOS DE CAJA SUC "     TO DETALLE-MOV
000293        WHEN "4R" MOVE "RECIBOS DE CAJA SUC "     TO DETALLE-MOV
000294        WHEN "5R" MOVE "RECIBOS DE CAJA SUC "     TO DETALLE-MOV
000295        WHEN "6R" MOVE "RECIBOS DE CAJA SUC "     TO DETALLE-MOV
000296        WHEN "7R" MOVE "RECIBOS DE CAJA SUC "     TO DETALLE-MOV
000297        WHEN "8R" MOVE "RECIBOS DE CAJA SUC "     TO DETALLE-MOV
000298        WHEN "9R" MOVE "RECIBOS DE CAJA SUC "     TO DETALLE-MOV
000299        WHEN "1C" MOVE "COMPROBANTE DE EGRESO"    TO DETALLE-MOV
000300        WHEN "2C" MOVE "COMP. EGRESO SUCURSAL"    TO DETALLE-MOV
000301        WHEN "3C" MOVE "COMP. EGRESO SUCURSAL"    TO DETALLE-MOV
000302        WHEN "4C" MOVE "COMP. EGRESO SUCURSAL"    TO DETALLE-MOV
000303        WHEN "5C" MOVE "COMP. EGRESO SUCURSAL"    TO DETALLE-MOV
000304        WHEN "6C" MOVE "COMP. EGRESO SUCURSAL"    TO DETALLE-MOV
000305        WHEN "7C" MOVE "COMP. EGRESO SUCURSAL"    TO DETALLE-MOV
000306        WHEN "8C" MOVE "COMP. EGRESO SUCURSAL"    TO DETALLE-MOV
000307        WHEN "9C" MOVE "COMP. EGRESO SUCURSAL"    TO DETALLE-MOV
000308        WHEN "1G" MOVE "NOTA CONTAB PRINCIPAL"    TO DETALLE-MOV
000309        WHEN "2G" MOVE "NOTA CONTAB. SUCURSAL"    TO DETALLE-MOV
000310        WHEN "3G" MOVE "NOTA CONTAB. SUCURSAL"    TO DETALLE-MOV
000311        WHEN "4G" MOVE "NOTA CONTAB. SUCURSAL"    TO DETALLE-MOV
000312        WHEN "5G" MOVE "NOTA CONTAB. SUCURSAL"    TO DETALLE-MOV
000313        WHEN "6G" MOVE "NOTA CONTAB. SUCURSAL"    TO DETALLE-MOV
000314        WHEN "7G" MOVE "NOTA CONTAB. SUCURSAL"    TO DETALLE-MOV
000315        WHEN "8G" MOVE "NOTA CONTAB. SUCURSAL"    TO DETALLE-MOV
000316        WHEN "1Z" MOVE "NOTAS BANCARIAS PPAL "    TO DETALLE-MOV
000317        WHEN "2Z" MOVE "NOTAS BANCARIAS SUCUR"    TO DETALLE-MOV
000318        WHEN "3Z" MOVE "NOTAS BANCARIAS SUCUR"    TO DETALLE-MOV
000319        WHEN "4Z" MOVE "NOTAS BANCARIAS SUCUR"    TO DETALLE-MOV
000320        WHEN "5Z" MOVE "NOTAS BANCARIAS SUCUR"    TO DETALLE-MOV
000321        WHEN "6Z" MOVE "NOTAS BANCARIAS SUCUR"    TO DETALLE-MOV
000322        WHEN "7Z" MOVE "NOTAS BANCARIAS SUCUR"    TO DETALLE-MOV
000323        WHEN "8Z" MOVE "NOTAS BANCARIAS SUCUR"    TO DETALLE-MOV
000324        WHEN "9Z" MOVE "NOTAS BANCARIAS SUCUR   " TO DETALLE-MOV
000325        WHEN "1F" MOVE "FACTURACION PRINCIPAL   " TO DETALLE-MOV
000326        WHEN "2F" MOVE "FACTURACION SUCURSAL 2  " TO DETALLE-MOV
000327        WHEN "3F" MOVE "FACTURACION SUCURSAL 3  " TO DETALLE-MOV
000328        WHEN "4F" MOVE "FACTURACION SUCURSAL 4  " TO DETALLE-MOV
000329        WHEN "5F" MOVE "FACTURACION SUCURSAL 5  " TO DETALLE-MOV
000330        WHEN "6F" MOVE "FACTURACION SUCURSAL 6  " TO DETALLE-MOV
000331        WHEN "7F" MOVE "FACTURACION SUCURSAL 7  " TO DETALLE-MOV
000332        WHEN "8F" MOVE "FACTURACION SUCURSAL 8  " TO DETALLE-MOV
000333        WHEN "9F" MOVE "FACTURACION SUCURSAL    " TO DETALLE-MOV
000334        WHEN "9P" MOVE "PENDIENTES DE ENTREGA   " TO DETALLE-MOV
000335        WHEN "9Q" MOVE "ENTREGA DE PENDIENTES   " TO DETALLE-MOV
000336        WHEN "9C" MOVE "COTIZACIONES            " TO DETALLE-MOV
000337        WHEN "C1" MOVE "ORDENES PREST. SERVIC   " TO DETALLE-MOV
000338        WHEN "C2" MOVE "CONTRATO PREST. SERV.   " TO DETALLE-MOV
000339        WHEN "C3" MOVE "CONTRATO SUMINISTRO     " TO DETALLE-MOV
000340        WHEN "C4" MOVE "CONTRATO DE OBRA        " TO DETALLE-MOV
000341        WHEN "RP" MOVE "PROG. PRODUCC S/N PED   " TO DETALLE-MOV
000342        WHEN "1A" MOVE "CUENTA DE COBRO CARTERA " TO DETALLE-MOV
000343        WHEN "RF" MOVE "REMISIONES              " TO DETALLE-MOV
000344        WHEN "R1" MOVE "ENTRADA MERCANC. REMIS. " TO DETALLE-MOV
000345        WHEN "R2" MOVE "REGISTRO MERCANC. REMIS " TO DETALLE-MOV
000346        WHEN "RE" MOVE "CARTERA RED EXTERNA     " TO DETALLE-MOV
000347        WHEN "70" MOVE "AUT. SERV. DROG. 9A1    " TO DETALLE-MOV
000348        WHEN "71" MOVE "AUT. SERV. CIRU. 9A1    " TO DETALLE-MOV
000349        WHEN "72" MOVE "AUT. SERV. LABO. 9A1    " TO DETALLE-MOV
000350        WHEN "73" MOVE "AUT. SERV. IMAG. 9A1    " TO DETALLE-MOV
000351        WHEN "74" MOVE "AUT. SERV. OTROS 9A1    " TO DETALLE-MOV
000352        WHEN "75" MOVE "AUT. SERV. CONS. 9A1    " TO DETALLE-MOV
000353        WHEN "77" MOVE "AUT. SERV. P Y P 9A1    " TO DETALLE-MOV
000354        WHEN "80" MOVE "COMPROB SERV. DROG.     " TO DETALLE-MOV
000355        WHEN "81" MOVE "COMPROB SERV. CIRUGIA   " TO DETALLE-MOV
000356        WHEN "82" MOVE "COMPROB SERV. LABORAT   " TO DETALLE-MOV
000357        WHEN "83" MOVE "COMPROB SERV. IMAGEN.   " TO DETALLE-MOV
000358        WHEN "84" MOVE "COMPROB SERV. OTROS     " TO DETALLE-MOV
000359        WHEN "85" MOVE "COMPROB SERV. CONSULT   " TO DETALLE-MOV
000360        WHEN "87" MOVE "COMPROB SERV. P.Y.P.    " TO DETALLE-MOV
000361        WHEN "89" MOVE "FACTURAS CONTADO        " TO DETALLE-MOV
000362        WHEN "9A" MOVE "FACTURAS AMBULATORIO    " TO DETALLE-MOV
000363        WHEN "9P" MOVE "FACTURAS HOSPITALIZAC   " TO DETALLE-MOV
000364        WHEN "9T" MOVE "FACTURAS TRANSITO       " TO DETALLE-MOV
000365        WHEN "9G" MOVE "RECEPCION DE GLOSAS     " TO DETALLE-MOV
000366        WHEN "9P" MOVE "PENDIENTES DE ENTREGA   " TO DETALLE-MOV
000367        WHEN "LT" MOVE "LOTES FARMACEUTICOS     " TO DETALLE-MOV
000368        WHEN "HP" MOVE "PEDIDOS DE FARMACIA     " TO DETALLE-MOV
000369        WHEN "AS" MOVE "AUTORIZ. SERV. URGENC   " TO DETALLE-MOV
000370        WHEN "AI" MOVE "AUTORIZ. INCAPACIDAD    " TO DETALLE-MOV
000371        WHEN "U1" MOVE "CONSULTORIO TRIAGE URGEN" TO DETALLE-MOV
000372        WHEN "U2" MOVE "CONSULTORIO TRIAGE EMBAR" TO DETALLE-MOV
000373        WHEN "U3" MOVE "CONSULTORIO TRIAGE REMIT" TO DETALLE-MOV
000374        WHEN "1Q" MOVE "FACTURA PARQUEADERO     " TO DETALLE-MOV
000375
000376     END-EVALUATE.
000377
000378 ACTUALIZAR-NUMERO.
000379     IF LOTE2-ULT-MOV-LNK = "Q"
000380        MOVE NRO-ULT-COMP-LNK   TO ULT-NROPQ-MOV
000381     ELSE
000382        MOVE NRO2-ULT-COMP-LNK  TO ULT-NRO-MOV
000383     END-IF
000384
000385     IF LOTE-ULT-MOV-LNK = "LT"
000386        MOVE NRO-ULT-COMP-LNK   TO CONSEC-LTF-MOV
000387     END-IF
000388
000389     IF FECHA-ULT-MOV-LNK > FECHA-VENCE-MOV
000390     OR ANO-VENCE-MOV > 89
000391     OR MES-VENCE-MOV > 12
000392     OR DIA-VENCE-MOV > 31
000393        MOVE FECHA-ULT-MOV-LNK TO FECHA-VENCE-MOV
000394     END-IF.
000395
000396     COPY "P:\PROG\PROYECT\WEB\INVENT\SUCNUM-HEXA.CBL".
