004820*=================================================================
004830* (CREA, ACTUALIZA, ELIMINA) AGENCIAS
004840*=================================================================
004850 IDENTIFICATION DIVISION.
004860 PROGRAM-ID. "HttpExtensionProc".
004870 ENVIRONMENT DIVISION.
004880 CONFIGURATION SECTION.
004890 INPUT-OUTPUT SECTION.
004900 FILE-CONTROL.
004910     COPY "P:\PROG\PROYECT\FUENTES\FS-USUNET.CBL".
004920     COPY "P:\PROG\PROYECT\FUENTES\FS-SESION.CBL".
004930

           SELECT ARCHIVO-AGENCIAS LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-AGEN-W
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS CODIGO-AGEN
                  FILE STATUS  IS OTR-STAT.

           SELECT ARCHIVO-SUCUR LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-SUCUR-W
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC;
                  RECORD KEY IS COD-SUCUR
                  FILE STATUS IS OTR-STAT.

005080 DATA DIVISION.
005090 FILE SECTION.
005100 COPY "P:\PROG\PROYECT\FUENTES\FD-USUNET.CBL".
005110 COPY "P:\PROG\PROYECT\FUENTES\FD-SESION.CBL".
000690 COPY "P:\PROG\PROYECT\FUENTES\FD-AGENC.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-SUCUR.CBL".

005190 WORKING-STORAGE SECTION.
005200 COPY "P:\PROG\PROYECT\FUENTES\COBW3.CBL".
005210 COPY "P:\PROG\PROYECT\FUENTES\WEB-CARAC19.CBL".
005220 
       77 NOM-AGEN-W               PIC X(70).
       77 NOM-SUCUR-W              PIC X(70).
       77 DATOS-PLANO-W            PIC X(500).

       01 VARIABLES.
           02 PRODUC-AGEN-EDIT.
              03 PRODUC-ENT-EDIT    PIC 99.
              03 PRODUC-DEC-EDIT    PIC 99.
           02 REMESA-AGEN-EDIT      PIC 9999.
           02 PRODUC-EMPR-AGEN-EDIT PIC 9999.
           02 REMESA-EMPR-AGEN-EDIT PIC 9999.

        01 REG-AGEN-W.
           02 CODIGO-AGEN-W         PIC XX.
           02 DESCRIP-AGEN-W        PIC X(25).
           02 PRODUC-AGEN-W         PIC 99V99.
           02 REMESA-AGEN-W         PIC 99V99.
           02 PRODUC-EMPR-AGEN-W    PIC 99V99.
           02 REMESA-EMPR-AGEN-W    PIC 99V99.
           02 FILLER                PIC X(1998).
           02 SUCURSAL-AGEN-W       PIC XX.

006310 LINKAGE SECTION.
006320 COPY "P:\PROG\PROYECT\FUENTES\ISAPICTX.CBL".
006330 PROCEDURE DIVISION WITH stdcall LINKAGE USING ISAPI-CTX-CNT.
006340
006350 DECLARATIVES.
006360 I-O-TEST SECTION.
006370     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUNET.         
006380 ESCR-EXCEPTIONES.
006390     IF OTR-STAT = "00"
006400        CONTINUE 
006410     ELSE
006420        MOVE OTR-STAT         TO MSJ1-HTML
006430        MOVE NOM-USU-W        TO MSJ2-HTML
006440        MOVE "TAX012"         TO MSJ3-HTML
006450        GO TO ENVIAR2-ERROR
006460     END-IF.
006470
006480 I-O-TEST SECTION.
006490     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SESION.
006500 ESCR-EXCEPTIONES.
006510     IF OTR-STAT = "00" 
006520        CONTINUE 
006530     ELSE
006540        MOVE OTR-STAT         TO MSJ1-HTML
006550        MOVE NOM-SESION-W     TO MSJ2-HTML
006560        MOVE "TAX012"         TO MSJ3-HTML
006570        GO TO ENVIAR2-ERROR
006580     END-IF.
006590  
006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-AGENCIAS.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-AGEN-W       TO MSJ2-HTML
006680        MOVE "TAX012"         TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

002694 I-O-TEST SECTION.
002700     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SUCUR.
002710 ESCR-EXCEPTIONES.
002720     IF OTR-STAT = "00"
002730        CONTINUE 
002740     ELSE
002750        MOVE OTR-STAT         TO MSJ1-HTML
002760        MOVE NOM-SUCUR-W      TO MSJ2-HTML
002770        MOVE "TAX012"         TO MSJ3-HTML
002780        GO TO ENVIAR2-ERROR
002790     END-IF.

006720  END DECLARATIVES.
006730
006740 INICIAR-IIS.
006750     MOVE LOW-VALUE TO COBW3.
006760     MOVE FUNCTION ADDR(ISAPI-CTX-CNT) TO COBW3-CONTEXT.
006770     CALL "COBW3_INIT" USING COBW3.
006780
006790 LEER-DATO-HTML.
006800     MOVE "datosh" TO COBW3-SEARCH-DATA.
006810     CALL "COBW3_GET_VALUE" USING COBW3.
006820     MOVE COBW3-GET-DATA    TO LINEA-LLEGAD-W.

           INITIALIZE DATO-LLEGADA-W VARIABLES

           UNSTRING LINEA-LLEGAD-W DELIMITED BY "|"
              INTO SESION-LLEGAD-W, DIRECTORIO-LLEGAD-W, CARPTA-LLEGAD-W, NOVEDAD-W, CODIGO-AGEN-W, 
                   DESCRIP-AGEN-W, PRODUC-AGEN-EDIT, REMESA-AGEN-EDIT, PRODUC-EMPR-AGEN-EDIT, 
                   REMESA-EMPR-AGEN-EDIT, SUCURSAL-AGEN-W
           END-UNSTRING.

           MOVE PRODUC-AGEN-EDIT   TO PRODUC-AGEN-W
           MOVE REMESA-AGEN-EDIT   TO REMESA-AGEN-W
           MOVE PRODUC-EMPR-AGEN-EDIT TO PRODUC-EMPR-AGEN-W
           MOVE REMESA-EMPR-AGEN-EDIT TO REMESA-EMPR-AGEN-W


           MOVE SESION-LLEGAD-W    TO LLAVE-SESION-W.
           MOVE FUNCTION CURRENT-DATE TO FECHA-TOTAL.
           ACCEPT HORA-TOTAL FROM TIME.

000797 INICIAR-SESION.
000806     MOVE "D:\WEB\MAIN-ELECT\DATOS\SC-SESION.DAT" TO NOM-SESION-W.
000810     GO TO VALIDAR-SESION.
000850
000860 FIN-VALIDAR-SESION.
006840     
006900 ABRIR-USUARIO.
006910     INITIALIZE OTR-STAT.
006920     MOVE "D:\WEB\MAIN-ELECT\DATOS\SC-ARCHUSU.DAT" TO NOM-USU-W
006930
006940     OPEN INPUT ARCHIVO-USUNET
006950     EVALUATE OTR-STAT
006960       WHEN "00"  CONTINUE
006970       WHEN "35"  OPEN OUTPUT ARCHIVO-USUNET
006980                  INITIALIZE REG-USUNET
006990                  WRITE REG-USUNET
007000                  CLOSE ARCHIVO-USUNET
007010                  MOVE "SC-2"                        TO MSJ1-HTML
007020                  MOVE "Falta configurar usuarios"   TO MSJ2-HTML
007030                  MOVE "TAX012"                      TO MSJ3-HTML
007040                  GO TO ENVIAR2-ERROR
007050       WHEN OTHER GO TO CERRAR-SESION
007060     END-EVALUATE.
007070
007080     INITIALIZE LLAVE-USUNET.

007110 LEER-USUARIO.
007120     READ ARCHIVO-USUNET NEXT AT END MOVE 0 TO SW-FIN.
007130
007140     CLOSE ARCHIVO-USUNET.
007200     
007210     IF NOMBRE-USUNET = SPACES
007220     OR NIT-USUNET = ZEROS
007230        MOVE "SC-2"    TO MSJ1-HTML
007240        MOVE "Falta configurar usuarios" TO MSJ2-HTML
007250        MOVE "TAX012"  TO MSJ3-HTML
007260        GO TO ENVIAR2-ERROR
007270     END-IF.
007280 
007350
       ASIGNAR-NOMBRES.

           INITIALIZE NOM-AGEN-W

           INSPECT IP-DATOS-USUNET REPLACING FIRST "/" BY "\"
007287     MOVE "\\" TO NOM-AGEN-W
007288     INSPECT NOM-AGEN-W REPLACING FIRST "                    "
007289                                     BY IP-DATOS-USUNET

007290     INSPECT NOM-AGEN-W REPLACING FIRST " "
007291                                     BY "\"

           MOVE NOM-AGEN-W   TO NOM-SUCUR-W

007292     INSPECT NOM-AGEN-W REPLACING FIRST "                              "
007293                                     BY DIRECTORIO-LLEGAD-W
007294     INSPECT NOM-AGEN-W REPLACING FIRST "                        "
007295                                     BY "\CONTROL\SC-ARCHAGEN.DAT".
           
           INSPECT NOM-SUCUR-W REPLACING FIRST "                       "
                                            BY "PROG\DATOS\SC-SUCUR.DAT".

       ABRIR-MODALIDADES.
           OPEN INPUT ARCHIVO-AGENCIAS.

           MOVE CODIGO-AGEN-W  TO CODIGO-AGEN
           READ ARCHIVO-AGENCIAS WITH NO LOCK
                INVALID KEY MOVE 1  TO SW-INVALID 
           END-READ

           CLOSE ARCHIVO-AGENCIAS.

           IF NOVEDAD-W = 7 AND SW-INVALID = 1 GO TO NUEVO.
           IF NOVEDAD-W = 7 AND SW-INVALID = 0 GO TO ERROR-1.
           IF NOVEDAD-W = 8 AND SW-INVALID = 0 GO TO CAMBIO.
           IF NOVEDAD-W = 8 AND SW-INVALID = 1 GO TO ERROR-1.
           IF NOVEDAD-W = 9 AND SW-INVALID = 0 GO TO RETIRO.
           IF NOVEDAD-W = 9 AND SW-INVALID = 1 GO TO ERROR-1.


       NUEVO.

           OPEN I-O ARCHIVO-AGENCIAS
           MOVE REG-AGEN-W TO REG-AGEN
           WRITE REG-AGEN END-WRITE
           CLOSE ARCHIVO-AGENCIAS.

           GO TO PAGINA-CONFIG.

       CAMBIO.
           IF REG-AGEN-W = REG-AGEN GO TO PAGINA-CONFIG.

           OPEN I-O ARCHIVO-AGENCIAS
           MOVE REG-AGEN-W TO REG-AGEN
           REWRITE REG-AGEN END-REWRITE
           CLOSE ARCHIVO-AGENCIAS.

           GO TO PAGINA-CONFIG.

       RETIRO.
           OPEN I-O   ARCHIVO-AGENCIAS
           DELETE     ARCHIVO-AGENCIAS
           CLOSE      ARCHIVO-AGENCIAS.

010700 PAGINA-CONFIG.
010720     MOVE "statuscode" TO COBW3-CNV-NAME
010730     MOVE "00"         TO COBW3-CNV-VALUE
010740     CALL "COBW3_SET_CNV" USING COBW3

000570	   MOVE "datosrecibidos" TO COBW3-CNV-NAME
000580     MOVE "Proceso terminado!" TO COBW3-CNV-VALUE
000590	   CALL "COBW3_SET_CNV"  USING COBW3

010720     MOVE "programa-id" TO COBW3-CNV-NAME
010730     MOVE "TAX012"      TO COBW3-CNV-VALUE
010740     CALL "COBW3_SET_CNV" USING COBW3

010760     MOVE "..\PAGINAS\RECIBIDOSPLANO.ASPX" TO SALIDA-HTML
010770     PERFORM ABRIR-HTML.

007990 CERRAR-SESION.
008000     CALL "COBW3_FREE" USING COBW3.
008010     MOVE 1 TO PROGRAM-STATUS.
008020     EXIT PROGRAM.

       LEER-SUCURSAL.
           OPEN INPUT ARCHIVO-AGENCIAS
          
           READ ARCHIVO-AGENCIAS WITH NO LOCK 
                INVALID KEY
                        MOVE "SC-2"     TO MSJ1-HTML
                        MOVE "Sucursal no encontradra" TO MSJ2-HTML
                        MOVE "TAX012"   TO MSJ2-HTML
                        GO TO ENVIAR2-ERROR
           END-READ

           CLOSE ARCHIVO-AGENCIAS.

       ERROR-1.
           MOVE "SC-2"          TO MSJ1-HTML
           MOVE "Proceso incorrecto!" TO MSJ2-HTML
           MOVE "TAX012"        TO MSJ3-HTML
           GO TO ENVIAR2-ERROR.

008040 COPY "P:\PROG\PROYECT\FUENTES\SC-WEB19.CBL".
