004820*================================================================= 
004830* (CREA, ACTUALIZA, ELIMINA) CARROS - INTERMUNICIPAL
004840*=================================================================
004850 IDENTIFICATION DIVISION.
004860 PROGRAM-ID. "HttpExtensionProc".
004870 ENVIRONMENT DIVISION.
004880 CONFIGURATION SECTION.
004890 INPUT-OUTPUT SECTION.
004900 FILE-CONTROL.
004910     COPY "P:\PROG\PROYECT\FUENTES\FS-USUNET.CBL".
004920     COPY "P:\PROG\PROYECT\FUENTES\FS-SESION.CBL".
004930     COPY "P:\PROG\PROYECT\FUENTES\FS-CARRO-TAX.CBL".
           COPY "P:\PROG\PROYECT\FUENTES\FS-TERCE.CBL".


           SELECT ARCHIVO-COSTO LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-COST-W
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC;
                  RECORD KEY IS COD-COSTO
                  FILE STATUS IS OTR-STAT.


           SELECT ARCHIVO-MODALIDAD  LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-MODAL-W
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS COD-MOD
                  FILE STATUS IS OTR-STAT.

005080 DATA DIVISION.
005090 FILE SECTION.
005100 COPY "P:\PROG\PROYECT\FUENTES\FD-USUNET.CBL".
005110 COPY "P:\PROG\PROYECT\FUENTES\FD-SESION.CBL".
000690 COPY "P:\PROG\PROYECT\FUENTES\FD-CARRO-TAX.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-TERCE.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-COSTO.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-TAXMO.CBL".

005190 WORKING-STORAGE SECTION.
005200 COPY "P:\PROG\PROYECT\FUENTES\COBW3.CBL".
005210 COPY "P:\PROG\PROYECT\FUENTES\WEB-CARAC19.CBL".
005220 
       77 NOM-COST-W                PIC X(70).
       77 NOM-MODAL-W               PIC X(70).
       77 DATOS-PLANO-W             PIC X(500).
       77 NOM-ART-W                 PIC X(70).
       77 NOM-MAE-W                 PIC X(70).

       01 FONDO-EDIT.
          02 FOND-ENT-EDT           PIC 9.
          02 FOND-DEC-EDT           PIC 9.

       01 FONDO-R-EDIT.
          02 FOND-R-ENT-EDT         PIC 9.
          02 FOND-R-DEC-EDT         PIC 9.

       01 PORCENT-EMPRE-EDIT.
          02 PORCEN-ENT-EDT         PIC 99.
          02 PORCEN-DEC-EDT         PIC 99.

       01  REG-CAR-W.
           02 CODIGO-CAR-W          PIC X(6).
           02 PROPIET-CAR-W         PIC 9(10).
           02 INTERNO-CAR-W         PIC X(4).
           02 MODELO-CAR-W          PIC 9(4).
           02 PASAJEROS-CAR-W       PIC 99.
           02 COMBUSTIBLE-CAR-W     PIC 9.
           02 MARCA-CAR-W           PIC X(20).
           02 MOTOR-CAR-W           PIC X(20).
           02 CHASIS-CAR-W          PIC X(20).
           02 T-OPERAC-CAR-W.
              05 ANO-TOPERAC-CAR-W  PIC 9(4).
              05 MES-TOPERAC-CAR-W  PIC 99.
              05 DIA-TOPERAC-CAR-W  PIC 99.
           02 NATURALEZA-CAR-W      PIC 9.
           02 FONDO-CAR-W           PIC 9V9.
           02 FONDO-R-CAR-W         PIC 9V9.
           02 MODALIDAD-CAR-W       PIC X.
           02 C-COSTO-CAR-W         PIC X(4).
           02 FECHA-AFI-CAR-W.
              05 ANO-AFI-CAR-W      PIC 9(4).
              05 MES-AFI-CAR-W      PIC 99.
              05 DIA-AFI-CAR-W      PIC 99.
           02 FECHA-RET-CAR-W.
              05 ANO-RET-CAR-W      PIC 9(4).
              05 MES-RET-CAR-W      PIC 99.
              05 DIA-RET-CAR-W      PIC 99.
           02 PORC-EMPRESA-CAR-W    PIC 99V99.
           02 FILLER                PIC X(2000).

006310 LINKAGE SECTION.
006320 COPY "P:\PROG\PROYECT\FUENTES\ISAPICTX.CBL".
006330 PROCEDURE DIVISION WITH stdcall LINKAGE USING ISAPI-CTX-CNT.
006340
006350 DECLARATIVES.
006360 I-O-TEST SECTION.
006370     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUNET.         
006380 ESCR-EXCEPTIONES.
006390     IF OTR-STAT = "00"
006400        CONTINUE 
006410     ELSE
006420        MOVE OTR-STAT         TO MSJ1-HTML
006430        MOVE NOM-USU-W        TO MSJ2-HTML
006440        MOVE "TAX015"         TO MSJ3-HTML
006450        GO TO ENVIAR2-ERROR
006460     END-IF.
006470
006480 I-O-TEST SECTION.
006490     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SESION.
006500 ESCR-EXCEPTIONES.
006510     IF OTR-STAT = "00" 
006520        CONTINUE 
006530     ELSE
006540        MOVE OTR-STAT         TO MSJ1-HTML
006550        MOVE NOM-SESION-W     TO MSJ2-HTML
006560        MOVE "TAX015"         TO MSJ3-HTML
006570        GO TO ENVIAR2-ERROR
006580     END-IF.
006590  
006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-MODALIDAD.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-MODAL-W      TO MSJ2-HTML
006680        MOVE "TAX015"         TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

002694 I-O-TEST SECTION.
002700     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-CARROS.
002710 ESCR-EXCEPTIONES.
002720     IF OTR-STAT = "00"
002730        CONTINUE 
002740     ELSE
002750        MOVE OTR-STAT         TO MSJ1-HTML
002760        MOVE NOM-CAR-TAX-LNK  TO MSJ2-HTML
002770        MOVE "TAX015"         TO MSJ3-HTML
002780        GO TO ENVIAR2-ERROR
002790     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-TERCEROS.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-TER-LNK      TO MSJ2-HTML
006680        MOVE "TAX015"         TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-COSTO.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-COST-W       TO MSJ2-HTML
006680        MOVE "TAX015"         TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006720  END DECLARATIVES.
006730
006740 INICIAR-IIS.
006750     MOVE LOW-VALUE TO COBW3.
006760     MOVE FUNCTION ADDR(ISAPI-CTX-CNT) TO COBW3-CONTEXT.
006770     CALL "COBW3_INIT" USING COBW3.
006780
006790 LEER-DATO-HTML.
006800     MOVE "datosh" TO COBW3-SEARCH-DATA.
006810     CALL "COBW3_GET_VALUE" USING COBW3.
006820     MOVE COBW3-GET-DATA    TO LINEA-LLEGAD-W.

           INITIALIZE DATO-LLEGADA-W

           UNSTRING LINEA-LLEGAD-W DELIMITED BY "|"
              INTO SESION-LLEGAD-W, DIRECTORIO-LLEGAD-W, CARPTA-LLEGAD-W, NOVEDAD-W, CODIGO-CAR-W,
                   PROPIET-CAR-W, INTERNO-CAR-W, MODELO-CAR-W, PASAJEROS-CAR-W, COMBUSTIBLE-CAR-W, MARCA-CAR-W
                   MOTOR-CAR-W, CHASIS-CAR-W, T-OPERAC-CAR-W, NATURALEZA-CAR-W, FONDO-EDIT, FONDO-R-EDIT, MODALIDAD-CAR-W,
                   C-COSTO-CAR-W, FECHA-AFI-CAR-W, FECHA-RET-CAR-W, PORCENT-EMPRE-EDIT
           END-UNSTRING.


           MOVE FONDO-EDIT         TO FONDO-CAR-W
           MOVE FONDO-R-EDIT       TO FONDO-R-CAR-W
           MOVE PORCENT-EMPRE-EDIT TO PORC-EMPRESA-CAR-W

           MOVE SESION-LLEGAD-W    TO LLAVE-SESION-W.
           MOVE FUNCTION CURRENT-DATE TO FECHA-TOTAL.
           ACCEPT HORA-TOTAL FROM TIME.

000797 INICIAR-SESION.
000806     MOVE "D:\WEB\MAIN-ELECT\DATOS\SC-SESION.DAT" TO NOM-SESION-W.
000810     GO TO VALIDAR-SESION.
000850
000860 FIN-VALIDAR-SESION.
006840     
006900 ABRIR-USUARIO.
006910     INITIALIZE OTR-STAT.
006920     MOVE "D:\WEB\MAIN-ELECT\DATOS\SC-ARCHUSU.DAT" TO NOM-USU-W
006930
006940     OPEN INPUT ARCHIVO-USUNET
006950     EVALUATE OTR-STAT
006960       WHEN "00"  CONTINUE
006970       WHEN "35"  OPEN OUTPUT ARCHIVO-USUNET
006980                  INITIALIZE REG-USUNET
006990                  WRITE REG-USUNET
007000                  CLOSE ARCHIVO-USUNET
007010                  MOVE "SC-2"                        TO MSJ1-HTML
007020                  MOVE "Falta configurar usuarios"   TO MSJ2-HTML
007030                  MOVE "TAX015"                      TO MSJ3-HTML
007040                  GO TO ENVIAR2-ERROR
007050       WHEN OTHER GO TO CERRAR-SESION
007060     END-EVALUATE.
007070
007080     INITIALIZE LLAVE-USUNET.

007110 LEER-USUARIO.
007120     READ ARCHIVO-USUNET NEXT AT END MOVE 0 TO SW-FIN.
007130
007140     CLOSE ARCHIVO-USUNET.
007200     
007210     IF NOMBRE-USUNET = SPACES
007220     OR NIT-USUNET = ZEROS
007230        MOVE "SC-2"      TO MSJ1-HTML
007240        MOVE "Falta configurar usuarios" TO MSJ2-HTML
007250        MOVE "TAX015"    TO MSJ3-HTML
007260        GO TO ENVIAR2-ERROR
007270     END-IF.
007280 
007350
       ASIGNAR-NOMBRES.

           INITIALIZE NOM-MODAL-W

           INSPECT IP-DATOS-USUNET REPLACING FIRST "/" BY "\"
007287     MOVE "\\" TO NOM-MODAL-W
007288     INSPECT NOM-MODAL-W REPLACING FIRST "                    "
007289                                    BY IP-DATOS-USUNET
007290     INSPECT NOM-MODAL-W REPLACING FIRST " "
007291                                    BY "\"
007292     INSPECT NOM-MODAL-W REPLACING FIRST "                              "
007293                                    BY DIRECTORIO-LLEGAD-W

           MOVE NOM-MODAL-W   TO NOM-CAR-TAX-LNK NOM-TER-LNK NOM-COST-W

007294     INSPECT NOM-MODAL-W REPLACING FIRST "                     "
007295                                      BY "\CONTROL\SC-MODAL.DAT".

           INSPECT NOM-CAR-TAX-LNK REPLACING FIRST "                        "
                                                BY "\CONTROL\SC-ARCHCARR.DAT".

           INSPECT NOM-TER-LNK REPLACING  FIRST "                       "
                                             BY "\CONTROL\SC-ARCHTER.DAT".

           INSPECT NOM-COST-W  REPLACING  FIRST "                       "
                                             BY "\CONTROL\SC-ARCHCOS.DAT".

       ABRIR-CARROS.
           OPEN INPUT ARCHIVO-CARROS.

           MOVE CODIGO-CAR-W  TO CODIGO-CAR
           READ ARCHIVO-CARROS WITH NO LOCK
                INVALID KEY MOVE 1  TO SW-INVALID 
           END-READ

           CLOSE ARCHIVO-CARROS

           IF NOVEDAD-W = 7 AND SW-INVALID = 1 GO TO NUEVO.
           IF NOVEDAD-W = 7 AND SW-INVALID = 0 GO TO ERROR-1.
           IF NOVEDAD-W = 8 AND SW-INVALID = 0 GO TO CAMBIO.
           IF NOVEDAD-W = 8 AND SW-INVALID = 1 GO TO ERROR-1.
           IF NOVEDAD-W = 9 AND SW-INVALID = 0 GO TO RETIRO.
           IF NOVEDAD-W = 9 AND SW-INVALID = 1 GO TO ERROR-1.


       NUEVO.           
           PERFORM LEER-TERCERO
           PERFORM LEER-MODALIDAD
           PERFORM LEER-COSTO

           OPEN I-O ARCHIVO-CARROS
           MOVE REG-CAR-W TO REG-CAR
           WRITE REG-CAR END-WRITE
           CLOSE ARCHIVO-CARROS.

           GO TO PAGINA-CONFIG.

       CAMBIO.
           IF REG-CAR-W = REG-CAR GO TO PAGINA-CONFIG.

           PERFORM LEER-TERCERO
           PERFORM LEER-MODALIDAD
           PERFORM LEER-COSTO


           OPEN I-O ARCHIVO-CARROS
           MOVE REG-CAR-W TO REG-CAR
           REWRITE REG-CAR END-REWRITE
           CLOSE ARCHIVO-CARROS.

           GO TO PAGINA-CONFIG.

       RETIRO.
           OPEN I-O   ARCHIVO-CARROS
           DELETE     ARCHIVO-CARROS
           CLOSE      ARCHIVO-CARROS.

010700 PAGINA-CONFIG.  
010720     MOVE "statuscode" TO COBW3-CNV-NAME
010730     MOVE "00"         TO COBW3-CNV-VALUE
010740     CALL "COBW3_SET_CNV" USING COBW3

000570	   MOVE "datosrecibidos" TO COBW3-CNV-NAME
000580     MOVE "Proceso terminado!" TO COBW3-CNV-VALUE
000590	   CALL "COBW3_SET_CNV"  USING COBW3

010720     MOVE "programa-id" TO COBW3-CNV-NAME
010730     MOVE "TAX015"      TO COBW3-CNV-VALUE
010740     CALL "COBW3_SET_CNV" USING COBW3

010760     MOVE "..\PAGINAS\RECIBIDOSPLANO.ASPX" TO SALIDA-HTML
010770     PERFORM ABRIR-HTML.

007990 CERRAR-SESION.
008000     CALL "COBW3_FREE" USING COBW3.
008010     MOVE 1 TO PROGRAM-STATUS.
008020     EXIT PROGRAM.


       LEER-TERCERO.
           OPEN INPUT ARCHIVO-TERCEROS
           MOVE PROPIET-CAR-W   TO COD-TERCERO

           READ ARCHIVO-TERCEROS WITH NO LOCK
                INVALID KEY
                        MOVE "SC-2"   TO MSJ1-HTML
                        MOVE "Tercero no existe!" TO MSJ2-HTML
                        MOVE "TAX015" TO MSJ3-HTML
                        GO TO ENVIAR2-ERROR
           END-READ
           CLOSE ARCHIVO-TERCEROS.

       LEER-MODALIDAD.
           OPEN INPUT ARCHIVO-MODALIDAD
           MOVE MODALIDAD-CAR-W  TO COD-MOD
           READ ARCHIVO-MODALIDAD WITH NO LOCK
                INVALID KEY
                        MOVE "SC-2"   TO MSJ1-HTML
                        MOVE "Modalidad no existe!" TO MSJ2-HTML
                        MOVE "TAX015" TO MSJ3-HTML
                        GO TO ENVIAR2-ERROR
           END-READ

           CLOSE ARCHIVO-MODALIDAD.

       LEER-COSTO.
           OPEN INPUT ARCHIVO-COSTO
           MOVE C-COSTO-CAR-W  TO COD-COSTO
           READ ARCHIVO-COSTO WITH NO LOCK
                INVALID KEY 
                        MOVE "SC-2"   TO MSJ1-HTML
                        MOVE "C-costo no existe!" TO MSJ2-HTML
                        MOVE "TAX015" TO MSJ3-HTML
                        GO TO ENVIAR2-ERROR
           END-READ

           CLOSE ARCHIVO-COSTO.


       ERROR-1.
           MOVE "SC-2"          TO MSJ1-HTML
           MOVE "Proceso incorrecto!" TO MSJ2-HTML
           MOVE "TAX015"        TO MSJ3-HTML
           GO TO ENVIAR2-ERROR.
008040 COPY "P:\PROG\PROYECT\FUENTES\SC-WEB19.CBL".
