004820*=================================================================
004830* CREA JSON PARA IMPRESION DE COMPROBANTES
004840*=================================================================
004850 IDENTIFICATION DIVISION.
004860 PROGRAM-ID. "HttpExtensionProc".
004870 ENVIRONMENT DIVISION.
004880 CONFIGURATION SECTION.
004890 INPUT-OUTPUT SECTION.
004900 FILE-CONTROL.
004910     COPY "P:\PROG\PROYECT\FUENTES\FS-USUNET.CBL".
004920     COPY "P:\PROG\PROYECT\FUENTES\FS-SESION.CBL".
004930     COPY "P:\PROG\PROYECT\FUENTES\FS-INTER-TAX.CBL".
004930     COPY "P:\PROG\PROYECT\FUENTES\FS-MOVIM.CBL".
           COPY "P:\PROG\PROYECT\FUENTES\FS-CARRO-TAX.CBL".
           COPY "P:\PROG\PROYECT\FUENTES\FS-TERCE.CBL".
           COPY "P:\PROG\PROYECT\FUENTES\FS-MAEST.CBL".

           SELECT ARCHIVO-USUARIOS LOCK MODE IS AUTOMATIC
                  ASSIGN TO NOM-USUAR-W
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC;
                  RECORD KEY IS NOMBRE-USU
                  ALTERNATE RECORD KEY IS CTL-USU     WITH DUPLICATES
                  ALTERNATE RECORD KEY IS CLAVE-USU   WITH DUPLICATES
                  ALTERNATE RECORD KEY IS CLAVE-2-USU WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.

           SELECT ARCHIVO-AGENCIAS LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-AGENC-W
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS CODIGO-AGEN
                  FILE STATUS  IS OTR-STAT.


005080 DATA DIVISION.
005090 FILE SECTION.
005100 COPY "P:\PROG\PROYECT\FUENTES\FD-USUNET.CBL".
005110 COPY "P:\PROG\PROYECT\FUENTES\FD-SESION.CBL".
000690 COPY "P:\PROG\PROYECT\FUENTES\FD-INTER-TAX.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-MOVIM.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-CARRO-TAX.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-TERCE.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-MAEST.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-USUAR.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-AGENC.CBL".

005190 WORKING-STORAGE SECTION.
005200 COPY "P:\PROG\PROYECT\FUENTES\COBW3.CBL".
005210 COPY "P:\PROG\PROYECT\FUENTES\WEB-CARAC19.CBL".
005220 
       77 NOM-USUAR-W                PIC X(70).
       77 NOM-AGENC-W                PIC X(70).
       77 NOM-MODAL-W                PIC X(70).
       77 DATOS-PLANO-W              PIC X(500).
       77 VALOR-EDIT                 PIC ZZZ,ZZZ,ZZZ,ZZZ.
       77 VALOR2-EDIT                PIC ZZZ,ZZZ,ZZZ,ZZZ-.

       01 NUMERO-INT-W               PIC 9(6).


       01 VARIABLES.
          02 VR-BRUTO-T            PIC 9(12).
          02 VR-SEGURO-T           PIC 9(12).
          02 VR-REMESAS-T          PIC 9(12).
          02 VR-AVANCE-T           PIC 9(12).
          02 VR-ABONOS-T           PIC 9(12).
          02 VR-DESCUADRE-T        PIC 9(12).
          02 VR-TOTAL-T            PIC 9(12).

       01 LIN-1.
          02 FILLER                  PIC X(9)   VALUE "{*LIBRO*:".
          02 FILLER                  PIC X      VALUE "*".
          02 LIBRO-INT-J             PIC X(9).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(8)   VALUE "*PLACA*:".
          02 FILLER                  PIC X      VALUE "*".
          02 PLACA-INT-J             PIC X(6).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(11)  VALUE "*VR-BRUTO*:".
          02 FILLER                  PIC X      VALUE "*".
          02 VR-BRUTO-INT-J          PIC X(15).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(12)  VALUE "*VR-SEGURO*:".
          02 FILLER                  PIC X      VALUE "*".
          02 VR-SEGURO-INT-J         PIC X(15).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(13)  VALUE "*VR-REMESAS*:".
          02 FILLER                  PIC X      VALUE "*".
          02 VR-REMESAS-INT-J        PIC X(15).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(12)  VALUE "*VR-AVANCE*:".
          02 FILLER                  PIC X      VALUE "*".
          02 VR-AVANCE-INT-J         PIC X(15).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(12)  VALUE "*VR-ABONOS*:".
          02 FILLER                  PIC X      VALUE "*".
          02 VR-ABONOS-INT-J         PIC X(15).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(15)  VALUE "*VR-DESCUADRE*:".
          02 FILLER                  PIC X      VALUE "*".
          02 VR-DESCUADRE-INT-J      PIC X(15).
003710    02 FILLER                  PIC XX     VALUE "*}".
005040    02 CIERRE-LIN-1            PIC X.


       01 LIN-2.
          02 FILLER                  PIC X(11)  VALUE "{*AGENCIA*:".
          02 FILLER                  PIC X      VALUE "*".
          02 AGENC-INT-J             PIC XX.
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(10)  VALUE "*DESCRIP*:".
          02 FILLER                  PIC X      VALUE "*".
          02 DESCRIP-J               PIC X(25).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(13)  VALUE "*FECHA-COMP*:".
          02 FILLER                  PIC X      VALUE "*".
          02 FECHA-COMP-INT-J        PIC X(8).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(14)  VALUE "*FECHA-PLACA*:".
          02 FILLER                  PIC X      VALUE "*".
          02 FECHA-PLA-INT-J         PIC X(8).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(13)  VALUE "*T-VR-BRUTO*:".
          02 FILLER                  PIC X      VALUE "*".
          02 T-VR-BRUTO-INT-J        PIC X(16).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(14)  VALUE "*T-VR-SEGURO*:".
          02 FILLER                  PIC X      VALUE "*".
          02 T-VR-SEGURO-INT-J       PIC X(16).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(15)  VALUE "*T-VR-REMESAS*:".
          02 FILLER                  PIC X      VALUE "*".
          02 T-VR-REMESAS-INT-J      PIC X(16).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(14)  VALUE "*T-VR-AVANCE*:".
          02 FILLER                  PIC X      VALUE "*".
          02 T-VR-AVANCE-INT-J       PIC X(16).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(14)  VALUE "*T-VR-ABONOS*:".
          02 FILLER                  PIC X      VALUE "*".
          02 T-VR-ABONOS-INT-J       PIC X(16).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(17)  VALUE "*T-VR-DESCUADRE*:".
          02 FILLER                  PIC X      VALUE "*".
          02 T-VR-DESCUADRE-INT-J    PIC X(16).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(11)  VALUE "*VR-TOTAL*:".
          02 FILLER                  PIC X      VALUE "*".
          02 VALOR-TOTAL-J           PIC X(16).
          02 FILLER                  PIC X(5)   VALUE "*}]]}".



006310 LINKAGE SECTION.
006320 COPY "P:\PROG\PROYECT\FUENTES\ISAPICTX.CBL".
006330 PROCEDURE DIVISION WITH stdcall LINKAGE USING ISAPI-CTX-CNT.
006340
006350 DECLARATIVES.
006360 I-O-TEST SECTION.
006370     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUNET.         
006380 ESCR-EXCEPTIONES.
006390     IF OTR-STAT = "00"
006400        CONTINUE 
006410     ELSE
006420        MOVE OTR-STAT         TO MSJ1-HTML
006430        MOVE NOM-USU-W        TO MSJ2-HTML
006440        MOVE "TAX142"         TO MSJ3-HTML
006450        GO TO ENVIAR2-ERROR
006460     END-IF.
006470
006480 I-O-TEST SECTION.
006490     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SESION.
006500 ESCR-EXCEPTIONES.
006510     IF OTR-STAT = "00" 
006520        CONTINUE 
006530     ELSE
006540        MOVE OTR-STAT         TO MSJ1-HTML
006550        MOVE NOM-SESION-W     TO MSJ2-HTML
006560        MOVE "TAX142"         TO MSJ3-HTML
006570        GO TO ENVIAR2-ERROR
006580     END-IF.

006480 I-O-TEST SECTION.
006490     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUARIOS.
006500 ESCR-EXCEPTIONES.
006510     IF OTR-STAT = "00" 
006520        CONTINUE 
006530     ELSE
006540        MOVE OTR-STAT         TO MSJ1-HTML
006550        MOVE NOM-USUAR-W      TO MSJ2-HTML
006560        MOVE "TAX142"         TO MSJ3-HTML
006570        GO TO ENVIAR2-ERROR
006580     END-IF.

006590  
002694 I-O-TEST SECTION.
002700     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-INTER.
002710 ESCR-EXCEPTIONES.
002720     IF OTR-STAT = "00"
002730        CONTINUE 
002740     ELSE
002750        MOVE OTR-STAT          TO MSJ1-HTML
002760        MOVE NOM-INTER-TAX-LNK TO MSJ2-HTML
002770        MOVE "TAX142"          TO MSJ3-HTML
002780        GO TO ENVIAR2-ERROR
002790     END-IF.

002694 I-O-TEST SECTION.
002700     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-CARROS.
002710 ESCR-EXCEPTIONES.
002720     IF OTR-STAT = "00"
002730        CONTINUE 
002740     ELSE
002750        MOVE OTR-STAT         TO MSJ1-HTML
002760        MOVE NOM-CAR-TAX-LNK  TO MSJ2-HTML
002770        MOVE "TAX142"         TO MSJ3-HTML
002780        GO TO ENVIAR2-ERROR
002790     END-IF.

002694 I-O-TEST SECTION.
002700     USE AFTER EXCEPTION PROCEDURE ON MOVIMIENTO-DIARIO.
002710 ESCR-EXCEPTIONES.
002720     IF OTR-STAT = "00"
002730        CONTINUE 
002740     ELSE
002750        MOVE OTR-STAT          TO MSJ1-HTML
002760        MOVE NOM-MOV           TO MSJ2-HTML
002770        MOVE "TAX142"          TO MSJ3-HTML
002780        GO TO ENVIAR2-ERROR
002790     END-IF.

002694 I-O-TEST SECTION.
002700     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-TERCEROS.
002710 ESCR-EXCEPTIONES.
002720     IF OTR-STAT = "00"
002730        CONTINUE 
002740     ELSE
002750        MOVE OTR-STAT          TO MSJ1-HTML
002760        MOVE NOM-TER-LNK       TO MSJ2-HTML
002770        MOVE "TAX142"          TO MSJ3-HTML
002780        GO TO ENVIAR2-ERROR
002790     END-IF.

002694 I-O-TEST SECTION.
002700     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-MAESTROS.
002710 ESCR-EXCEPTIONES.
002720     IF OTR-STAT = "00"
002730        CONTINUE 
002740     ELSE
002750        MOVE OTR-STAT          TO MSJ1-HTML
002760        MOVE NOM-MAE-LNK       TO MSJ2-HTML
002770        MOVE "TAX142"          TO MSJ3-HTML
002780        GO TO ENVIAR2-ERROR
002790     END-IF.

002694 I-O-TEST SECTION.
002700     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-AGENCIAS.
002710 ESCR-EXCEPTIONES.
002720     IF OTR-STAT = "00"
002730        CONTINUE 
002740     ELSE
002750        MOVE OTR-STAT          TO MSJ1-HTML
002760        MOVE NOM-AGENC-W       TO MSJ2-HTML
002770        MOVE "TAX142"          TO MSJ3-HTML
002780        GO TO ENVIAR2-ERROR
002790     END-IF.


006590 
006720  END DECLARATIVES.
006730
006740 INICIAR-IIS.
006750     MOVE LOW-VALUE TO COBW3.
006760     MOVE FUNCTION ADDR(ISAPI-CTX-CNT) TO COBW3-CONTEXT.
006770     CALL "COBW3_INIT" USING COBW3.
006780
006790 LEER-DATO-HTML.
006800     MOVE "datosh" TO COBW3-SEARCH-DATA.
006810     CALL "COBW3_GET_VALUE" USING COBW3.
006820     MOVE COBW3-GET-DATA    TO LINEA-LLEGAD-W.

           INITIALIZE DATO-LLEGADA-W

           UNSTRING LINEA-LLEGAD-W DELIMITED BY "|"
              INTO SESION-LLEGAD-W, DIRECTORIO-LLEGAD-W, CARPTA-LLEGAD-W, NUMERO-INT-W
           END-UNSTRING.

           MOVE SESION-LLEGAD-W    TO LLAVE-SESION-W.
           MOVE FUNCTION CURRENT-DATE TO FECHA-TOTAL.
           ACCEPT HORA-TOTAL FROM TIME.

000797 INICIAR-SESION.
000806     MOVE "D:\WEB\MAIN-ELECT\DATOS\SC-SESION.DAT" TO NOM-SESION-W.
000810     GO TO VALIDAR-SESION.
000850
000860 FIN-VALIDAR-SESION.
006840     
006900 ABRIR-USUARIO.
006910     INITIALIZE OTR-STAT.
006920     MOVE "D:\WEB\MAIN-ELECT\DATOS\SC-ARCHUSU.DAT" TO NOM-USU-W
006930
006940     OPEN INPUT ARCHIVO-USUNET
006950     EVALUATE OTR-STAT
006960       WHEN "00"  CONTINUE
006970       WHEN "35"  OPEN OUTPUT ARCHIVO-USUNET
006980                  INITIALIZE REG-USUNET
006990                  WRITE REG-USUNET
007000                  CLOSE ARCHIVO-USUNET
007010                  MOVE "SC-2"                        TO MSJ1-HTML
007020                  MOVE "Falta configurar usuarios"   TO MSJ2-HTML
007030                  MOVE "TAX142"                      TO MSJ3-HTML
007040                  GO TO ENVIAR2-ERROR
007050       WHEN OTHER GO TO CERRAR-SESION
007060     END-EVALUATE.
007070
007080     INITIALIZE LLAVE-USUNET.

007110 LEER-USUARIO.
007120     READ ARCHIVO-USUNET NEXT AT END MOVE 0 TO SW-FIN.
007130
007140     CLOSE ARCHIVO-USUNET.
007200     
007210     IF NOMBRE-USUNET = SPACES
007220     OR NIT-USUNET = ZEROS
007230        MOVE "SC-2"      TO MSJ1-HTML
007240        MOVE "Falta configurar usuarios" TO MSJ2-HTML
007250        MOVE "TAX142"    TO MSJ3-HTML
007260        GO TO ENVIAR2-ERROR
007270     END-IF.
007280 
007350
       ASIGNAR-NOMBRES.

           INITIALIZE NOM-INTER-TAX-LNK

           INSPECT IP-DATOS-USUNET REPLACING FIRST "/" BY "\"
007287     MOVE "\\" TO NOM-INTER-TAX-LNK
007288     INSPECT NOM-INTER-TAX-LNK REPLACING FIRST "                    "
007289                                            BY IP-DATOS-USUNET
007290     INSPECT NOM-INTER-TAX-LNK REPLACING FIRST " "
007291                                            BY "\"
007292     INSPECT NOM-INTER-TAX-LNK REPLACING FIRST "                              "
007293                                            BY DIRECTORIO-LLEGAD-W

           MOVE NOM-INTER-TAX-LNK  TO NOM-TER-LNK  NOM-MAE-LNK NOM-AGENC-W 
                                      NOM-MOV NOM-USUAR-W NOM-CAR-TAX-LNK

           INSPECT NOM-USUAR-W REPLACING FIRST "                       "
                                            BY "\CONTROL\SC-ARCHUSU.DAT".

           INSPECT NOM-INTER-TAX-LNK REPLACING FIRST "                         "
                                                  BY "\CONTROL\SC-ARCHINTER.DAT".

           INSPECT NOM-CAR-TAX-LNK REPLACING FIRST "                        "
                                                BY "\CONTROL\SC-ARCHCARR.DAT".

           INSPECT NOM-TER-LNK REPLACING FIRST "                       "
                                            BY "\CONTROL\SC-ARCHTER.DAT".

           INSPECT NOM-MAE-LNK REPLACING FIRST "                       "
                                            BY "\CONTROL\SC-ARCHMAE.DAT".

           INSPECT NOM-AGENC-W REPLACING FIRST "                        "
                                            BY "\CONTROL\SC-ARCHAGEN.DAT".

           INSPECT NOM-MOV REPLACING FIRST "     "
                                        BY CARPTA-LLEGAD-W

           INSPECT NOM-MOV REPLACING FIRST "              "
                                        BY "SC-ARCHMOV.DAT".

       ARRIR-INTER.
           OPEN INPUT ARCHIVO-INTER
           MOVE NUMERO-INT-W  TO NUMERO-INT
           START ARCHIVO-INTER KEY = NUMERO-INT
                 INVALID KEY 
                        MOVE "SC-2"    TO MSJ1-HTML
                        MOVE "08"      TO MSJ2-HTML
                        MOVE "TAX142"  TO MSJ3-HTML
                        GO TO ENVIAR2-ERROR
           END-START.


008170     MOVE "{*IMPRESION*:[*TABLA*:[" TO  DATOS-PLANO-W
008180     INSPECT DATOS-PLANO-W REPLACING ALL "*" BY CARAC-COMILLA
008190     PERFORM DATOS-ENVIO.
008200     MOVE 0 TO SW-FIN.
008210 
008220 LEER-INTER.
008230     IF SW-FIN = 0
008240        MOVE 1 TO SW-FIN
008250     ELSE
008260        MOVE LIN-1 TO DATOS-PLANO-W
008270        PERFORM DATOS-ENVIO
008280     END-IF
008290
008300     READ ARCHIVO-INTER NEXT WITH NO LOCK AT END GO TO CERRAR-INTER.
008310     
           IF NUMERO-INT-W = NUMERO-INT
              CONTINUE
           ELSE
              MOVE 0 TO SW-FIN
              GO TO LEER-INTER
           END-IF

           ADD VR-BRUTO-INT     TO VR-BRUTO-T
           ADD VR-SEGURO-INT    TO VR-SEGURO-T
           ADD VR-REMESAS-INT   TO VR-REMESAS-T
           ADD VR-AVANCE-INT    TO VR-AVANCE-T
           ADD VR-ABONOS-INT    TO VR-ABONOS-T

           COMPUTE VR-TOTAL-T = VR-BRUTO-T + VR-SEGURO-T
                              + VR-REMESAS-T - VR-AVANCE-T
                              + VR-ABONOS-T


           MOVE LIBRO-INT      TO LIBRO-INT-J
           MOVE PLACA-INT      TO PLACA-INT-J

           MOVE VR-BRUTO-T     TO VALOR-EDIT
           MOVE VALOR-EDIT     TO VR-BRUTO-INT-J

           MOVE VR-SEGURO-T    TO VALOR-EDIT
           MOVE VALOR-EDIT     TO VR-SEGURO-INT-J

           MOVE VR-REMESAS-T   TO VALOR-EDIT
           MOVE VALOR-EDIT     TO VR-REMESAS-INT-J

           MOVE VR-AVANCE-T    TO VALOR-EDIT
           MOVE VALOR-EDIT     TO VR-AVANCE-INT-J

           MOVE VR-ABONOS-T    TO VALOR-EDIT
           MOVE VALOR-EDIT     TO VR-ABONOS-INT-J

           MOVE VR-TOTAL-T     TO VALOR-EDIT
           MOVE VALOR-EDIT     TO VR-TOTAL-J


           MOVE "," TO CIERRE-LIN-1
           INSPECT LIN-1 REPLACING ALL "*" BY CARAC-COMILLA
           INSPECT LIN-1 REPLACING ALL LOW-VALUES BY SPACES
008850     GO TO LEER-INTER.
008860
008870 CERRAR-INTER.
008880     INITIALIZE LIN-1
008890     MOVE LIN-1 TO DATOS-PLANO-W
008900     PERFORM DATOS-ENVIO.
008910
008920     MOVE "],*DATOS*:[" TO DATOS-PLANO-W
008930     PERFORM DATOS-ENVIO.

           MOVE VR-BRUTO-T    TO VALOR2-EDIT
           MOVE VALOR2-EDIT   TO T-VR-BRUTO-INT-J

           MOVE VR-SEGURO-T   TO VALOR2-EDIT
           MOVE VALOR2-EDIT   TO T-VR-SEGURO-INT-J

           MOVE VR-REMESAS-T  TO VALOR2-EDIT
           MOVE VALOR2-EDIT   TO T-VR-REMESAS-INT-J

           MOVE VR-AVANCE-T   TO VALOR2-EDIT
           MOVE VALOR2-EDIT   TO T-VR-AVANCE-INT-J

           MOVE VR-ABONOS-T   TO VALOR2-EDIT
           MOVE VALOR2-EDIT   TO T-VR-ABONOS-INT-J

           MOVE VR-DESCUADRE-T TO VALOR2-EDIT
           MOVE VALOR2-EDIT    TO T-VR-DESCUADRE-INT-J


           COMPUTE VR-TOTAL-T = VR-BRUTO-T + VR-SEGURO-T
                              + VR-REMESAS-T - VR-AVANCE-T
                              + VR-ABONOS-T - VR-DESCUADRE-T

           MOVE VR-TOTAL-T    TO VALOR2-EDIT
           MOVE VALOR2-EDIT   TO VALOR-TOTAL-J

           INSPECT LIN-2 REPLACING ALL "*" BY CARAC-COMILLA
           INSPECT LIN-2 REPLACING ALL LOW-VALUES BY SPACES
           MOVE LIN-2 TO DATOS-PLANO-W
           PERFORM DATOS-ENVIO

008950     CLOSE ARCHIVO-INTER.

010700 PAGINA-CONFIG.  
010720     MOVE "statuscode" TO COBW3-CNV-NAME
010730     MOVE "00"         TO COBW3-CNV-VALUE
010740     CALL "COBW3_SET_CNV" USING COBW3

010720     MOVE "programa-id" TO COBW3-CNV-NAME
010730     MOVE "TAX142"      TO COBW3-CNV-VALUE
010740     CALL "COBW3_SET_CNV" USING COBW3

010760     MOVE "..\PAGINAS\RECIBIDOSLISTADO.ASPX" TO SALIDA-HTML
010770     PERFORM ABRIR-HTML.

007990 CERRAR-SESION.
008000     CALL "COBW3_FREE" USING COBW3.
008010     MOVE 1 TO PROGRAM-STATUS.
008020     EXIT PROGRAM.

       DATOS-ENVIO.
010720     MOVE "datosrecibidos" TO COBW3-CNV-NAME
010730     MOVE DATOS-PLANO-W    TO COBW3-CNV-VALUE
010740     CALL "COBW3_SET_REPEAT" USING COBW3.
008030
008040 COPY "P:\PROG\PROYECT\FUENTES\SC-WEB19.CBL".
