000010*=================================================================
000020* PRUEBA
000030*=================================================================
000040 IDENTIFICATION DIVISION.
000050 PROGRAM-ID. "HttpExtensionProc".
000060 ENVIRONMENT DIVISION.
000070 CONFIGURATION SECTION.
000080 INPUT-OUTPUT SECTION.
000090 FILE-CONTROL.

           SELECT ARCHIVO-PACIENTES
                  ASSIGN  NOM-PACIE-W
                  ORGANIZATION IS INDEXED;
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS COD-PACI
                  ALTERNATE RECORD KEY  
                  DESCRIP-PACI WITH DUPLICATES
                  ALTERNATE RECORD KEY  
                  EPS-PACI  WITH DUPLICATES
                  ALTERNATE RECORD KEY  
                  ID-COTIZ-PACI WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.


000380 DATA DIVISION.
000390 FILE SECTION.

           COPY "S:\NEWCOBOL\FUENTES\FD-PACIE.CBL".

000540 WORKING-STORAGE SECTION.
000550 COPY "P:\PROG\PROYECT\FUENTES\COBW3.CBL".
000560 COPY "P:\PROG\PROYECT\FUENTES\WEB-CARAC19.CBL".
000570 
       77 NOM-HCDET-W                PIC X(70).
       01 NOM-PACIE-W                PIC X(70).
       77 PORC-CREE-EDIT              PIC Z.ZZ.

000580 01  DATO-LLEGADA-W.
000581     02 ID-LLEGAD-W           PIC X(4).
000582     02 FECHA-LLEGAD-W        PIC X(8).
000583     02 HORA-LLEGAD-W         PIC X(6).


       01 DATOS-PLANO-W.
          02 TABLA-PLANO-W         PIC X(1000) OCCURS 205.


 
       01 DATOS-ENVIO.
          02 DAT0-ENV               PIC XX.
          02 FILLER                 PIC X VALUE "|".
          02 DAT1-ENV               PIC X(29).

       01 SW-ENVIO    PIC X(1024).
       01 END-FLAG    PIC XXX.

      * 01 LIN-01.
      *    02 FILLER                  PIC X(07)  VALUE "{*COD*:".
      *    02 FILLER                  PIC X      VALUE "*".
      *    02 COD-PACI-J              PIC X(15).
      *    02 FILLER                  PIC XX     VALUE "*,".
      *    02 FILLER                  PIC X(12)  VALUE "*DESCRIPCI*:".
      *    02 FILLER                  PIC X      VALUE "*".
      *    02 DESCRIP-PACI-J          PIC X(54).
      *    02 FILLER                  PIC XX     VALUE "*,".
      *    02 FILLER                  PIC X(06)  VALUE "*EPS*:".
      *    02 FILLER                  PIC X      VALUE "*".
      *    02 EPS-PACI-J              PIC X(6).
      *    02 FILLER                  PIC XX     VALUE "*,".
      *    02 FILLER                  PIC X(07)  VALUE "*NACI*:".
      *    02 FILLER                  PIC X      VALUE "*".
      *    02 NACIM-PACI-J            PIC X(8).
      *    02 FILLER                  PIC XX     VALUE "*}".
      *    02 CIERRE-LIN-01           PIC X.


       01 LIN-01.
          02 COD-PACI-J              PIC X(15).
          02 FILLER                  PIC X VALUE ",".
          02 DESCRIP-PACI-J          PIC X(54).
          02 FILLER                  PIC X VALUE ",".
          02 EPS-PACI-J              PIC X(6).
          02 FILLER                  PIC X VALUE ",".
          02 NACIM-PACI-J            PIC X(8).


000590
001084 LINKAGE SECTION.
001085 COPY "P:\PROG\PROYECT\FUENTES\ISAPICTX.CBL".
001086 PROCEDURE DIVISION WITH stdcall LINKAGE USING ISAPI-CTX-CNT.
001087

       DECLARATIVES.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-PACIENTES.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-PACIE-W      TO MSJ2-HTML
006680        MOVE "HC811"          TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR  
006700     END-IF.
      
        END DECLARATIVES.

001810 INICIAR-IIS.
001820     MOVE LOW-VALUE TO COBW3.
001830     MOVE FUNCTION ADDR(ISAPI-CTX-CNT) TO COBW3-CONTEXT.
001840     CALL "COBW3_INIT" USING COBW3.
001850
001851 LEER-DATO-HTML.
001852     MOVE "datosh" TO COBW3-SEARCH-DATA.
001853     CALL "COBW3_GET_VALUE" USING COBW3.
001854     MOVE COBW3-GET-DATA    TO DATO-LLEGADA-W.


       ASIGNAR-NOMBRES.

           MOVE "\\192.168.0.100\SC\MIE\CONTROL\SC-PACIE.DAT" TO NOM-PACIE-W
           OPEN INPUT ARCHIVO-PACIENTES.

      *     MOVE "[" TO DATOS-PLANO-W.
      *     PERFORM CARGAR-DATOS.

       LEER-ARTICULOS.
           READ ARCHIVO-PACIENTES NEXT WITH NO LOCK AT END GO TO ENVIO-DATOS.

           MOVE COD-PACI           TO COD-PACI-J
           MOVE DESCRIP-PACI       TO DESCRIP-PACI-J
           MOVE NACIM-PACI         TO NACIM-PACI-J
           MOVE EPS-PACI           TO EPS-PACI-J

           INSPECT LIN-01 REPLACING ALL "*" BY CARAC-COMILLA

      *     MOVE ","  TO CIERRE-LIN-01
           MOVE LIN-01   TO DATOS-PLANO-W
           INSPECT DATOS-PLANO-W REPLACING ALL LOW-VALUES BY SPACES


           PERFORM CARGAR-DATOS

           GO TO LEER-ARTICULOS.

002147 ENVIO-DATOS.
      *     INITIALIZE COD-PACI-J DESCRIP-PACI-J 
      *     INSPECT LIN-01 REPLACING ALL "*" BY CARAC-COMILLA
      *     MOVE LIN-01   TO DATOS-PLANO-W
      *     PERFORM CARGAR-DATOS
      *     MOVE "]"  TO DATOS-PLANO-W 
      *     PERFORM CARGAR-DATOS.

           CLOSE ARCHIVO-PACIENTES.


010720     MOVE "statuscode" TO COBW3-CNV-NAME
010730     MOVE "00"         TO COBW3-CNV-VALUE
010740     CALL "COBW3_SET_CNV" USING COBW3

010720     MOVE "programa-id" TO COBW3-CNV-NAME
010730     MOVE "TAX802"      TO COBW3-CNV-VALUE
010740     CALL "COBW3_SET_CNV" USING COBW3

010760     MOVE "..\PAGINAS\RECIBIDOSLISTADO.ASPX" TO SALIDA-HTML
010770     PERFORM ABRIR-HTML.
004450   
004580 CERRAR-SESION.
004590     CALL "COBW3_FREE" USING COBW3.
004600     MOVE 1 TO PROGRAM-STATUS.
004610     EXIT PROGRAM.

       ENVIAR2-ERROR.
001550     MOVE "datosrecibidos" TO COBW3-CNV-NAME
001560     MOVE MSJ-HTML         TO COBW3-CNV-VALUE
001570     CALL "COBW3_SET_REPEAT"  USING COBW3
001580     MOVE "..\PAGINAS\RECIBIDOSLISTADO.ASPX" TO SALIDA-HTML
001590     PERFORM ABRIR-HTML.
001600     GO TO CERRAR-SESION.

       CARGAR-DATOS.
      *     IF TABLA-PLANO-W (I) = SPACES OR LOW-VALUES
      *        CONTINUE
      *     ELSE 
              MOVE "datosrecibidos"   TO COBW3-CNV-NAME
              MOVE DATOS-PLANO-W      TO COBW3-CNV-VALUE
              CALL "COBW3_SET_REPEAT" USING COBW3.
      *     END-IF.
000600 ABRIR-HTML.
000610     SET  COBW3-PHYSICALPATH TO TRUE.
000620     CALL "COBW3_GET_REQUEST_INFO" USING COBW3.
000630
000640     IF COBW3-STATUS = ZERO
000650       THEN
000660         MOVE COBW3-REQUEST-INFO TO PATHNAME-W
000670     END-IF.
000680
000690     MOVE SPACE TO COBW3-HTML-FILENAME.
000700     STRING COBW3-REQUEST-INFO(1:COBW3-REQUEST-INFO-LENGTH)
000710      "\"                    DELIMITED BY SIZE
000720      SALIDA-HTML            DELIMITED BY SPACE
000730     INTO COBW3-HTML-FILENAME
000740     CALL "COBW3_PUT_HTML" using COBW3.
004620
004790
