000010 ASIGNAR-NOMBRE-FACTURA.
000020     EVALUATE ITEM-COMP-LNK 
000030        WHEN "1" MOVE 01 TO ITEM-401-LNK
000040        WHEN "2" MOVE 02 TO ITEM-401-LNK
000050        WHEN "3" MOVE 03 TO ITEM-401-LNK
000060        WHEN "4" MOVE 04 TO ITEM-401-LNK
000070        WHEN "5" MOVE 05 TO ITEM-401-LNK
000080        WHEN "6" MOVE 06 TO ITEM-401-LNK
000090        WHEN "7" MOVE 07 TO ITEM-401-LNK
000100        WHEN "8" MOVE 08 TO ITEM-401-LNK
000110        WHEN "9" MOVE 09 TO ITEM-401-LNK
000120
000130        WHEN "A" MOVE 10 TO ITEM-401-LNK
000140        WHEN "B" MOVE 11 TO ITEM-401-LNK
000150        WHEN "C" MOVE 12 TO ITEM-401-LNK
000160        WHEN "D" MOVE 13 TO ITEM-401-LNK
000170        WHEN "E" MOVE 14 TO ITEM-401-LNK
000180        WHEN "F" MOVE 15 TO ITEM-401-LNK
000190        WHEN "G" MOVE 16 TO ITEM-401-LNK
000200        WHEN "H" MOVE 17 TO ITEM-401-LNK
000210        WHEN "I" MOVE 18 TO ITEM-401-LNK
000220        WHEN "J" MOVE 19 TO ITEM-401-LNK
000230        WHEN "K" MOVE 20 TO ITEM-401-LNK
000240        WHEN "L" MOVE 21 TO ITEM-401-LNK
000250        WHEN "M" MOVE 22 TO ITEM-401-LNK
000260        WHEN "N" MOVE 23 TO ITEM-401-LNK
000270        WHEN "O" MOVE 24 TO ITEM-401-LNK
000280        WHEN "P" MOVE 25 TO ITEM-401-LNK
000290        WHEN "Q" MOVE 26 TO ITEM-401-LNK
000300        WHEN "R" MOVE 27 TO ITEM-401-LNK
000310        WHEN "S" MOVE 28 TO ITEM-401-LNK
000320        WHEN "T" MOVE 29 TO ITEM-401-LNK
000330        WHEN "U" MOVE 30 TO ITEM-401-LNK
000340        WHEN "V" MOVE 31 TO ITEM-401-LNK
000350        WHEN "W" MOVE 32 TO ITEM-401-LNK
000360        WHEN "X" MOVE 33 TO ITEM-401-LNK
000370        WHEN "Y" MOVE 34 TO ITEM-401-LNK
000380        WHEN "Z" MOVE 35 TO ITEM-401-LNK
000390       
000400        WHEN "a" MOVE 36 TO ITEM-401-LNK
000410        WHEN "b" MOVE 37 TO ITEM-401-LNK
000420        WHEN "c" MOVE 38 TO ITEM-401-LNK
000430        WHEN "d" MOVE 39 TO ITEM-401-LNK
000440        WHEN "e" MOVE 40 TO ITEM-401-LNK
000450        WHEN "f" MOVE 41 TO ITEM-401-LNK
000460        WHEN "g" MOVE 42 TO ITEM-401-LNK
000470        WHEN "h" MOVE 43 TO ITEM-401-LNK
000480        WHEN "i" MOVE 44 TO ITEM-401-LNK
000490        WHEN "j" MOVE 45 TO ITEM-401-LNK
000500        WHEN "k" MOVE 46 TO ITEM-401-LNK
000510        WHEN "l" MOVE 47 TO ITEM-401-LNK
000520        WHEN "m" MOVE 48 TO ITEM-401-LNK
000530        WHEN "n" MOVE 49 TO ITEM-401-LNK
000540        WHEN "o" MOVE 50 TO ITEM-401-LNK
000550        WHEN "p" MOVE 51 TO ITEM-401-LNK
000560        WHEN "q" MOVE 52 TO ITEM-401-LNK
000570        WHEN "r" MOVE 53 TO ITEM-401-LNK
000580        WHEN "s" MOVE 54 TO ITEM-401-LNK
000590        WHEN "t" MOVE 55 TO ITEM-401-LNK
000600        WHEN "u" MOVE 56 TO ITEM-401-LNK
000610        WHEN "v" MOVE 57 TO ITEM-401-LNK
000620        WHEN "w" MOVE 58 TO ITEM-401-LNK
000630        WHEN "x" MOVE 59 TO ITEM-401-LNK
000640        WHEN "y" MOVE 60 TO ITEM-401-LNK
000650        WHEN "z" MOVE 61 TO ITEM-401-LNK
000660     END-EVALUATE
000670
000680
000690     MOVE "../CONTROL/SC-ARCHn1n1-XX.DAT"   TO NOM-FACT-LNK
000691     MOVE "../CONTROL/SC-ARCHEXn1n1-XX.DAT" TO NOM-FACT2-LNK
000692
000693
000700     INSPECT NOM-FACT-LNK REPLACING FIRST "n1n1"
000701                                    BY    NOMFACT-401-LNK
000702                                       
000703     INSPECT NOM-FACT-LNK REPLACING FIRST "XX" 
000704                                    BY ITEM-401-LNK. 
000705*EXTENSION DE FACTURAS
000706     INSPECT NOM-FACT2-LNK REPLACING FIRST "n1n1"
000707                                     BY    NOMFACT-401-LNK
000708                                       
000709     INSPECT NOM-FACT2-LNK REPLACING FIRST "XX" 
000710                                     BY ITEM-401-LNK. 
000710
