000010 PROCESAR-HEXA.
000020     EVALUATE SUC-NUM-LNK
000030       WHEN 01 MOVE "1"  TO SUC-HEXA-LNK
000040       WHEN 02 MOVE "2"  TO SUC-HEXA-LNK
000050       WHEN 03 MOVE "3"  TO SUC-HEXA-LNK
000060       WHEN 04 MOVE "4"  TO SUC-HEXA-LNK
000070       WHEN 05 MOVE "5"  TO SUC-HEXA-LNK
000080       WHEN 06 MOVE "6"  TO SUC-HEXA-LNK
000090       WHEN 07 MOVE "7"  TO SUC-HEXA-LNK
000100       WHEN 08 MOVE "8"  TO SUC-HEXA-LNK
000110       WHEN 09 MOVE "9"  TO SUC-HEXA-LNK
000120       
000130       WHEN 10 MOVE "A"  TO SUC-HEXA-LNK
000140       WHEN 11 MOVE "B"  TO SUC-HEXA-LNK
000150       WHEN 12 MOVE "C"  TO SUC-HEXA-LNK
000160       WHEN 13 MOVE "D"  TO SUC-HEXA-LNK
000170       WHEN 14 MOVE "E"  TO SUC-HEXA-LNK
000180       WHEN 15 MOVE "F"  TO SUC-HEXA-LNK
000190       WHEN 16 MOVE "G"  TO SUC-HEXA-LNK
000200       WHEN 17 MOVE "H"  TO SUC-HEXA-LNK
000210       WHEN 18 MOVE "I"  TO SUC-HEXA-LNK
000220       WHEN 19 MOVE "J"  TO SUC-HEXA-LNK
000230       WHEN 20 MOVE "K"  TO SUC-HEXA-LNK
000240       WHEN 21 MOVE "L"  TO SUC-HEXA-LNK
000250       WHEN 22 MOVE "M"  TO SUC-HEXA-LNK
000260       WHEN 23 MOVE "N"  TO SUC-HEXA-LNK
000270       WHEN 24 MOVE "O"  TO SUC-HEXA-LNK
000280       WHEN 25 MOVE "P"  TO SUC-HEXA-LNK
000290       WHEN 26 MOVE "Q"  TO SUC-HEXA-LNK
000300       WHEN 27 MOVE "R"  TO SUC-HEXA-LNK
000310       WHEN 28 MOVE "S"  TO SUC-HEXA-LNK
000320       WHEN 29 MOVE "T"  TO SUC-HEXA-LNK
000330       WHEN 30 MOVE "U"  TO SUC-HEXA-LNK
000340       WHEN 31 MOVE "V"  TO SUC-HEXA-LNK
000350       WHEN 32 MOVE "W"  TO SUC-HEXA-LNK
000360       WHEN 33 MOVE "X"  TO SUC-HEXA-LNK
000370       WHEN 34 MOVE "Y"  TO SUC-HEXA-LNK
000380       WHEN 35 MOVE "Z"  TO SUC-HEXA-LNK
000390       
000400       WHEN 36 MOVE "a"  TO SUC-HEXA-LNK
000410       WHEN 37 MOVE "b"  TO SUC-HEXA-LNK
000420       WHEN 38 MOVE "c"  TO SUC-HEXA-LNK
000430       WHEN 39 MOVE "d"  TO SUC-HEXA-LNK
000440       WHEN 40 MOVE "e"  TO SUC-HEXA-LNK
000450       WHEN 41 MOVE "f"  TO SUC-HEXA-LNK
000460       WHEN 42 MOVE "g"  TO SUC-HEXA-LNK
000470       WHEN 43 MOVE "h"  TO SUC-HEXA-LNK
000480       WHEN 44 MOVE "i"  TO SUC-HEXA-LNK
000490       WHEN 45 MOVE "j"  TO SUC-HEXA-LNK
000500       WHEN 46 MOVE "k"  TO SUC-HEXA-LNK
000510       WHEN 47 MOVE "l"  TO SUC-HEXA-LNK
000520       WHEN 48 MOVE "m"  TO SUC-HEXA-LNK
000530       WHEN 49 MOVE "n"  TO SUC-HEXA-LNK
000540       WHEN 50 MOVE "o"  TO SUC-HEXA-LNK
000550       WHEN 51 MOVE "p"  TO SUC-HEXA-LNK
000560       WHEN 52 MOVE "q"  TO SUC-HEXA-LNK
000570       WHEN 53 MOVE "r"  TO SUC-HEXA-LNK
000580       WHEN 54 MOVE "s"  TO SUC-HEXA-LNK
000590       WHEN 55 MOVE "t"  TO SUC-HEXA-LNK
000600       WHEN 56 MOVE "u"  TO SUC-HEXA-LNK
000610       WHEN 57 MOVE "v"  TO SUC-HEXA-LNK
000620       WHEN 58 MOVE "w"  TO SUC-HEXA-LNK
000630       WHEN 59 MOVE "x"  TO SUC-HEXA-LNK
000640       WHEN 60 MOVE "y"  TO SUC-HEXA-LNK
000650       WHEN 61 MOVE "z"  TO SUC-HEXA-LNK
000660     END-EVALUATE. 
