000010
000020 IDENTIFICATION DIVISION.
000030 PROGRAM-ID. CON003.
000040*********** MUESTRA EL NOMBRE DEL OPERADOR **********
000050 ENVIRONMENT DIVISION.
000060 CONFIGURATION SECTION.
000070 SOURCE-COMPUTER. PROSOFT.
000080 OBJECT-COMPUTER. PROSOFT.
000090 INPUT-OUTPUT SECTION.
000100 FILE-CONTROL.
000110 COPY "P:\PROG\PROYECT\FUENTES\FS-RESTR.CBL".
000120
000130 DATA DIVISION.
000140 FILE SECTION.
000150 COPY "P:\PROG\PROYECT\FUENTES\FD-RESTR.CBL".
000160
000170 WORKING-STORAGE SECTION.
000180 COPY "P:\PROG\PROYECT\FUENTES\WEB-CARAC.CBL".
000190
000200 LINKAGE SECTION.
000210 77 OPER-W             PIC X(4).
000220 77 NOMBRE-OPER-W      PIC X(30).
000230 77 IDENT-OPER-W       PIC 9(10).
000231 77 IN-W               PIC X(80).
000240
000250 PROCEDURE DIVISION USING OPER-W NOMBRE-OPER-W IDENT-OPER-W IN-W.
000260 DECLARATIVES.
000270 I-O-TEST SECTION.
000280     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-RESTRICCION.
000290 ESCR-EXCEPTIONES.
000300     IF OTR-STAT IS NOT EQUAL TO "00"
000310        MOVE OTR-STAT TO IN-W
000330        GO TO SALIR.
000340
000350 END DECLARATIVES.
000360 PROCEDURAL SECTION.
000370 LEER-OPERADOR.
000380     OPEN INPUT ARCHIVO-RESTRICCION.
000390
000400     INITIALIZE REG-REST.
000410     IF OPER-W = "GEBC"
000420        MOVE "Prosoft E.A.T"  TO NOMBRE-REST
000430        MOVE 0017329215       TO ID-REST
000440     ELSE
000450        IF OPER-W = SPACES
000460           MOVE SPACES TO NOMBRE-REST
000470           MOVE 0      TO ID-REST
000480        ELSE
000490           MOVE OPER-W TO COD-REST
000500           READ ARCHIVO-RESTRICCION INVALID KEY
000510                MOVE COD-REST TO NOMBRE-REST
000520           END-READ
000530        END-IF.
000540
000550*     MOVE NOMBRE-REST   TO 3.
000560     INSPECT ID-REST REPLACING ALL " " BY "0".
000570     MOVE ID-REST       TO IDENT-OPER-W.
000580     CLOSE ARCHIVO-RESTRICCION.
000590
000600 SALIR.
000610     EXIT PROGRAM.
