000010
000020 IDENTIFICATION DIVISION.
000030 PROGRAM-ID. CON003A.
000040*********** DEVUELVE LA DEPENDENCIA DEL OPERADOR **********
000050 ENVIRONMENT DIVISION.
000060 CONFIGURATION SECTION.
000070 SOURCE-COMPUTER. PROSOFT.
000080 OBJECT-COMPUTER. PROSOFT.
000090 INPUT-OUTPUT SECTION.
000100 FILE-CONTROL.
000110 COPY "P:\PROG\PROYECT\FUENTES\FS-RESTR.CBL".
000120 COPY "P:\PROG\PROYECT\FUENTES\FS-DEPEN.CBL".
000130
000140 DATA DIVISION.
000150 FILE SECTION.
000160 COPY "P:\PROG\PROYECT\FUENTES\FD-RESTR.CBL".
000170 COPY "P:\PROG\PROYECT\FUENTES\FD-DEPEN.CBL".
000180
000190 WORKING-STORAGE SECTION.
000200 COPY "P:\PROG\PROYECT\FUENTES\WEB-CARAC.CBL".
000210
000220 LINKAGE SECTION.
000230 77 OPER-W             PIC X(4).
000240 01 DEPEN-W.
000250    02 DEPEN1-W        PIC 9.
000260    02 DEPEN2-W        PIC 99.
000270 01 INVALID-W          PIC X(80).
000280	   
000290 PROCEDURE DIVISION USING OPER-W DEPEN-W INVALID-W.
000300 DECLARATIVES.
000310 I-O-TEST SECTION.
000320     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-RESTRICCION.
000330 ESCR-EXCEPTIONES.
000340     IF OTR-STAT IS NOT EQUAL TO "00"
000360        MOVE OTR-STAT TO INVALID-W
000370        GO TO SALIR.
000380
000390 I-O-TEST2 SECTION.
000400     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-DEPENDENCIAS.
000410 ESCR-EXCEPTIONES.
000420     IF OTR-STAT = "00" OR "35"
000430        CONTINUE
000440     ELSE
000460        MOVE OTR-STAT TO INVALID-W
000470     GO TO SALIR.
000480
000490 END DECLARATIVES.
000500 PROCEDURAL SECTION.
000510 LEER-OPERADOR.
000520     OPEN INPUT ARCHIVO-RESTRICCION.
000530     IF OTR-STAT IS NOT = "00"
000540        MOVE 000 TO DEPEN-W
000550        GO TO SALIR.
000560
000570     INITIALIZE REG-REST.
000580     IF OPER-W = SPACES
000590        MOVE 000 TO DEPEN-REST
000600     ELSE
000610        MOVE OPER-W TO COD-REST
000620        READ ARCHIVO-RESTRICCION INVALID KEY
000630             MOVE 000 TO DEPEN-REST
000640        END-READ
000650     END-IF.
000660     CLOSE ARCHIVO-RESTRICCION.
000670
000680     IF DEPEN-REST IS NOT NUMERIC
000690        MOVE 000 TO DEPEN-REST.
000700
000710
000720 ABRIR-DEPENDENCIA.
000730     OPEN INPUT ARCHIVO-DEPENDENCIAS.
000740     EVALUATE OTR-STAT
000750     WHEN "00"  CONTINUE
000760     WHEN "35"  OPEN OUTPUT ARCHIVO-DEPENDENCIAS
000770                MOVE 000    TO COD-DEPEN
000780                MOVE "SIN DEPENDENCIA" TO DESCRIP-DEPEN
000790                MOVE 00                TO CONF-IMPRES-DEPEN
000800                WRITE REG-DEPEN
000810                CLOSE       ARCHIVO-DEPENDENCIAS
000820                OPEN INPUT  ARCHIVO-DEPENDENCIAS
000830     WHEN OTHER MOVE 000 TO DEPEN-W
000840                GO TO SALIR.
000850
000860     MOVE DEPEN-REST TO COD-DEPEN.
000870     READ ARCHIVO-DEPENDENCIAS
000880          INVALID KEY MOVE 00 TO CONF-IMPRES-DEPEN
000890     END-READ.
000900     MOVE 0                 TO DEPEN1-W.
000910     MOVE CONF-IMPRES-DEPEN TO DEPEN2-W.
000920     CLOSE ARCHIVO-DEPENDENCIAS.
000930
000940 SALIR.
000950     EXIT PROGRAM.
