000010
000020 IDENTIFICATION DIVISION.
000030 PROGRAM-ID. CON904S.
000040
000050*  Sistema de seguridad- Busca si hay restricciones.
000060*  no muestra mensaje de error.
000070
000080 ENVIRONMENT DIVISION.
000090 CONFIGURATION SECTION.
000100 SOURCE-COMPUTER. PROSOFT.
000110 OBJECT-COMPUTER. PROSOFT.
000120 INPUT-OUTPUT SECTION.
000130 FILE-CONTROL.
000140 COPY "P:\PROG\PROYECT\FUENTES\FS-RESTR.CBL".
000150
000160 DATA DIVISION.
000170 FILE SECTION.
000180 COPY "P:\PROG\PROYECT\FUENTES\FD-RESTR.CBL".
000190
000200 WORKING-STORAGE SECTION.
000210 77  NOMBRE-OPER          PIC X(30).
000220 77  NOMBRE-BMP           PIC X(40).
000230
000240 COPY "P:\PROG\PROYECT\FUENTES\WEB-CARAC.CBL".
000250 LINKAGE SECTION.
000260 01  ADMIN-W              PIC X(4).
000270 01  COD-W                PIC X(6).
000280 01  INVALID-W            PIC 99.
000290
000291 PROCEDURE DIVISION USING ADMIN-W COD-W INVALID-W.
000300 DECLARATIVES.
000310 I-O-TEST SECTION.
000320      USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-RESTRICCION.
000330 ESCR-EXCEPCIONES.
000340     IF OTR-STAT  IS NOT EQUAL TO "00"
000350        MOVE OTR-STAT TO INVALID-LNK       
000360        GO TO SALIR.
000370
000380 END DECLARATIVES.
000390 PROCEDURAL SECTION.
000400 REVISAR-DATO.
000410     IF ADMIN-W = "GEBC"
000420        IF COD-W = "X1"
000430           MOVE 01             TO INVALID-W
000440        ELSE
000450           MOVE 00             TO INVALID-W
000460        END-IF
000470        MOVE "ACCESO ESPECIAL" TO NOMBRE-OPER
000480        GO TO SALIR.
000490
000500     OPEN INPUT ARCHIVO-RESTRICCION.
000510     IF OTR-STAT IS NOT EQUAL TO "00"
000520        MOVE 1 TO INVALID-W
000530        GO TO SALIR.
000540
000550     MOVE ADMIN-W   TO COD-REST.
000560     MOVE SPACES    TO OPC-REST.
000570     MOVE 00        TO INVALID-W.
000580
000590     READ ARCHIVO-RESTRICCION
000600          INVALID KEY MOVE 01 TO INVALID-W
000610                      GO TO FIN
000620          NOT INVALID KEY MOVE NOMBRE-REST TO NOMBRE-OPER.
000630
000640     MOVE ADMIN-W   TO COD-REST.
000650     MOVE COD-W     TO OPC-REST.
000660     READ ARCHIVO-RESTRICCION
000670          INVALID KEY     MOVE 00 TO INVALID-W
000680          NOT INVALID KEY MOVE 01 TO INVALID-W.
000690
000700 FIN.
000710        CLOSE ARCHIVO-RESTRICCION.
000720
000730 SALIR.
000740         EXIT PROGRAM.
000750
