000010
000020 IDENTIFICATION DIVISION.
000030 PROGRAM-ID. SC-SALUD.
000040*
000050*  LLENA EL NOMBRE DEL ARCHIVO DE SALUD Y PACIENTES.
000060*
000070
000080 ENVIRONMENT DIVISION.
000090 CONFIGURATION SECTION.
000100 SOURCE-COMPUTER. PROSOFT.
000110 OBJECT-COMPUTER. PROSOFT.
000120 INPUT-OUTPUT SECTION.
000130 FILE-CONTROL.
000140
000150         SELECT ARCHIVO-USUARIOS LOCK MODE IS AUTOMATIC
000160            ASSIGN NOM-USUAR-W
000170            ORGANIZATION IS INDEXED
000180            ACCESS MODE IS DYNAMIC;
000190            RECORD KEY IS NOMBRE-USU 
000200            ALTERNATE RECORD KEY IS		
000210            CLAVE-USU WITH DUPLICATES
000220            ALTERNATE RECORD KEY IS
000230            CTL-USU WITH DUPLICATES
000240            ALTERNATE RECORD KEY IS
000250            CLAVE-2-USU WITH DUPLICATES
000260            FILE STATUS IS OTR-STAT.
000270
000280 DATA DIVISION.
000290 FILE SECTION.
000300 COPY "P:\PROG\PROYECT\FUENTES\FD-USUAR.CBL".
000310
000320
000330 WORKING-STORAGE SECTION.
000340 COPY "P:\PROG\PROYECT\FUENTES\WEB-CARAC.CBL".
000350 77 OPCION-1          PIC X.
000360 77 USU-STAT          PIC XX.
000370 77 NOM-USUAR-W       PIC X(70).
000380 01 FECHA-ACT.
000390    02 ANO-ACT        PIC 99.
000400    02 MES-ACT        PIC 99.
000410    02 DIA-ACT        PIC 99.
000420
000430 01 NOM-EDIT.
000440    02 CAR-EDIT       PIC X OCCURS 35.
000450
000460
000470 LINKAGE SECTION.
000471 01  INVALID-W            PIC X(80).
000480 01  NOM-SALUD-J.
000490     02  NOM-PACIE-ENV    PIC X(35).
000500     02  NOM-SALUD-ENV    PIC X(35).
000510     02  NOM-CITAS-ENV    PIC X(35).
000520     02  NOM-HICLI-ENV    PIC X(35).
000530     02  NOM-EVOL-ENV     PIC X(35).
000540     02  NOM-CIREVO-ENV   PIC X(35).
000550     02  NOM-ENVIO-ENV    PIC X(35).
000560     02  NOM-HCAPE-ENV    PIC X(35).
000570     02  NOM-PROFE-ENV    PIC X(35).
000580     02  NOM-HCEVO-ENV    PIC X(35).
000590     02  NOM-DETEVO-ENV   PIC X(35).
000600     02  NOM-ACTIV-ENV    PIC X(35).
000610     02  NOM-RECOME-ENV   PIC X(35).
000620     02  FILLER           PIC X(70).
000630
000640
000650 PROCEDURE DIVISION USING NOM-SALUD-J INVALID-W.
000660 
000670 DECLARATIVES.
000680 I-O-TEST SECTION.
000690     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUARIOS.
000700 ESCR-EXCEPTIONES.
000710     IF OTR-STAT = "00"
000720        CONTINUE            
000730     ELSE
000740        MOVE OTR-STAT             TO INVALID-W
000780        END-IF. 
000790 END DECLARATIVES.
000800
000810 PROCEDURAL SECTION.
000820
000830 LEER-USUARIO.
000840     OPEN INPUT  ARCHIVO-USUARIOS. 
000880      
000890     IF (PUC-USU = 4 OR 6)
000900        MOVE "/newcobol/datos/SC-ACTIOFI.DAT" TO NOM-ACTIV-ENV
000910     ELSE
000920        MOVE "/PROG/DATOS/ARCHACT.DAT"    TO NOM-ACTIV-ENV
000930     END-IF.
000940
000950     IF PREFIJO-USU = SPACES
000960        MOVE "00" TO PREFIJO-USU.
000970
000980     MOVE ARCHTER-USU TO NOM-PACIE.
000990
001000     INSPECT NOM-PACIE-ENV REPLACING FIRST "ARCHTER     "
001010                                 BY    "SC-PACIE.DAT".
001020
001030* OME CAJICA COMPARTE PACIENTE CON EL HOSPITAL CAJICA  R4
001040*     IF (NIT-USU = 900685768 OR 900913665)
001050*        INSPECT NOM-PACIE REPLACING FIRST "\OME"
001060*                                    BY    "   \"
001070*        INSPECT NOM-PACIE REPLACING FIRST "\IPS"
001080*                                    BY    "   \"
001090*        MOVE NOM-PACIE TO NOM-EDIT
001100*        PERFORM EDITAR-NOMBRE UNTIL
001110*                CAR-EDIT (1) IS NOT = SPACES
001120*        MOVE NOM-EDIT TO NOM-PACIE
001130*     END-IF.
001140
001150
001160     MOVE DIRECTORIO-USU TO NOM-SALUD-ENV
001170     INSPECT NOM-SALUD-ENV REPLACING FIRST "                     "
001180                                 BY    "\CONTROL\SC-FACSA.DAT".
001190
001200     MOVE DIRECTORIO-USU TO NOM-ENVIO-ENV.
001210     INSPECT NOM-ENVIO-ENV REPLACING FIRST "                     "
001220                                 BY    "\CONTROL\ARCH-ENV.DAT".
001230
001240     MOVE "\PROG\HC\DATOS\SC-AGEND.DAT"  TO NOM-CITAS-ENV
001250     MOVE "\NEWCOBOL\HC\DATOS\SC-RECOM.DAT"  TO NOM-RECOME-ENV.
001260     MOVE "\NEWCOBOL\HC\DATOS\SC-HICLI.DAT"  TO NOM-HICLI-ENV.
001270     MOVE "\PROG\HC\DATOS\SC-HCAPER.S17" TO NOM-HCAPE-ENV.
001280
001290     ACCEPT FECHA-ACT FROM DATE.
001300     MOVE "\NEWCOBOL\HC\DATOS\SC-EVOLUX1.DAT" TO NOM-EVOL-ENV
001310     INSPECT NOM-EVOL-ENV REPLACING FIRST "X1" BY ANO-ACT.
001320
001330
001340     MOVE "\NEWCOBOL\HC\DATOS\SC-HCEVOX1.S17"  TO NOM-HCEVO-ENV.
001350     INSPECT NOM-HCEVO-ENV REPLACING FIRST "X1" BY ANO-ACT.
001360
001370     MOVE "\NEWCOBOL\HC\DATOS\SC-DETEVOX1.S17" TO NOM-DETEVO-ENV.
001380     INSPECT NOM-DETEVO-ENV REPLACING FIRST "X1" BY ANO-ACT.
001390
001400     MOVE "\NEWCOBOL\HC\DATOS\SC-CIREV.DAT"  TO NOM-CIREVO-ENV.
001410
001420
001430 SALIR.
001440        EXIT PROGRAM.
001450
001460
001470 EDITAR-NOMBRE.
001480     IF CAR-EDIT (1) = SPACES
001490        MOVE CAR-EDIT (2)  TO CAR-EDIT (1)
001500        MOVE CAR-EDIT (3)  TO CAR-EDIT (2)
001510        MOVE CAR-EDIT (4)  TO CAR-EDIT (3)
001520        MOVE CAR-EDIT (5)  TO CAR-EDIT (4)
001530        MOVE CAR-EDIT (6)  TO CAR-EDIT (5)
001540        MOVE CAR-EDIT (7)  TO CAR-EDIT (6)
001550        MOVE CAR-EDIT (8)  TO CAR-EDIT (7)
001560        MOVE CAR-EDIT (9)  TO CAR-EDIT (8)
001570        MOVE CAR-EDIT (10) TO CAR-EDIT (9)
001580        MOVE CAR-EDIT (11) TO CAR-EDIT (10)
001590        MOVE CAR-EDIT (12) TO CAR-EDIT (11)
001600        MOVE CAR-EDIT (13) TO CAR-EDIT (12)
001610        MOVE CAR-EDIT (14) TO CAR-EDIT (13)
001620        MOVE CAR-EDIT (15) TO CAR-EDIT (14)
001630        MOVE CAR-EDIT (16) TO CAR-EDIT (15)
001640        MOVE CAR-EDIT (17) TO CAR-EDIT (16)
001650        MOVE CAR-EDIT (18) TO CAR-EDIT (17)
001660        MOVE CAR-EDIT (19) TO CAR-EDIT (18)
001670        MOVE CAR-EDIT (20) TO CAR-EDIT (19)
001680        MOVE CAR-EDIT (21) TO CAR-EDIT (20)
001690        MOVE CAR-EDIT (22) TO CAR-EDIT (21)
001700        MOVE CAR-EDIT (23) TO CAR-EDIT (22)
001710        MOVE CAR-EDIT (24) TO CAR-EDIT (23)
001720        MOVE CAR-EDIT (25) TO CAR-EDIT (24)
001730        MOVE CAR-EDIT (26) TO CAR-EDIT (25)
001740        MOVE CAR-EDIT (27) TO CAR-EDIT (26)
001750        MOVE CAR-EDIT (28) TO CAR-EDIT (27)
001760        MOVE CAR-EDIT (29) TO CAR-EDIT (28)
001770        MOVE CAR-EDIT (30) TO CAR-EDIT (29)
001780        MOVE CAR-EDIT (31) TO CAR-EDIT (30)
001790        MOVE CAR-EDIT (32) TO CAR-EDIT (31)
001800        MOVE CAR-EDIT (33) TO CAR-EDIT (32)
001810        MOVE CAR-EDIT (34) TO CAR-EDIT (33)
001820        MOVE CAR-EDIT (35) TO CAR-EDIT (34)
001830        MOVE SPACES        TO CAR-EDIT (35)
001840     END-IF.
