000020*=================================================================
000060*ACTUALIZA ARCHIVO DE USUARIOS-USUNET
000061*=================================================================
000130 IDENTIFICATION DIVISION.
000140 PROGRAM-ID. "HttpExtensionProc".
000150 ENVIRONMENT DIVISION.
000160 CONFIGURATION SECTION.
000170 INPUT-OUTPUT SECTION.
000171 FILE-CONTROL.
000172 COPY "P:\PROG\PROYECT\FUENTES\FS-USUNET.CBL".
000185 COPY "P:\PROG\PROYECT\FUENTES\FS-SESION.CBL".
000186
000190 DATA DIVISION.
000191 FILE SECTION.
000192 COPY "P:\PROG\PROYECT\FUENTES\FD-USUNET.CBL".
000194 COPY "P:\PROG\PROYECT\FUENTES\FD-SESION.CBL".
000195
000200 WORKING-STORAGE SECTION.
000201 COPY "P:\PROG\PROYECT\FUENTES\COBW3.CBL".
000202 COPY "P:\PROG\PROYECT\FUENTES\WEB-CARAC.CBL".
000208
000209 77  SW-VAR                    PIC 99.
000210 77  K                         PIC 99.
000211
000212 01  DATO-LLEGADA-W.
000213     02 CAMPO-W  OCCURS  500   PIC X.
000214 
000215 01  TABLA-W.
000216     02 CM-W     OCCURS 60     PIC X.
000217
000218 01  EDITADO-W                 PIC X(12).
000219
000220 01  DATO-W.
000221     02 ID-EDIT-W              PIC X(4).
000222     02 CLAVE-W                PIC X(6).
000223
000224 01 COD-TMP.
000225    02 SW-ALFA                 PIC 9.
000226    02 TABLA-COD1.
000227       03 COD1-PAC             PIC X OCCURS 10.
000228    02 TABLA-COD2.
000229       03 COD2-PAC             PIC X OCCURS 10.
000230
000350 01  REG-USUNET-W.
000351     02 LLAVE-USUNET-W         PIC 9.
000353     02 NOMBRE-USUNET-W        PIC X(60).
000354     02 NIT-USUNET-W           PIC 9(10).
000355     02 DV-USUNET-W            PIC 9.
000356     02 DIRECC-USUNET-W.
000357        03 DIRECC1-USUNET-W    PIC X(30).
000358        03 DIRECC2-USUNET-W    PIC X(30).
000359     02 CLAVE-USUNET-W         PIC X(8).
000360     02 EMAIL-USUNET-W         PIC X(60).
000361     02 SERV-EMAIL-USUNET-W    PIC X(30).
000362     02 CLAVE-EMAIL-USUNET-W   PIC X(30).
000363     02 SSL-EMAIL-USUNET-W     PIC X.
000366     02 IP-DATOS-USUNET-W      PIC X(20).
000367     02 PUERTO-EMAIL-USUNET-W  PIC X(4).
000368     02 IP-DESCARGA-USUNET-W   PIC X(20).
000369     02 DIR-SITIO-USUNET-W     PIC X(10).
000370     02 GS128-PREDIAL-USUNET-W PIC X(13).
000371     02 GS128-INDUSTR-USUNET-W PIC X(13).
000372     02 SERV-SQL-USUNET-W      PIC X(20).
000373     02 DIRECTORIO-USUNET-W    PIC X(30).
           02 IVA-USUNET-W           PIC 99.
           02 IVA-2-USUNET-W         PIC 99.
           02 IVA-3-USUNET-W         PIC 99.
           02 SUC-USUNET-W           PIC 99.
           02 CONS-FACT-USUNET-W     PIC 9(6).
           02 ALM-USUNET-W           PIC X(5).
000374     02 FILLER                 PIC X(1871).
000375
000376
000377 01 LINEA-EDIT.
000384    02 VERIFICAR0-L            PIC XX.
000385    02 FILLER                  PIC X VALUE "|".
000386    02 VERIFICAR1-L            PIC X(30).
000394    02 FILLER                  PIC X VALUE "|".
000404    02 VERIFICAR2-L            PIC X(6).
000414    02 FILLER                  PIC X VALUE "|".
000424
000450 LINKAGE SECTION.
000460 COPY "P:\PROG\PROYECT\FUENTES\ISAPICTX.CBL".
000470*
000480 PROCEDURE DIVISION WITH stdcall LINKAGE USING ISAPI-CTX-CNT.
000490
000491 DECLARATIVES.
000492 I-O-TEST1 SECTION.
000493     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUNET.         
000494 ESCR-EXCEPTIONES.
000495     IF OTR-STAT = "00" OR "35"
000496        CONTINUE 
000497     ELSE
000498        MOVE OTR-STAT                TO MENSAJE1-HTML
000499        MOVE NOM-USU-W               TO MENSAJE2-HTML
000500        MOVE "HC-NTAS001_R1"         TO MENSAJE3-HTML
000506        GO TO ENVIAR-ERROR
000509     END-IF.
000510
000514  END DECLARATIVES.
000517
000518 INICIAR-IIS.
000530     MOVE LOW-VALUE TO COBW3.
000540     MOVE FUNCTION ADDR(ISAPI-CTX-CNT) TO COBW3-CONTEXT.
000760     CALL "COBW3_INIT" USING COBW3.
000780 
000781 LEER-DATO-HTML.
000782     INITIALIZE REG-USUNET-W
000783     MOVE "datosh" TO COBW3-SEARCH-DATA.
000784     CALL "COBW3_GET_VALUE" USING COBW3.
000785     MOVE COBW3-GET-DATA    TO DATO-LLEGADA-W.
000786     
000787     MOVE 0 TO SW-VAR
000788     MOVE 1 TO K
000789     INITIALIZE DATO-W  TABLA-W
000790     PERFORM LLENAR-DATOS VARYING J FROM 1 BY 1
000791                            UNTIL J > 500.
000796
000797 INICIAR-SESION.
000806     MOVE "D:\WEB\HC-NTAS-EVOL\DATOS\SC-SESION.DAT" TO NOM-SESION-W
000820     MOVE FUNCTION CURRENT-DATE TO FECHA-TOTAL.
000830     ACCEPT HORA-TOTAL FROM TIME.
000810     GO TO VALIDAR-SESION.
000850
000860 FIN-VALIDAR-SESION.
000870     
001197 GRABAR-USUARIO.
001263     MOVE "D:\WEB\HC-NTAS-EVOL\DATOS\SC-ARCHUSU.DAT" TO NOM-USU-W
001264
001265     OPEN INPUT ARCHIVO-USUNET
001266
001267     EVALUATE OTR-STAT
001268      WHEN "00"  CLOSE    ARCHIVO-USUNET
001269                 OPEN I-O ARCHIVO-USUNET
001270      WHEN "35"  OPEN OUTPUT ARCHIVO-USUNET
001271                 INITIALIZE REG-USUNET
001272                 WRITE REG-USUNET
001273                 CLOSE ARCHIVO-USUNET
001274                 GO TO GRABAR-USUARIO
001275      WHEN OTHER GO TO CERRAR-SESION.
001276
001277     MOVE REG-USUNET-W TO REG-USUNET
001278     READ ARCHIVO-USUNET WITH NO LOCK
001279          INVALID KEY
001280            WRITE REG-USUNET END-WRITE
001281          NOT INVALID KEY
001282            MOVE REG-USUNET-W TO REG-USUNET
001283            REWRITE REG-USUNET END-REWRITE
001284     END-READ.
001285     CLOSE ARCHIVO-USUNET.
001286
001287 PAGINA-ENVIO.        
001288     MOVE "00"                      TO VERIFICAR0-L
001289     MOVE "Guardado exitosamente! " TO VERIFICAR1-L
001290     MOVE "BAR001"                  TO VERIFICAR2-L
001291     
001292     MOVE "datosrecibidos"   TO COBW3-CNV-NAME
001293     MOVE LINEA-EDIT         TO COBW3-CNV-VALUE
001294     CALL "COBW3_SET_CNV" USING COBW3
001295     
001296     MOVE "..\PAGINAS\recibidos.aspx" TO SALIDA-HTML  
001297     PERFORM ABRIR-HTML.
001298     GO TO CERRAR-SESION.
001299
001300
001301 CERRAR-SESION.
001302     CALL "COBW3_END_SESSION" using COBW3.
001307     CALL "COBW3_FREE" USING COBW3.
001311     MOVE 1 TO PROGRAM-STATUS.
001312     EXIT PROGRAM.
002120
002151 COPY "P:\PROG\PROYECT\FUENTES\SC-WEB.CBL".
002177
002187 EDITAR-NUMERO.
002188     INSPECT EDITADO-W  CONVERTING  "ABCDEFGHIJKLMNOPQRSTUVWXYZ"
002189                                 TO "                          ".
002190
002191     MOVE EDITADO-W  TO TABLA-COD1.
002192     INITIALIZE    TABLA-COD2 SW-ALFA.
002193     MOVE 10 TO LP.
002194     PERFORM MOVER-COD VARYING LN FROM 10 BY -1
002195                         UNTIL LN < 1 OR LP < 1.
002196
002197     INSPECT TABLA-COD2 REPLACING ALL " " BY "0".
002198         
002199 MOVER-COD.
002200     IF COD1-PAC (LN) IS NUMERIC
002201     OR COD1-PAC (LN) = "-"     
002202        MOVE COD1-PAC (LN) TO COD2-PAC (LP)
002203        SUBTRACT 1 FROM LP
002204     END-IF.
002205
002206 LLENAR-DATOS.
002207     IF CAMPO-W(J) = "|"
002208        ADD 1  TO SW-VAR J
002209        MOVE 1 TO K  
              IF SW-VAR = 1
                 MOVE TABLA-W TO LLAVE-SESION-W
              END-IF
002210        IF SW-VAR = 2
002219           MOVE TABLA-W TO NOMBRE-USUNET-W           
002220        END-IF
002221        IF SW-VAR = 3
002222           MOVE TABLA-W TO NIT-USUNET-W   
002223        END-IF
002224        IF SW-VAR = 4
002225           MOVE TABLA-W TO DIRECC1-USUNET-W           
002226        END-IF
002227        IF SW-VAR = 5
002228           MOVE TABLA-W TO EMAIL-USUNET-W           
002229        END-IF
002230        IF SW-VAR = 6
002231           MOVE TABLA-W TO CLAVE-EMAIL-USUNET-W           
002232        END-IF
002233        IF SW-VAR = 7
002234           MOVE TABLA-W TO SERV-EMAIL-USUNET-W
002235        END-IF
002236        IF SW-VAR = 8
002237           MOVE TABLA-W TO PUERTO-EMAIL-USUNET-W           
002238        END-IF
002239        IF SW-VAR = 9
002240           MOVE TABLA-W TO SSL-EMAIL-USUNET-W           
002241        END-IF
002242        IF SW-VAR = 10
002243           MOVE TABLA-W TO IP-DATOS-USUNET-W           
002244        END-IF
002245        IF SW-VAR = 11
002246           MOVE TABLA-W TO IP-DESCARGA-USUNET-W           
002247        END-IF
002251        IF SW-VAR = 12
002252           MOVE TABLA-W TO DIRECTORIO-USUNET-W
002253        END-IF
002251        IF SW-VAR = 13
002252           MOVE TABLA-W TO SUC-USUNET-W
002253        END-IF
002254        INITIALIZE TABLA-W
002255     END-IF.
002256          
002257     IF CAMPO-W(J) IS NOT EQUAL TO SPACES
002258        MOVE CAMPO-W(J) TO  CM-W(K)
002259        ADD 1 TO K
002260     END-IF.
002370
