004820*=================================================================
004830* GUARDA APERTURA DE HISTORIA CLINIA (NOTAS DE ENFERMERIA)
004840*=================================================================
004850 IDENTIFICATION DIVISION.
004860 PROGRAM-ID. "HttpExtensionProc".
004870 ENVIRONMENT DIVISION.
004880 CONFIGURATION SECTION.
004890 INPUT-OUTPUT SECTION.
004900 FILE-CONTROL.
004910     COPY "P:\PROG\PROYECT\FUENTES\FS-USUNET.CBL".
004920     COPY "P:\PROG\PROYECT\FUENTES\FS-SESION.CBL".

           SELECT ARCHIVO-USUARIOS
                  ASSIGN NOM-USUAR-W
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC;
                  RECORD KEY IS NOMBRE-USU 
                  ALTERNATE RECORD KEY IS		
                  CLAVE-USU WITH DUPLICATES
                  ALTERNATE RECORD KEY IS
                  CTL-USU WITH DUPLICATES
                  ALTERNATE RECORD KEY IS
                  CLAVE-2-USU WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.


           SELECT HISTORIA-CLINICA LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-HCAPE-W
                  ORGANIZATION INDEXED;
                  ACCESS MODE DYNAMIC;
                  RECORD KEY IS LLAVE-HC
                  ALTERNATE RECORD KEY IS FOLIO-HC WITH DUPLICATES
                  ALTERNATE RECORD KEY IS FECHA-HC WITH DUPLICATES
                  ALTERNATE RECORD KEY IS MED-HC WITH DUPLICATES
                  ALTERNATE RECORD KEY IS ESTADO-HC WITH DUPLICATES
                  FILE STATUS OTR-STAT.

           SELECT ARCHIVO-PACIENTES
                  ASSIGN  NOM-PACIE-W
                  ORGANIZATION IS INDEXED;
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS COD-PACI
                  ALTERNATE RECORD KEY  
                  DESCRIP-PACI WITH DUPLICATES
                  ALTERNATE RECORD KEY  
                  EPS-PACI  WITH DUPLICATES
                  ALTERNATE RECORD KEY  
                  ID-COTIZ-PACI WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.


           SELECT HISTORIA-DETALLADA LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-HCDET-W
                  ORGANIZATION INDEXED;
                  ACCESS MODE DYNAMIC;
                  RECORD KEY IS LLAVE-DETHC
                  ALTERNATE RECORD KEY IS LLAVE-FOLIO-DETHC
                  WITH DUPLICATES
                  FILE STATUS OTR-STAT.


           SELECT EVOLUCION-HISTORIA
                  ASSIGN NOM-HCEVO-W LOCK MODE IS AUTOMATIC
                  ORGANIZATION INDEXED;
                  ACCESS MODE DYNAMIC;
                  RECORD KEY IS LLAVE-EVO
                  ALTERNATE RECORD KEY IS FOLIO-EVO WITH DUPLICATES
                  ALTERNATE RECORD KEY IS FECHA-EVO WITH DUPLICATES
                  ALTERNATE RECORD KEY IS MED-EVO WITH DUPLICATES
                  FILE STATUS OTR-STAT.


           SELECT ARCHIVO-PLANO
                  ASSIGN NOM-PLANO-W
                  ORGANIZATION IS LINE SEQUENTIAL
                  FILE STATUS IS OTR-STAT.

005080 DATA DIVISION.
005090 FILE SECTION.
       COPY "P:\PROG\PROYECT\FUENTES\FD-USUNET.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-SESION.CBL".
       COPY "S:\NEWCOBOL\FUENTES\FD-USUAR.CBL".
       COPY "S:\NEWCOBOL\FUENTES\FD-HCAPER17.CBL".
       COPY "S:\NEWCOBOL\FUENTES\FD-PACIE.CBL".
       COPY "S:\NEWCOBOL\FUENTES\FD-HCDETAL17.CBL".
       COPY "S:\NEWCOBOL\FUENTES\FD-HCEVO17.CBL".
       

       FD  ARCHIVO-PLANO
           LABEL RECORD STANDARD.
       01  REG-PLANO.
           02 DATOS-PLANO     PIC X(21000).

005190 WORKING-STORAGE SECTION.
005200 COPY "P:\PROG\PROYECT\FUENTES\COBW3.CBL".
005210 COPY "P:\PROG\PROYECT\FUENTES\WEB-CARAC.CBL".
005210 COPY "P:\PROG\PROYECT\FUENTES\WS-9005.CBL".
005210 COPY "P:\PROG\PROYECT\FUENTES\WS-9006.CBL".
005220 COPY "P:\PROG\PROYECT\FUENTES\WS-9009.CBL".

       77 NOM-USUAR-W                PIC X(70).
       77 NOM-HCAPE-W                PIC X(70).
       77 NOM-PACIE-W                PIC X(70).
       77 NOM-PLANO-W                PIC X(90).
       77 NOM-HCDET-W                PIC X(70).
       77 NOM-HCEVO-W                PIC X(70).
       77 CONT                       PIC 99.
       77 OPER-W                     PIC X(4).
       77 SUCURSAL-W                 PIC X.
       77 SW-PYP                     PIC 999.
       77 SW-BLANCA                  PIC 999.
       77 SW-OPEN                    PIC 9.

       01 ID-EDIT.
          02 ID1-EDIT                PIC X(14).
          02 ID2-EDIT                PIC X.


       01 ULT-FECHA-NUM.
          02 ULT-ANO-NUM             PIC 99.
          02 ULT-MES-NUM             PIC 99.
          02 ULT-DIA-NUM             PIC 99.


       01 FECHA-ACT.
          02 ANO-ACT        PIC 99.
          02 ANO2-ACT       PIC 99.
          02 MES-ACT        PIC 99.
          02 DIA-ACT        PIC 99.


       01 FOLIO-ANT.
          02 FOLIO-SUC-ANT           PIC XX.
          02 FOLIO-NRO-ANT           PIC 9(6).

       01 LINEA-LLEGAD-W             PIC X(200).

005270 01  DATO-LLEGADA-W.
           02 SESION-LLEGAD-W.
005280        03 ID-LLEGAD-W         PIC X(15).
              03 FECHA-LLEGAD-W      PIC X(8).
              03 HORA-LLEGAD-W       PIC X(6).
           02 DIRECTORIO-W           PIC X(30).
           02 MES-TRABAJO-W          PIC X(10).
           02 LLAVE-PACI-W           PIC X(15).


       01 DATOS-ENVIO.
          02 DAT0-ENV                PIC XX.
          02 FILLER                  PIC X VALUE "|".
          02 LLAVE-ENV               PIC X(23).


       01 EDAD-DIAS-W                PIC X(7).
       01 EDAD-DIAS-EDIT             PIC -ZZZZZZ.


       01 PESO-W.
          02 PESO1-W                 PIC 9(5).
          02 PESO2-W                 PIC 9.

       01 IMC-CORP-W.
          02 IMC-CORP1-W             PIC 99.
          02 IMC-CORP2-W             PIC 99.

       01 SUP-CORP-W.
          02 SUP-CORP1-W             PIC 99.
          02 SUP-CORP2-W             PIC 99.

       01 TEMP-W.
          02 TEMP1-W                 PIC 99.
          02 TEMP2-W                 PIC 99.

       01 PER-CEF-W.
          02 PER-CEF1-W              PIC 9(3).
          02 PER-CEF2-W              PIC 9.

       01 PESO-ANT1-W.
          02 PESO-ANT1-W1            PIC 9(5).
          02 PESO-ANT1-W2            PIC 9.

       01 PESO-ANT2-W.
          02 PESO-ANT2-W1            PIC 9(5).
          02 PESO-ANT2-W2            PIC 9.

       01 PER-ABDO-W.
          02 PER-ABDO1-W             PIC 9(3).
          02 PER-ABDO2-W             PIC 9.

       01 ALT-UTER-W.
          02 ALT-UTER1-W             PIC 99.
          02 ALT-UTERW-W             PIC 9.

       01 PESO-PREV-W.
          02 PESO-PREV1-W            PIC 9(3).
          02 PESO-PREV3-W            PIC 9.

       01 CREATININA-W.
          02 CREATININA1-W           PIC 9.
          02 CREATININA2-W           PIC 9.

       01 PER-TORA-W.
          02 PER-TORA1-W             PIC 9(3).
          02 PER-TORA2-W             PIC 9.

       01 PER-MUNE-W.
          02 PER-MUNE1-W             PIC 99.
          02 PER-MUNE2-W             PIC 9.

       01 PER-BRAQ-W.
          02 PER-BRAQ1-W             PIC 99.
          02 PER-BRAQ2-W             PIC 9.

       01 HEMO-GLICOSILADA-W.
          02 HEMO-GLICOSILADA1-W     PIC 99.
          02 HEMO-GLICOSILADA2-W     PIC 99.

       01 MICROALBUMINURIA-W.
          02 MICROALBUMINURIA1-W     PIC 99.
          02 MICROALBUMINURIA2-W     PIC 99.

       01 DIAGN-W                    PIC X(60).

       01 REG-DETHC-W.
          02 LLAVE-DETHC-W.
             05 LLAVE-HC-DETHC-W.
                07 ID-DETHC-W             PIC X(15).
                07 LLAVE-FOLIO-DETHC-W.
                   09 SUCURSAL-DETHC-W    PIC XX.
                   09 FOLIO-DETHC-W       PIC 9(6).
             05 COD-DETHC-W.
                07 GRUPO-DETHC-W           PIC 99.
                07 CONCEP-DETHC-W          PIC 99.
          02 DATOS-DETHC-W.
             05 DETALLE-DETHC-W.
                07 RENG-DETHC-W OCCURS 200.
                   09 DATO1-DETHC-W        PIC X(22).
                   09 DATO2-DETHC-W        PIC X(73).
             05 FILLER                     PIC X(2000).


       01 LINEA-FORMU-W.
          02 LINEA1-FORMU-W                PIC X(100).
          02 LINEA2-FORMU-W                PIC X(200).


       01 CANT-FORMU-W.
          02 CANT-FORMU-ENT-W          PIC 9(4).
          02 CANT-FORMU-DEC-W          PIC 9.


       01 CANT-DOSIF-FORMU-W.
          02 CANT-ENT-W                 PIC 9(8).
          02 CANT-DEC-W                 PIC 99.


006310 LINKAGE SECTION.
006320 COPY "P:\PROG\PROYECT\FUENTES\ISAPICTX.CBL".
006330 PROCEDURE DIVISION WITH stdcall LINKAGE USING ISAPI-CTX-CNT.
006340
006350 DECLARATIVES.
006360 I-O-TEST SECTION.
006370     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUNET.         
006380 ESCR-EXCEPTIONES.
006390     IF OTR-STAT = "00"
006400        CONTINUE 
006410     ELSE
006420        MOVE OTR-STAT         TO MSJ1-HTML
006430        MOVE NOM-USU-W        TO MSJ2-HTML
006440        MOVE "HC811"          TO MSJ3-HTML
006450        GO TO ENVIAR2-ERROR
006460     END-IF.
006470
006480 I-O-TEST SECTION.
006490     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SESION.
006500 ESCR-EXCEPTIONES.
006510     IF OTR-STAT = "00" 
006520        CONTINUE 
006530     ELSE
006540        MOVE OTR-STAT         TO MSJ1-HTML
006550        MOVE NOM-SESION-W     TO MSJ2-HTML
006560        MOVE "HC811"          TO MSJ3-HTML
006570        GO TO ENVIAR2-ERROR
006580     END-IF.
006590  

006480 I-O-TEST SECTION.
006490     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUARIOS.
006500 ESCR-EXCEPTIONES.
006510     IF OTR-STAT = "00" 
006520        CONTINUE 
006530     ELSE
006540        MOVE OTR-STAT         TO MSJ1-HTML
006550        MOVE NOM-USUAR-W      TO MSJ2-HTML
006560        MOVE "HC811"          TO MSJ3-HTML
006570        GO TO ENVIAR2-ERROR
006580     END-IF.
006590  

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON HISTORIA-CLINICA.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-HCAPE-W      TO MSJ2-HTML
006680        MOVE "HC811"          TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR  
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-PACIENTES.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-PACIE-W      TO MSJ2-HTML
006680        MOVE "HC811"          TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON HISTORIA-DETALLADA.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-HCDET-W      TO MSJ2-HTML
006680        MOVE "HC811"          TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR  
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON EVOLUCION-HISTORIA.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MENSAJE1-HTML
006670        MOVE NOM-HCEVO-W      TO MENSAJE2-HTML
006680        MOVE "HC003_2"        TO MENSAJE3-HTML
006690        GO TO ENVIAR-ERROR
006700     END-IF.


       I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-PLANO.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" OR "35"
006640        CONTINUE                                                                                      
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-PLANO-W      TO MSJ2-HTML
006680        MOVE "HC002"          TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.
006710
006720  END DECLARATIVES.
006730
006740 INICIAR-IIS.
006750     MOVE LOW-VALUE TO COBW3.
006760     MOVE FUNCTION ADDR(ISAPI-CTX-CNT) TO COBW3-CONTEXT.
006770     CALL "COBW3_INIT" USING COBW3.
006780
006790 LEER-DATO-HTML.
006800     MOVE "datosh" TO COBW3-SEARCH-DATA.
006810     CALL "COBW3_GET_VALUE" USING COBW3.
006820     MOVE COBW3-GET-DATA    TO LINEA-LLEGAD-W.


           UNSTRING LINEA-LLEGAD-W DELIMITED BY "|"
              INTO SESION-LLEGAD-W, LLAVE-PACI-W, ADMIN-W
           END-UNSTRING.

           MOVE LLAVE-PACI-W       TO ID-EDIT
001855     MOVE SESION-LLEGAD-W    TO LLAVE-SESION-W.
           MOVE FUNCTION CURRENT-DATE TO FECHA-TOTAL.

000797 INICIAR-SESION.
000806     MOVE "D:\WEB\HC-NTAS-EVOL\DATOS\SC-SESION.DAT" TO NOM-SESION-W
000820     MOVE FUNCTION CURRENT-DATE TO FECHA-TOTAL.
000830     ACCEPT HORA-TOTAL FROM TIME.
000810     GO TO VALIDAR-SESION.
000850
000860 FIN-VALIDAR-SESION.
006840
006900 ABRIR-USUARIO.
006910     INITIALIZE OTR-STAT.
006920     MOVE "D:\WEB\HC-NTAS-EVOL\DATOS\SC-ARCHUSU.DAT" TO NOM-USU-W
006930
006940     OPEN INPUT ARCHIVO-USUNET
006950     EVALUATE OTR-STAT
006960       WHEN "00"  CONTINUE
006970       WHEN "35"  OPEN OUTPUT ARCHIVO-USUNET
006980                  INITIALIZE REG-USUNET
006990                  WRITE REG-USUNET
007000                  CLOSE ARCHIVO-USUNET
007010                  MOVE "Validacion de Usuario"       TO MSJ1-HTML
007020                  MOVE "Falta configurar usuarios"   TO MSJ2-HTML
007030                  MOVE "Sc"                          TO MSJ3-HTML
007040                  GO TO ENVIAR2-ERROR
007050       WHEN OTHER GO TO CERRAR-SESION
007060     END-EVALUATE.
007070
007080     INITIALIZE LLAVE-USUNET.
007100
007110 LEER-USUARIO.
007120     READ ARCHIVO-USUNET NEXT AT END MOVE 0 TO SW-FIN.
007130
007140     CLOSE ARCHIVO-USUNET.
007200     
007210     IF NOMBRE-USUNET = SPACES
007220     OR NIT-USUNET = ZEROS
007230        MOVE "Validacion de Sesion"        TO MSJ1-HTML
007240        MOVE "Falta configurar usuarios"   TO MSJ2-HTML
007250        MOVE "Sc"                          TO MSJ3-HTML
007260        GO TO ENVIAR2-ERROR
007270     END-IF.
007280 
007350
       ASIGNAR-NOMBRES.
           MOVE FUNCTION CURRENT-DATE TO FECHA-ACT
           INITIALIZE NOM-USUAR-W NOM-PLANO-W
           INSPECT IP-DATOS-USUNET REPLACING FIRST "/" BY "\"
           MOVE "\\" TO NOM-USUAR-W NOM-HCAPE-W

           INSPECT NOM-USUAR-W REPLACING FIRST "                    "
                                            BY IP-DATOS-USUNET

           INSPECT NOM-USUAR-W REPLACING FIRST " "
                                            BY "\"

           INSPECT NOM-USUAR-W REPLACING FIRST "                              "
                                            BY DIRECTORIO-USUNET

           MOVE NOM-USUAR-W TO NOM-PACIE-W 

           INSPECT NOM-USUAR-W REPLACING FIRST  "                "
                                            BY  "\CONTROL\ARCHUSU".

           INSPECT NOM-PACIE-W REPLACING FIRST  "                     "
                                           BY   "\CONTROL\SC-PACIE.DAT".



           INSPECT NOM-HCAPE-W  REPLACING FIRST "                    "
                                             BY IP-DATOS-USUNET

           INSPECT NOM-HCAPE-W REPLACING FIRST " "
                                            BY "\"

           INSPECT NOM-HCAPE-W REPLACING FIRST "                               "
                                            BY "NEWCOBOL\HC\DATOS\SC-HCAPER.S17".


           MOVE NOM-HCAPE-W  TO NOM-HCDET-W NOM-HCEVO-W

           INSPECT NOM-HCDET-W  REPLACING FIRST "SC-HCAPER.S17  "
                                             BY "SC-HCDETA-X.S17"

           INSPECT NOM-HCDET-W REPLACING FIRST "X" BY ID2-EDIT.

          
           INSPECT NOM-HCEVO-W REPLACING FIRST "SC-HCAPER.S17 "
                                            BY "SC-HCEVOX1.S17"

           INSPECT NOM-HCEVO-W REPLACING FIRST "X1"
                                            BY ANO2-ACT.




       LEER-USUARIO.

           OPEN INPUT ARCHIVO-USUARIOS
           READ ARCHIVO-USUARIOS NEXT WITH NO LOCK AT END 
                CLOSE ARCHIVO-USUARIOS
           END-READ.

       LEER-PACIENTE.
           OPEN INPUT ARCHIVO-PACIENTES.
           MOVE LLAVE-PACI-W    TO  COD-PACI
           READ ARCHIVO-PACIENTES WITH NO LOCK
                INVALID KEY
                        MOVE "99"         TO MSJ1-HTML
                        MOVE "Paciente no existe" To MSJ2-HTML
                        MOVE "HC-CONSULT-PACIE"   TO MSJ3-HTML
                        GO TO ENVIAR2-ERROR
           END-READ.

           CLOSE ARCHIVO-PACIENTES.


       BUSCAR-HISTORIA.
           OPEN INPUT HISTORIA-CLINICA.

           INITIALIZE SW-OPEN SW-BLANCA FOLIO-ANT EDAD-DIAS-W
           MOVE COD-PACI      TO LLAVE-HC
           START HISTORIA-CLINICA  KEY >= ID-HC
                 INVALID KEY
                        GO TO HISTORIA-NUEVA
           END-START.


       LEER-HISTORIA.
           READ HISTORIA-CLINICA NEXT WITH NO LOCK AT END GO TO VERIFICAR-HISTORIA.

           IF COD-PACI = ID-HC
              CONTINUE
           ELSE 
              GO TO VERIFICAR-HISTORIA
           END-IF

           IF ESTADO-HC = 1
              MOVE 1 TO SW-OPEN
              GO TO VERIFICAR-HISTORIA
           END-IF

           IF FOLIO-SUC-HC = "11"
              MOVE FOLIO-HC    TO FOLIO-ANT
           END-IF

           GO TO LEER-HISTORIA.

       VERIFICAR-HISTORIA.
           CLOSE HISTORIA-CLINICA.
           IF SW-OPEN  = ZERO
              CONTINUE
           ELSE
              MOVE "99"         TO MSJ1-HTML
              MOVE "Ya existe historia clinica!"  TO MSJ2-HTML
              MOVE "HC-NTAS003" TO MSJ3-HTML
              GO TO ENVIAR2-ERROR
           END-IF.

       HISTORIA-NUEVA.
           INITIALIZE REG-HC
           IF FOLIO-NRO-ANT = ZEROS AND FOLIO-SUC-ANT = SPACES
              MOVE "11000001"   TO FOLIO-ANT
           ELSE
              MOVE "11" TO FOLIO-SUC-ANT
              ADD 1     TO FOLIO-NRO-ANT
           END-IF

           OPEN I-O HISTORIA-CLINICA
           MOVE COD-PACI    TO ID-HC
           MOVE FOLIO-ANT   TO FOLIO-HC

           READ HISTORIA-CLINICA WITH NO LOCK
                INVALID KEY 
                        CONTINUE
                NOT INVALID KEY
                        MOVE "99"        TO MSJ1-HTML
                        MOVE "Ya existe historia clinica" TO MSJ2-HTML
                        MOVE "HC-NTAS003" TO MSJ3-HTML
                        GO TO ENVIAR2-ERROR
           END-READ.


       ABRIR-PLANO-HISTORIA. 

           MOVE "C:\PROSOFT\TEMP\HCAPER-XXXXXXXXXXXXXXXXXXXXXXXXXXXXX.TXT"  TO NOM-PLANO-W

           INSPECT NOM-PLANO-W REPLACING FIRST "XXXXXXXXXXXXXXXXXXXXXXXXXXXXX" BY SESION-LLEGAD-W.


           OPEN INPUT ARCHIVO-PLANO.

       LEER-PLANO-HISTORIA.
           READ ARCHIVO-PLANO NEXT WITH NO LOCK AT END GO TO GRABAR-HISTORIA.


           UNSTRING DATOS-PLANO DELIMITED BY "|"
              INTO ID-HC, FECHA-HC, HORA-HC, SERV-HC, OPER-ELAB-HC, MED-HC, ESQUEMA-HC, UNID-EDAD-HC, VLR-EDAD-HC, EDAD-DIAS-HC, ETNIA-HC, ETNIA-IND-HC, NIV-ESTUD-HC, ACOMPA-HC,
                   ID-ACOMPA-HC, EMBRIAGUEZ-TRANS-HC, PLANIFIC-HC, PROCEDEN-HC, MOTIV-HC, UND-PESO-HC, PESO-W, TALLA-HC, IMC-CORP-W, SUP-CORP-W, TEMP-W, FCARD-HC, FRESP-HC, TENS1-HC,
                   TENS2-HC, TENS-MEDIA-HC, OXIMETRIA-HC, PVC-HC, GLASG-HC, PER-CEF-W, SINTOM-RESPI-HC, PER-ABDO-W, ALT-UTER-W, EST-NUTRI-HC, PESO-PREV-W, CREATININA-W, PER-TORA-W, 
                   PER-MUNE-W, SINTOM-PIEL-HC, VICTI-MALTRATO-HC, VICTI-VIOLENCIA-HC, ENFER-MENTAL-HC, ENFER-ITS-HC, CANCER-SENO-HC, CANCER-CERVIS-HC, PER-BRAQ-W, 
                   HEMO-GLICOSILADA-HC, HEMO-GLICO-FECHA-HC, FECHA-MICROALBUMINURIA-HC, RIESGO-CARDIO-HC, MICROALBUMINURIA-W, CREATININA2-HC, EDU-AUTOEXA-SENO-HC, RELA-ALBUMI-CREATININA-HC,
                   ERC-HC, FECHA-DX-ERC-HC, TRATA-ITS-HC, CUAL-ITS-HC, CITOLOGIA-PREVIA-HC, FECHA-CITO-PREVIA-HC, RESUL-CITO-PREVIA-HC, SEXO-SIN-PROTECCION-HC, PRUEBA-VIH-SIFILIS-HC, RESULTADO-VIH-SIFILIS-HC,
                   REQUIERE-MAMOGRAFIA-HC, ATIENDE-HC, TRIAGE-HC, CAUSA-HC, FINALID-HC, EMBARAZO-HC, ESTADO-SAL-HC, REMITIDO-HC, NIVEL-REMIT-HC, OBSERV-HC,
                   CRONICO-HC, 1RA-VEZ-HC, NRO-CONTR-HC, TIPO-DIAG-HC, DIAGN-W, FECHA-1RA-VEZ-HC, CLASE-HC, ESTADO-HC, TEMPORAL-HC, NIT-FACT-HC, EPS-HC, UNSERV-HC, EGRESO-HC, HORA-EGRES-HC, DIAG-MUER-HC,
                   AGUD-VISUAL-OI-1-HC, AGUD-VISUAL-OI-2-HC, AGUD-VISUAL-OD-1-HC, AGUD-VISUAL-OD-2-HC, ESTRUCTURAS-OCULARES-OI-HC, ESTRUCTURAS-OCULARES-OD-HC
           END-UNSTRING.

           MOVE EDAD-DIAS-W   TO EDAD-DIAS-EDIT
           MOVE EDAD-DIAS-EDIT TO EDAD-DIAS-HC


           MOVE PESO-W        TO PESO-HC
           MOVE IMC-CORP-W    TO IMC-CORP-HC
           MOVE SUP-CORP-W    TO SUP-CORP-HC
           MOVE TEMP-W        TO TEMP-HC
           MOVE PER-CEF-W     TO PER-CEF-HC
           MOVE PER-ABDO-W    TO PER-ABDO-HC
           MOVE ALT-UTER-W    TO ALT-UTER-HC
           MOVE PESO-PREV-W   TO PESO-PREV-HC
           MOVE CREATININA-W  TO CREATININA-HC
           MOVE PER-TORA-W    TO PER-TORA-HC
           MOVE PER-MUNE-W    TO PER-MUNE-HC
           MOVE PER-BRAQ-W    TO PER-BRAQ-HC
           MOVE HEMO-GLICOSILADA-W TO HEMO-GLICOSILADA-HC
           MOVE MICROALBUMINURIA-W TO MICROALBUMINURIA2-HC


           UNSTRING DIAGN-W DELIMITED BY ","
                    INTO COD-DIAGN-HC (1), COD-DIAGN-HC (2), COD-DIAGN-HC (3), COD-DIAGN-HC (4), COD-DIAGN-HC (5), COD-DIAGN-HC (6), COD-DIAGN-HC (7), COD-DIAGN-HC (8), COD-DIAGN-HC (9), COD-DIAGN-HC (10)
           END-UNSTRING.


       GRABAR-HISTORIA.
           WRITE REG-HC END-WRITE

           CLOSE HISTORIA-CLINICA
                 ARCHIVO-PLANO.


       ABRIR-PLANO-HCDETAL.

           MOVE "C:\PROSOFT\TEMP\HCDETAL-XXXXXXXXXXXXXXXXXXXXXXXXXXXXX.TXT"  TO NOM-PLANO-W

           INSPECT NOM-PLANO-W REPLACING FIRST "XXXXXXXXXXXXXXXXXXXXXXXXXXXXX" BY SESION-LLEGAD-W.


           OPEN INPUT ARCHIVO-PLANO.

       LEER-PLANO-HCDETAL.
           READ ARCHIVO-PLANO NEXT WITH NO LOCK AT END GO TO CERRAR-PLANO-HCDETAL.
           INITIALIZE REG-DETHC-W

           UNSTRING DATOS-PLANO DELIMITED BY "|"
                    INTO ID-DETHC-W, COD-DETHC-W, DETALLE-DETHC-W
           END-UNSTRING.

           IF COD-DETHC-W = 9005
              PERFORM LLENAR-ESCALA-BARTHEL
           END-IF

           IF COD-DETHC-W = 9006
              PERFORM LLENAR-ESCALA-KARNOFSKY
           END-IF

           IF COD-DETHC-W = 9009
              PERFORM LLENAR-TEST-FINDRISK
           END-IF.



       GRABAR-DETALLE.
           OPEN I-O HISTORIA-DETALLADA.

           MOVE FOLIO-HC       TO LLAVE-FOLIO-DETHC-W
           MOVE LLAVE-DETHC-W  TO LLAVE-DETHC

           READ HISTORIA-DETALLADA WITH NO LOCK 
                INVALID KEY 
                        MOVE DETALLE-DETHC-W    TO DETALLE-DETHC
                        WRITE REG-DETHC END-WRITE
           END-READ.

           CLOSE HISTORIA-DETALLADA


           GO TO LEER-PLANO-HCDETAL.

       CERRAR-PLANO-HCDETAL.
           CLOSE ARCHIVO-PLANO.


       ABRIR-PLANO-FORMULACION.

           MOVE "C:\PROSOFT\TEMP\HCDETAL-XXXXXXXXXXXXXXXXXXXXXXXXXXXXX.TXT"  TO NOM-PLANO-W

           INSPECT NOM-PLANO-W REPLACING FIRST "XXXXXXXXXXXXXXXXXXXXXXXXXXXXX" BY SESION-LLEGAD-W.

           INITIALIZE CONT.
           OPEN INPUT ARCHIVO-PLANO.

       LEER-PLANO-FORMULACION.
           READ ARCHIVO-PLANO NEXT WITH NO LOCK AT END GO TO CERRAR-PLANO-FORMULACION.


           ADD 1 TO CONT

           UNSTRING DATOS-PLANO DELIMITED BY "$;"
                    INTO LINEA1-FORMU-W, LINEA2-FORMU-W
           END-UNSTRING

           UNSTRING LINEA1-FORMU-W DELIMITED BY "|"
                    INTO FECHA-EVO, HORA-EVO, OPER-ELAB-EVO, TIPO-FORMU (CONT), COD-FORMU (CONT), CANT-FORMU-W 
           END-UNSTRING

           MOVE CANT-FORMU-W     TO CANT-FORMU (CONT)

           IF TIPO-FORMU  (CONT) = 1 AND (GRUPO-FORMU (CONT) = "PO" OR "NP")
              UNSTRING LINEA2-FORMU-W DELIMITED BY "|"
                       INTO ORDEN-DOSIS-FORMU (CONT), CANT-DOSIS-FORMU (CONT), UNID-DOSIS-FORMU (CONT), INMED-FORMU (CONT), CADA-DOSIS-FORMU (CONT), CANT-FREC-FORMU (CONT), UNID-FREC-FORMU (CONT),
                            VIA-DOSIS-FORMU (CONT), DIAS-TRAT-FORMU (CONT), ESPEC-FORMU (CONT), INDIC2-1-FORMU (CONT), CANT-DOSIF-FORMU-W, TIPO-DOSIF-FORMU (CONT), CANT-FREC-DOSIF-FORMU (CONT), 
                            FREC-DOSIF-FORMU (CONT), VIA-FORMU (CONT), NRO-ORD-FORMU (CONT)
              END-UNSTRING

              MOVE CANT-DOSIF-FORMU-W      TO CANT-DOSIF-FORMU (CONT)

           ELSE 
              UNSTRING LINEA2-FORMU-W DELIMITED BY "|"
                       INTO INDIC-FORMU (CONT), CANT-DOSIF-FORMU (CONT), TIPO-DOSIF-FORMU (CONT), CANT-FREC-DOSIF-FORMU (CONT), FREC-DOSIF-FORMU (CONT), VIA-FORMU (CONT), NRO-ORD-FORMU (CONT)
              END-UNSTRING
           END-IF

           GO TO LEER-PLANO-FORMULACION.

       CERRAR-PLANO-FORMULACION.
           CLOSE ARCHIVO-PLANO.

           OPEN I-O EVOLUCION-HISTORIA.

       ABRIR-EVOLUCION.
           MOVE LLAVE-HC    TO LLAVE-FECHA-EVO
          
           READ EVOLUCION-HISTORIA WITH NO LOCK
                INVALID KEY 
                        MOVE 1   TO TIPO-EVO
                        WRITE REG-EVO END-WRITE
           END-READ.

           CLOSE EVOLUCION-HISTORIA.

           MOVE 00                 TO DAT0-ENV
           MOVE LLAVE-HC           TO LLAVE-ENV.

010700 PAGINA-CONFIG.

010720     MOVE "datosrecibidos"  TO COBW3-CNV-NAME
010730     MOVE DATOS-ENVIO       TO COBW3-CNV-VALUE
010740     CALL "COBW3_SET_CNV"   USING COBW3
010750
010760     MOVE "..\PAGINAS\RECIBIDOS.ASPX" TO SALIDA-HTML  
010770     PERFORM ABRIR-HTML.
007980   
007990 CERRAR-SESION.
008000     CALL "COBW3_FREE" USING COBW3.
008010     MOVE 1 TO PROGRAM-STATUS.
008020     EXIT PROGRAM.

       LLENAR-ESCALA-BARTHEL.
           INITIALIZE DATO-9005.
           UNSTRING DETALLE-DETHC-W DELIMITED BY "$"
                    INTO VALORACION-9005, REVALORACION-9005, COMER-9005, LAVARSE-9005, VESTIRSE-9005, ARREGLARSE-9005, DEPOSICION-9005, MICCION-9005, 
                         BANO-9005, TRASLADARSE-9005, DEAMBULACION-9005, ESCALERAS-9005, NIVEL-SECUELAS-9005, TABLA-ACTIVIDADES-9005, DEPEN-FUNCIONAL-9005

           END-UNSTRING.

           MOVE DATO-9005    TO DETALLE-DETHC-W.

       LLENAR-ESCALA-KARNOFSKY.
           INITIALIZE DATO-9006.

           UNSTRING DETALLE-DETHC-W DELIMITED BY "$"
                    INTO VALORACION-9006, REVALORACION-9006, CATEGORIA-9006, ACTIVIDAD-NORMAL-9006, INCAPAZ-TRABAJAR-9006, INCAPAZ-CUIDARSE-9006
           END-UNSTRING.

           MOVE DATO-9006    TO DETALLE-DETHC-W.


       LLENAR-TEST-FINDRISK.
           INITIALIZE DATO-9009.

           UNSTRING DETALLE-DETHC-W DELIMITED BY "$"
                    INTO CLASIF-HERI-9009, DIMENSION-HERI-9009, PROFUN-TEJID-9009, COMORBILIDAD-9009, ESTADIO-HERI-9009, INFECCION-9009, TIEMPO-EVOLU-9009, REGISTRO-FOTO-9009
           END-UNSTRING.

           MOVE DATO-9009    TO DETALLE-DETHC-W.


008040 COPY "P:\PROG\PROYECT\FUENTES\SC-WEB.CBL".
