000010*=================================================================
000020*GENERA LA SESION
000030*=================================================================
000040 IDENTIFICATION DIVISION.
000050 PROGRAM-ID. "HttpExtensionProc".
000060 ENVIRONMENT DIVISION.
000070 CONFIGURATION SECTION.
000080 INPUT-OUTPUT SECTION.
000090 FILE-CONTROL.
000100     COPY "P:\PROG\PROYECT\FUENTES\FS-SESION.CBL".
           COPY "P:\PROG\PROYECT\FUENTES\FS-USUNET.CBL".

           SELECT ARCHIVO-RESTRICCION LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-LOG-W
                  ORGANIZATION INDEXED;
                  ACCESS MODE DYNAMIC;
                  RECORD KEY LLAVE-REST
                  FILE STATUS OTR-STAT.


000380 DATA DIVISION.
000390 FILE SECTION.
000410     COPY "P:\PROG\PROYECT\FUENTES\FD-SESION.CBL". 
           COPY "P:\PROG\PROYECT\FUENTES\FD-USUNET.CBL".
           COPY "S:\NEWCOBOL\FUENTES\FD-RESTR.CBL".

000460
000540 WORKING-STORAGE SECTION.
000550 COPY "P:\PROG\PROYECT\FUENTES\COBW3.CBL".
000560 COPY "P:\PROG\PROYECT\FUENTES\WEB-CARAC.CBL".
000570 
       01  NOM-LOG-W                PIC X(60).

000580 01  DATO-LLEGADA-W.
000581     02 ID-LLEGAD-W           PIC X(4).
000582     02 FECHA-LLEGAD-W        PIC X(8).
000583     02 HORA-LLEGAD-W         PIC X(6).
 
       01 DATOS-ENVIO.
          02 DAT0-ENV               PIC XX.
          02 FILLER                 PIC X VALUE "|".
          02 DAT1-ENV               PIC X(29).

000590
001084 LINKAGE SECTION.
001085 COPY "P:\PROG\PROYECT\FUENTES\ISAPICTX.CBL".
001086 PROCEDURE DIVISION WITH stdcall LINKAGE USING ISAPI-CTX-CNT.
001087
001088 DECLARATIVES.
001430 I-O-TEST SECTION.
001440     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SESION.
001450 ESCR-EXCEPTIONES.
001460     IF OTR-STAT = "00" OR "35"
001470        CONTINUE 
001480     ELSE
001490        MOVE OTR-STAT         TO MSJ1-HTML
001500        MOVE NOM-SESION-W     TO MSJ2-HTML
001510        MOVE "HC-NTAS000"     TO MSJ3-HTML
001520        GO TO ENVIAR2-ERROR
001530     END-IF.

001430 I-O-TEST SECTION.
001440     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUNET.
001450 ESCR-EXCEPTIONES.
001460     IF OTR-STAT = "00" OR "35"
001470        CONTINUE 
001480     ELSE
001490        MOVE OTR-STAT         TO MSJ1-HTML
001500        MOVE NOM-USU-W        TO MSJ2-HTML
001510        MOVE "HC-NTAS000"     TO MSJ3-HTML
001520        GO TO ENVIAR2-ERROR
001530     END-IF.

001430 I-O-TEST SECTION.
001440     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-RESTRICCION.
001450 ESCR-EXCEPTIONES.
001460     IF OTR-STAT = "00" 
001470        CONTINUE 
001480     ELSE
001490        MOVE OTR-STAT         TO MSJ1-HTML
001500        MOVE NOM-LOG-W        TO MSJ2-HTML
001510        MOVE "HC-NTAS000"     TO MSJ3-HTML
001520        GO TO ENVIAR2-ERROR
001530     END-IF.
001540 END DECLARATIVES.
001800
001810 INICIAR-IIS.
001820     MOVE LOW-VALUE TO COBW3.
001830     MOVE FUNCTION ADDR(ISAPI-CTX-CNT) TO COBW3-CONTEXT.
001840     CALL "COBW3_INIT" USING COBW3.
001850
001851 LEER-DATO-HTML.
001852     MOVE "datosh" TO COBW3-SEARCH-DATA.
001853     CALL "COBW3_GET_VALUE" USING COBW3.
001854     MOVE COBW3-GET-DATA    TO DATO-LLEGADA-W.

001855     MOVE FECHA-LLEGAD-W    TO FECHA-TOTAL.
001856     MOVE HORA-LLEGAD-W     TO HORA-TOTAL.
001857
       ABRIR-USUARIO.
           MOVE "D:\WEB\HC-NTAS-EVOL\DATOS\SC-ARCHUSU.DAT" TO NOM-USU-W
006930
06940      OPEN INPUT ARCHIVO-USUNET.

           EVALUATE OTR-STAT
              WHEN "00" CONTINUE
              WHEN "35" OPEN OUTPUT ARCHIVO-USUNET
                        CLOSE ARCHIVO-USUNET
                        OPEN INPUT ARCHIVO-USUNET
           END-EVALUATE.

006950 LEER-USUARIO.
007120     READ ARCHIVO-USUNET NEXT AT END MOVE 0 TO SW-FIN.
007130
007140     CLOSE ARCHIVO-USUNET.
007200     
       INICIAR-RESTRICCION.
           MOVE "\\"  TO NOM-LOG-W
           INSPECT NOM-LOG-W   REPLACING FIRST "                    "
007390                                       BY IP-DATOS-USUNET

007400     INSPECT NOM-LOG-W   REPLACING FIRST " "
007410                                      BY "\"
007420     INSPECT NOM-LOG-W   REPLACING FIRST "                          "
007430                                      BY "NEWCOBOL\DATOS\ARCHREST.SC".
           INSPECT NOM-LOG-W   REPLACING ALL "/" BY "\".
           
           INITIALIZE LLAVE-REST
007440     MOVE ID-LLEGAD-W TO COD-REST

           IF ID-LLEGAD-W = "0099"
               INITIALIZE ID-REST
               MOVE ID-LLEGAD-W TO ID-REST 
           ELSE
               OPEN INPUT ARCHIVO-RESTRICCION
               READ ARCHIVO-RESTRICCION WITH NO LOCK
003                 INVALID KEY    CLOSE      ARCHIVO-RESTRICCION
003785                             MOVE "99"        TO MSJ1-HTML
007240                             MOVE "No existe el usuario"   TO MSJ2-HTML
007250                             MOVE "ARCHIVO-RESTRICCION"    TO MSJ3-HTML
007260                             GO TO ENVIAR2-ERROR
003790         END-READ
               CLOSE      ARCHIVO-RESTRICCION
           END-IF.


001870 INICIAR-SESION.
001871     INITIALIZE OTR-STAT.
001872     MOVE "D:\WEB\HC-NTAS-EVOL\DATOS\SC-SESION.DAT" TO NOM-SESION-W
001880
001890     OPEN I-O ARCHIVO-SESION.
001900
001910     EVALUATE OTR-STAT
001920       WHEN "00"  CONTINUE
001930       WHEN "35"  OPEN OUTPUT ARCHIVO-SESION
                        CLOSE       ARCHIVO-SESION
                        GO TO INICIAR-SESION
001960       WHEN OTHER GO TO CERRAR-SESION
001970     END-EVALUATE.

       VALIDAR-USUNET.

007210     IF NOMBRE-USUNET = SPACES
007220     OR NIT-USUNET = ZEROS
007230        MOVE "99"        TO MSJ1-HTML
007240        MOVE "Falta configurar usuarios"   TO MSJ2-HTML
007250        MOVE "Sc"                          TO MSJ3-HTML
007260        GO TO ENVIAR2-ERROR
007270     END-IF.
001980
001990 BORRAR-SESION-ANTERIOR.
002030     INITIALIZE LLAVE-SESION
002040     MOVE FECHA-TOTAL TO FECHA-SESION.
002050     START ARCHIVO-SESION KEY >= LLAVE-SESION
002060           INVALID KEY GO TO ASIGNAR-SESION
002070     END-START.
002107 
002108 LEER-SESION-ANTERIOR.
002109     READ ARCHIVO-SESION NEXT WITH NO LOCK AT END GO TO ASIGNAR-SESION.
002110
002111     IF FECHA-SESION < FECHA-TOTAL
002112        DELETE ARCHIVO-SESION
002113     END-IF.
002120
002121     IF (HR-SESION + 3) < HR-TOTAL
002122        DELETE ARCHIVO-SESION
002123     END-IF.
002124       
002126     GO TO LEER-SESION-ANTERIOR.
002127
002128 ASIGNAR-SESION.

           IF ID-LLEGAD-W = "0099"
              MOVE "000000000000099"   TO NIT-SESION
           ELSE
002129        MOVE ID-REST      TO NIT-SESION
           END-IF

002130     MOVE FECHA-TOTAL  TO FECHA-SESION
002131     MOVE HORA-TOTAL   TO HORA-SESION.
002132     INITIALIZE NOMBRE-SESION
002133 
002134     READ ARCHIVO-SESION  WITH NO LOCK
002135          INVALID KEY     MOVE IP-CLIENTE-W TO IP-SESION
002136                          WRITE REG-SESION  END-WRITE
002137          NOT INVALID KEY ADD 1 TO SG-TOTAL
002138                          GO TO ASIGNAR-SESION
002139     END-READ.

           MOVE "00"            TO DAT0-ENV
002141     MOVE LLAVE-SESION   TO DAT1-ENV
002143     CLOSE ARCHIVO-SESION.

002145 FIN-VALIDAR-SESION.
002146 
002147 ENVIO-DATOS.
           
004378     MOVE "datosrecibidos"  TO COBW3-CNV-NAME
004393     MOVE DATOS-ENVIO       TO COBW3-CNV-VALUE
004403     CALL "COBW3_SET_CNV"   USING COBW3

004413     MOVE "../PAGINAS/RECIBIDOS.ASPX"  TO SALIDA-HTML
004430     PERFORM ABRIR-HTML. 
004450   
004580 CERRAR-SESION.
004590     CALL "COBW3_FREE" USING COBW3.
004600     MOVE 1 TO PROGRAM-STATUS.
004610     EXIT PROGRAM.
004620
004630 COPY "P:\PROG\PROYECT\FUENTES\SC-WEB.CBL".
004790
