004820*=================================================================
004830*INICIAR LA PAGINA DE CONFIGURACION DE NOTAS  Y EVOLUCIONES
004840*=================================================================
004850 IDENTIFICATION DIVISION.
004860 PROGRAM-ID. "HttpExtensionProc".
004870 ENVIRONMENT DIVISION.
004880 CONFIGURATION SECTION.
004890 INPUT-OUTPUT SECTION.
004900 FILE-CONTROL.
004910     COPY "P:\PROG\PROYECT\FUENTES\FS-USUNET.CBL".
004920     COPY "P:\PROG\PROYECT\FUENTES\FS-SESION.CBL".
004930
004940
005030     SELECT ARCHIVO-JSON
005040            ASSIGN NOM-PLANO-W
005050            ORGANIZATION IS LINE SEQUENTIAL
005060            FILE STATUS IS OTR-STAT.
005070
005080 DATA DIVISION.
005090 FILE SECTION.
005100 COPY "P:\PROG\PROYECT\FUENTES\FD-USUNET.CBL".
005110 COPY "P:\PROG\PROYECT\FUENTES\FD-SESION.CBL".
005130
005140 FD  ARCHIVO-JSON
005150     LABEL RECORD STANDARD.
005160 01  REG-PLANO.
005170     02 DATOS-PLANO     PIC X(500).
005180
005190 WORKING-STORAGE SECTION.
005200 COPY "P:\PROG\PROYECT\FUENTES\COBW3.CBL".
005210 COPY "P:\PROG\PROYECT\FUENTES\WEB-CARAC.CBL".
005220 
005230 77  SW-VAR                    PIC 9.
005240 77  K                         PIC 99.
005250 77  NOM-PLANO-W               PIC X(60).
005260
005270 01  DATO-LLEGADA-W.
005280     02 CAMPO-W  OCCURS  50    PIC X.
005290
005300 01  TABLA-W.
005310     02 CM-W     OCCURS 30     PIC X.
005320
005330 01  DATO-W.
005340     02 ID-EDIT-W              PIC X(4).
005350     02 CLAVE-W                PIC X(6).
005360    
005370 01  FECHA-TMP.
005380     02 ANO-TMP                PIC 99.
005390     02 MES-TMP                PIC 99.
005400     02 DIA-TMP                PIC 99.
005410
005420 01  REG-USUNET-W.
005430     02 LLAVE-USUNET-W         PIC 9.
005440     02 NOMBRE-USUNET-W        PIC X(60).
005450     02 NIT-USUNET-W           PIC 9(10).
005460     02 DV-USUNET-W            PIC 9.
005470     02 DIRECC-USUNET-W.
005480        03 DIRECC1-USUNET-W    PIC X(30).
005490        03 DIRECC2-USUNET-W    PIC X(30).
005500     02 CLAVE-USUNET-W         PIC X(8).
005510     02 EMAIL-USUNET-W         PIC X(60).
005520     02 SERV-EMAIL-USUNET-W    PIC X(30).
005530     02 CLAVE-EMAIL-USUNET-W   PIC X(30).
005540     02 SSL-EMAIL-USUNET-W     PIC X.
005550     02 IP-DATOS-USUNET-W      PIC X(20).
005560     02 PUERTO-EMAIL-USUNET-W  PIC X(4).
005570     02 IP-DESCARGA-USUNET-W   PIC X(20).
005580     02 DIR-SITIO-USUNET-W     PIC X(10).
005590     02 GS128-PREDIAL-USUNET-W PIC X(13).
005600     02 GS128-INDUSTR-USUNET-W PIC X(13).
005610     02 SERV-SQL-USUNET-W      PIC X(20).
005620     02 DIRECTORIO-USUNET-W    PIC X(30).
005630     02 FILLER                 PIC X(1890).
005640
005650 01 COD-TMP.
005660    02 SW-ALFA                 PIC 9.
005670    02 TABLA-COD1.
005680       03 COD1-PAC             PIC X OCCURS 10.
005690    02 TABLA-COD2.
005700       03 COD2-PAC             PIC X OCCURS 10.
005710
005720 01 LINEA-EDIT.
005730    02 FILLER                  PIC X(6)   VALUE "{*PW*:".
005740    02 FILLER                  PIC X      VALUE "*". 
005790    02 CLAVE-L                 PIC X(6).
005800    02 FILLER                  PIC XX     VALUE "*,".
005810    02 FILLER                  PIC X(9)   VALUE "*NOMBRE*:".
005820    02 FILLER                  PIC X      VALUE "*".
005830    02 NOMBRE-L                PIC X(60).
005840    02 FILLER                  PIC XX     VALUE "*,".
005850    02 FILLER                  PIC X(6)   VALUE "*NIT*:".
005860    02 FILLER                  PIC X      VALUE "*".
005870    02 NIT-L                   PIC X(10).
005880    02 FILLER                  PIC XX     VALUE "*,".
005890    02 FILLER                  PIC X(6)   VALUE "*DIR*:".
005900    02 FILLER                  PIC X      VALUE "*".
005910    02 DIRECC1-L               PIC X(30).
005920    02 FILLER                  PIC XX     VALUE "*,".
005930    02 FILLER                  PIC X(7)   VALUE "*MAIL*:".
005940    02 FILLER                  PIC X      VALUE "*".
005950    02 EMAIL-L                 PIC X(60).
005960    02 FILLER                  PIC XX     VALUE "*,".
005970    02 FILLER                  PIC X(8)   VALUE "*CMAIL*:".
005980    02 FILLER                  PIC X      VALUE "*".
005990    02 CLAVE-EMAIL-L           PIC X(30).
006000    02 FILLER                  PIC XX     VALUE "*,".
006010    02 FILLER                  PIC X(8)   VALUE "*SMAIL*:".
006020    02 FILLER                  PIC X      VALUE "*".
006030    02 SERV-EMAIL-L            PIC X(30).
006040    02 FILLER                  PIC XX     VALUE "*,".
006050    02 FILLER                  PIC X(8)   VALUE "*PMAIL*:".
006060    02 FILLER                  PIC X      VALUE "*".
006070    02 PUERTO-EMAIL-L          PIC X(4).
006080    02 FILLER                  PIC XX     VALUE "*,".
006090    02 FILLER                  PIC X(6)   VALUE "*SSL*:".
006100    02 FILLER                  PIC X      VALUE "*".
006110    02 SSL-EMAIL-L             PIC X.
006120    02 FILLER                  PIC XX     VALUE "*,".
006130    02 FILLER                  PIC X(8)   VALUE "*DATOS*:".
006140    02 FILLER                  PIC X      VALUE "*".    
006150    02 IP-DATOS-L              PIC X(20).
006160    02 FILLER                  PIC XX     VALUE "*,".
006170    02 FILLER                  PIC X(8)   VALUE "*DESCA*:".
006180    02 FILLER                  PIC X      VALUE "*".    
006190    02 IP-DESCARGA-L           PIC X(20).
006200    02 FILLER                  PIC XX     VALUE "*,".
006210    02 FILLER                  PIC X(8)   VALUE "*SITIO*:".
006220    02 FILLER                  PIC X      VALUE "*".
006230    02 DIR-SITIO-L             PIC X(10).
006240    02 FILLER                  PIC XX     VALUE "*,".
006250    02 FILLER                  PIC X(13)  VALUE "*DIRECTORIO*:".
006260    02 FILLER                  PIC X      VALUE "*".
006270    02 DIRECTORIO-L            PIC X(30).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(6)   VALUE "*SUC*:".
006280    02 FILLER                  PIC X      VALUE "*".
          02 SUC-L                   PIC XX.
006290    02 FILLER                  PIC XX     VALUE "*}". 
006300
006310 LINKAGE SECTION.
006320 COPY "P:\PROG\PROYECT\FUENTES\ISAPICTX.CBL".
006330 PROCEDURE DIVISION WITH stdcall LINKAGE USING ISAPI-CTX-CNT.
006340
006350 DECLARATIVES.
006360 I-O-TEST SECTION.
006370     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUNET.         
006380 ESCR-EXCEPTIONES.
006390     IF OTR-STAT = "00" OR "35"
006400        CONTINUE 
006410     ELSE
006420        MOVE OTR-STAT         TO MSJ1-HTML
006430        MOVE NOM-USU-W        TO MSJ2-HTML
006440        MOVE "HC-NTAS001"     TO MSJ3-HTML
006450        GO TO ENVIAR2-ERROR
006460     END-IF.
006470
006480 I-O-TEST SECTION.
006490     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SESION.
006500 ESCR-EXCEPTIONES.
006510     IF OTR-STAT = "00" 
006520        CONTINUE 
006530     ELSE
006540        MOVE OTR-STAT         TO MSJ1-HTML
006550        MOVE NOM-SESION-W     TO MSJ2-HTML
006560        MOVE "HC-NTAS001"     TO MSJ3-HTML
006570        GO TO ENVIAR2-ERROR
006580     END-IF.
006590  
006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-JSON.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" OR "35"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-PLANO-W      TO MSJ2-HTML
006680        MOVE "HC-NTAS001"     TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.
006710
006720  END DECLARATIVES.
006730
006740 INICIAR-IIS.
006750     MOVE LOW-VALUE TO COBW3.
006760     MOVE FUNCTION ADDR(ISAPI-CTX-CNT) TO COBW3-CONTEXT.
006770     CALL "COBW3_INIT" USING COBW3.
006780
006790 LEER-DATO-HTML.
006800     MOVE "datosh" TO COBW3-SEARCH-DATA.
006810     CALL "COBW3_GET_VALUE" USING COBW3.
006820     MOVE COBW3-GET-DATA    TO DATO-LLEGADA-W.
001855     MOVE DATO-LLEGADA-W    TO LLAVE-SESION-W.
006830     
006840
006900 ABRIR-USUARIO.
006910     INITIALIZE OTR-STAT.
006920     MOVE "D:\WEB\HC-NTAS-EVOL\DATOS\SC-ARCHUSU.DAT" TO NOM-USU-W
006930
006940     OPEN INPUT ARCHIVO-USUNET
006950     EVALUATE OTR-STAT
006960       WHEN "00"  CONTINUE
006970       WHEN "35"  OPEN OUTPUT ARCHIVO-USUNET
006980                  INITIALIZE REG-USUNET
006990                  WRITE REG-USUNET
                        CLOSE ARCHIVO-USUNET
                        OPEN INPUT ARCHIVO-USUNET
007050       WHEN OTHER GO TO CERRAR-SESION
007060     END-EVALUATE.
007070
007080     INITIALIZE REG-USUNET.
007090     ACCEPT FECHA-TMP FROM DATE.
007100
007110 LEER-USUARIO.
007120     READ ARCHIVO-USUNET NEXT AT END MOVE 0 TO SW-FIN.
007130
007140     CLOSE ARCHIVO-USUNET.
007200     
007290  INICIAR-SESION.

007300     MOVE  "D:\WEB\HC-NTAS-EVOL\DATOS\SC-SESION.DAT" TO NOM-SESION-W
000820     MOVE FUNCTION CURRENT-DATE TO FECHA-TOTAL.
000830     ACCEPT HORA-TOTAL FROM TIME.
007310     GO TO  VALIDAR-SESION.
007320
007330 
007340 FIN-VALIDAR-SESION.
007350 
007360 CREAR-JSON.
007370
002261     MOVE NOM-SESION-W TO NOM-PLANO-W
002262     INSPECT NOM-PLANO-W REPLACING FIRST "SC-SESION.DAT "
002263                                      BY "SC-USUNET.JSON".
 
007440 
007450     OPEN OUTPUT ARCHIVO-JSON.
007460                
007470 PAGINA-CONFIG.
007480    
007490     MOVE CLAVE-EMAIL-USUNET  TO CLAVE-L
007500     MOVE NOMBRE-USUNET       TO NOMBRE-L
007510     MOVE NIT-USUNET          TO NIT-L
007520     MOVE DIRECC1-USUNET      TO DIRECC1-L
007530     MOVE EMAIL-USUNET        TO EMAIL-L
007540     MOVE CLAVE-EMAIL-USUNET  TO CLAVE-EMAIL-L
007550     MOVE SERV-EMAIL-USUNET   TO SERV-EMAIL-L
007560     MOVE PUERTO-EMAIL-USUNET TO PUERTO-EMAIL-L
007570    
007580     IF SSL-EMAIL-USUNET = "S"
007590        CONTINUE
007600     ELSE
007610        MOVE "N"             TO SSL-EMAIL-USUNET
007620     END-IF
007630
007640     MOVE SSL-EMAIL-USUNET   TO SSL-EMAIL-L
007650     MOVE IP-DATOS-USUNET    TO IP-DATOS-L
007660
007670     MOVE IP-DESCARGA-USUNET TO IP-EDIT.
007680
007690     IF IP1-EDIT = 1
007700        CONTINUE
007710     ELSE
007720        INITIALIZE IP-DESCARGA-USUNET
007730     END-IF
007740
007750     MOVE IP-DESCARGA-USUNET TO IP-DESCARGA-L
007760    
007770     IF DIR-SITIO-USUNET =   LOW-VALUES
007780        INITIALIZE DIR-SITIO-USUNET
007790     END-IF
007800     
007810     MOVE DIR-SITIO-USUNET   TO DIR-SITIO-L
007820     IF DIRECTORIO-USUNET =  LOW-VALUES
007830        INITIALIZE DIRECTORIO-USUNET
007840     END-IF
007850
007860     MOVE DIRECTORIO-USUNET  TO DIRECTORIO-L

           MOVE SUC-USUNET         TO SUC-L

           IF SUC-USUNET = SPACES OR LOW-VALUES
              MOVE 01              TO SUC-L
           END-IF
007870
007880     INSPECT LINEA-EDIT      REPLACING ALL "*"  BY CARAC-COMILLA     
007890     MOVE LINEA-EDIT         TO REG-PLANO
007900     WRITE REG-PLANO
007910     CLOSE ARCHIVO-JSON.
007920     MOVE "datosrecibidos"  TO COBW3-CNV-NAME
007930     MOVE 00                TO COBW3-CNV-VALUE
007940     CALL "COBW3_SET_CNV"   USING COBW3
007950     MOVE "../PAGINAS/RECIBIDOS.ASPX"  TO SALIDA-HTML
007960     PERFORM ABRIR-HTML.
007970 
007980   
007990 CERRAR-SESION.
008000     CALL "COBW3_FREE" USING COBW3.
008010     MOVE 1 TO PROGRAM-STATUS.
008020     EXIT PROGRAM.
008030
008040 COPY "P:\PROG\PROYECT\FUENTES\SC-WEB.CBL".
008050
008060 LLENAR-DATOS.
008070     IF CAMPO-W(J) = "|"
008080        ADD 1  TO SW-VAR J
008090        MOVE 1 TO K  
008100         
008110        IF SW-VAR = 1
008120           MOVE TABLA-W TO ID-EDIT-W
008130        END-IF
008140        IF SW-VAR = 2
008150           MOVE TABLA-W TO CLAVE-W
008160        END-IF        
008170        INITIALIZE TABLA-W
008180     END-IF.
008190          
008200     IF CAMPO-W(J) IS NOT EQUAL TO SPACES
008210        MOVE CAMPO-W(J) TO  CM-W(K)
008220        ADD 1 TO K
008230     END-IF.
008240    
