004820*=================================================================
004830*CREACION DE ARCHIVOS JSON // CARGUE DE PACIENTES CON UNSERV-HC 09 Y ESTADO-HC 01 Y DIFERENTE DE NIT-CONTABILIDAD-HC = "900566047"
004840*=================================================================
004850 IDENTIFICATION DIVISION.
004860 PROGRAM-ID. "HttpExtensionProc".
004870 ENVIRONMENT DIVISION.
004880 CONFIGURATION SECTION.
004890 INPUT-OUTPUT SECTION.
004900 FILE-CONTROL.
004910     COPY "P:\PROG\PROYECT\FUENTES\FS-USUNET.CBL".
004920     COPY "P:\PROG\PROYECT\FUENTES\FS-SESION.CBL".
004930
005020

           SELECT ARCHIVO-USUARIOS
                  ASSIGN NOM-USUAR-W
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC;
                  RECORD KEY IS NOMBRE-USU 
                  ALTERNATE RECORD KEY IS		
                  CLAVE-USU WITH DUPLICATES
                  ALTERNATE RECORD KEY IS
                  CTL-USU WITH DUPLICATES
                  ALTERNATE RECORD KEY IS
                  CLAVE-2-USU WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.


           SELECT ARCHIVO-RESTRICCION
                  ASSIGN NOM-REST-W
                  ORGANIZATION INDEXED;
                  ACCESS MODE DYNAMIC;
                  RECORD KEY LLAVE-REST
                  FILE STATUS OTR-STAT.


           SELECT ARCHIVO-PACIENTES
                  ASSIGN  NOM-PACIE-W
                  ORGANIZATION IS INDEXED;
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS COD-PACI
                  ALTERNATE RECORD KEY  
                  DESCRIP-PACI WITH DUPLICATES
                  ALTERNATE RECORD KEY  
                  EPS-PACI  WITH DUPLICATES
                  ALTERNATE RECORD KEY  
                  ID-COTIZ-PACI WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.


           SELECT HISTORIA-CLINICA LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-HCAPE-W
                  ORGANIZATION INDEXED;
                  ACCESS MODE DYNAMIC;
                  RECORD KEY IS LLAVE-HC
                  ALTERNATE RECORD KEY IS FOLIO-HC WITH DUPLICATES
                  ALTERNATE RECORD KEY IS FECHA-HC WITH DUPLICATES
                  ALTERNATE RECORD KEY IS MED-HC WITH DUPLICATES
                  ALTERNATE RECORD KEY IS ESTADO-HC WITH DUPLICATES
                  FILE STATUS OTR-STAT.



005030     SELECT ARCHIVO-JSON
005040            ASSIGN NOM-PLANO-W
005050            ORGANIZATION IS LINE SEQUENTIAL
005060            FILE STATUS IS OTR-STAT.

005070
005080 DATA DIVISION.
005090 FILE SECTION.
005100 COPY "P:\PROG\PROYECT\FUENTES\FD-USUNET.CBL".
005110 COPY "P:\PROG\PROYECT\FUENTES\FD-SESION.CBL".
005110 COPY "S:\NEWCOBOL\FUENTES\FD-RESTR.CBL".
005110 COPY "S:\NEWCOBOL\FUENTES\FD-USUAR.CBL".
005110 COPY "S:\NEWCOBOL\FUENTES\FD-PACIE.CBL".
005110 COPY "S:\NEWCOBOL\FUENTES\FD-HCAPER17.CBL".
005130
005140 FD  ARCHIVO-JSON
005150     LABEL RECORD STANDARD.
005160 01  REG-PLANO.
005170     02 DATOS-PLANO     PIC X(700).

005190 WORKING-STORAGE SECTION.
005200 COPY "P:\PROG\PROYECT\FUENTES\COBW3.CBL".
005210 COPY "P:\PROG\PROYECT\FUENTES\WEB-CARAC.CBL".
005220 
000981 77  NOM-PACIE-W               PIC X(70).

       77  NOM-HCAPE-W               PIC X(70).
001000 77  NOM-PLANO-W               PIC X(90).
       77  NOM-USUAR-W               PIC X(70).
       77  PACI-EDIT                 PIC ZZZZZZZZZZZZZZZ.
       77  EDITADO-W                 PIC X(10).
       77  NUMERO-EDIT               PIC ZZ.ZZ.
       77  HORAS-EDIT                PIC ZZZ.Z.


005260
001067 77  SUC-TMP                   PIC X.
005230 77  SW-VAR                    PIC 9.
005240 77  K                         PIC 99.
001252 77  MES-SAL-W                 PIC X(4).
001240 77  TAR-W                     PIC 99V9.
001250 77  VALOR-VENTA               PIC 9(12).
001251 77  IVA-TMP                   PIC 9(12).
001253 77  EXISTENCIAS-TMP           PIC S9(12)V99.
       77  NRO-EDIT                  PIC ZZZZZZZZZZZZ.
       77  CANT-EDIT                 PIC ZZZZ.Z.
       77  PROCENTAJE-EDIT           PIC ZZ.Z.
       01  CONT-T                    PIC 999999.
       01  CONT                      PIC 999999.

000228 01 COD-TMP.
000229    02 SW-ALFA                 PIC 9.
000230    02 TABLA-COD1.
000231       03 COD1-PAC             PIC X OCCURS 10.
000232    02 TABLA-COD2.
000233       03 COD2-PAC             PIC X OCCURS 10.


       01 ID-EDIT                    PIC 9.


005270 01  DATO-LLEGADA-W.
005280     02 ID-LLEGAD-W            PIC X(15).
           02 FECHA-LLEGAD-W         PIC X(8).
           02 HORA-LLEGAD-W          PIC X(6).


002000 01 LIN-2.  
002010    02 FILLER                  PIC X(7)   VALUE "{*COD*:".
002020    02 FILLER                  PIC X      VALUE "*".
002030    02 COD-PACI-J              PIC X(15).
          02 FILLER                  PIC XX     VALUE "*,".
002050    02 FILLER                  PIC X(10)  VALUE "*TIPO-ID*:".
002060    02 FILLER                  PIC X      VALUE "*".
002070    02 TIPO-ID-PACI-J          PIC X(3).
002040    02 FILLER                  PIC XX     VALUE "*,".       
002050    02 FILLER                  PIC X(10)  VALUE "*DESCRIP*:".
002060    02 FILLER                  PIC X      VALUE "*".
002070    02 DESCRIP-PACI-J          PIC X(54).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(8)   VALUE "*ENTID*:".
          02 FILLER                  PIC X      VALUE "*".
          02 ENT-PACI-J              PIC X(6).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(10)  VALUE "*COD-OCU*:".
          02 FILLER                  PIC X      VALUE "*".
          02 OCUPA-PACI-J            PIC X(4).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(6)   VALUE "*SEX*:".
          02 FILLER                  PIC X      VALUE "*".
          02 SEXO-PCI-J              PIC X.
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(7)   VALUE "*NACI*:".
          02 FILLER                  PIC X      VALUE "*".
          02 FECHA-NACI-J            PIC X(8).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(11)  VALUE "*COD-CIUD*:".
          02 FILLER                  PIC X      VALUE "*".
          02 COD-CIUD-J              PIC X(5).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(9)   VALUE "*ACOMPA*:".
          02 FILLER                  PIC X      VALUE "*".
          02 ACOMPA-PACI-J           PIC X(30).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(6)   VALUE "*TEL*:".
          02 FILLER                  PIC X      VALUE "*".
          02 TEL-PACI-J              PIC X(10).
002080    02 FILLER                  PIC XX     VALUE "*,".       
002090    02 FILLER                  PIC X(9)   VALUE "*DIRECC*:".
002100    02 FILLER                  PIC X      VALUE "*".
002110    02 DIRECC-PACI-J           PIC X(30).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(9)   VALUE "*CRONIC*:".
          02 FILLER                  PIC X      VALUE "*".
          02 CRONIC-PACI-J           PIC X.
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(11)  VALUE "*NIT-PACI*:".
          02 FILLER                  PIC X      VALUE "*".
          02 NIT-PACI-J              PIC X(10).
002320    02 FILLER                  PIC XX     VALUE "*}".  
003410    02 CIERRE-LIN-2            PIC X.

006300
006310 LINKAGE SECTION.
006320 COPY "P:\PROG\PROYECT\FUENTES\ISAPICTX.CBL".
006330 PROCEDURE DIVISION WITH stdcall LINKAGE USING ISAPI-CTX-CNT.
006340
006350 DECLARATIVES.
002570 I-O-TEST SECTION.
002580     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUARIOS.         
002590 ESCR-EXCEPTIONES.
002600     IF OTR-STAT = "00" 
002610        CONTINUE 
002620     ELSE
002630        MOVE OTR-STAT         TO MENSAJE1-HTML
002640        MOVE NOM-USUAR-W      TO MENSAJE2-HTML
002650        MOVE "HC-NTAS-A"      TO MENSAJE3-HTML
002660        GO TO ENVIAR-ERROR
002670     END-IF.

006360 I-O-TEST SECTION.
006370     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUNET.         
006380 ESCR-EXCEPTIONES.
006390     IF OTR-STAT = "00"
006400        CONTINUE 
006410     ELSE
006420        MOVE OTR-STAT         TO MENSAJE1-HTML
006430        MOVE NOM-USU-W        TO MENSAJE2-HTML
006440        MOVE "HC-NTAS-A"      TO MENSAJE3-HTML
006450        GO TO ENVIAR-ERROR
006460     END-IF.
006470
006480 I-O-TEST SECTION.
006490     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SESION.
006500 ESCR-EXCEPTIONES.
006510     IF OTR-STAT = "00" 
006520        CONTINUE 
006530     ELSE
006540        MOVE OTR-STAT         TO MENSAJE1-HTML
006550        MOVE NOM-SESION-W     TO MENSAJE2-HTML
006560        MOVE "HC-NTAS-A"      TO MENSAJE3-HTML
006570        GO TO ENVIAR-ERROR
006580     END-IF.
006590  
006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-RESTRICCION.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MENSAJE1-HTML
006670        MOVE NOM-REST-W       TO MENSAJE2-HTML
006680        MOVE "HC-NTAS-A"      TO MENSAJE3-HTML
006690        GO TO ENVIAR-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-PACIENTES.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MENSAJE1-HTML
006670        MOVE NOM-PACIE-W      TO MENSAJE2-HTML
006680        MOVE "HC-NTAS-A"      TO MENSAJE3-HTML
006690        GO TO ENVIAR-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON HISTORIA-CLINICA.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MENSAJE1-HTML
006670        MOVE NOM-HCAPE-W      TO MENSAJE2-HTML
006680        MOVE "HC-NTAS-A"      TO MENSAJE3-HTML
006690        GO TO ENVIAR-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-JSON.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" OR "35"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MENSAJE1-HTML
006670        MOVE NOM-PLANO-W      TO MENSAJE2-HTML
006680        MOVE "HC-NTAS-A"      TO MENSAJE3-HTML
006690        GO TO ENVIAR-ERROR
006700     END-IF.

006720  END DECLARATIVES.
006730
006740 INICIAR-IIS.
006750     MOVE LOW-VALUE TO COBW3.
006760     MOVE FUNCTION ADDR(ISAPI-CTX-CNT) TO COBW3-CONTEXT.
006770     CALL "COBW3_INIT" USING COBW3.
006780
006790 LEER-DATO-HTML.
006800     MOVE "datosh" TO COBW3-SEARCH-DATA.
006810     CALL "COBW3_GET_VALUE" USING COBW3.
006820     MOVE COBW3-GET-DATA    TO DATO-LLEGADA-W.

001855     MOVE DATO-LLEGADA-W    TO LLAVE-SESION-W.
           MOVE FUNCTION CURRENT-DATE TO FECHA-TOTAL.

000797 INICIAR-SESION.
000806     MOVE "D:\WEB\HC-NTAS-EVOL\DATOS\SC-SESION.DAT" TO NOM-SESION-W
000820     MOVE FUNCTION CURRENT-DATE TO FECHA-TOTAL.
000830     ACCEPT HORA-TOTAL FROM TIME.
000810     GO TO VALIDAR-SESION.
000850
000860 FIN-VALIDAR-SESION.
006840
006900 ABRIR-USUARIO.
006910     INITIALIZE OTR-STAT.
006920     MOVE "D:\WEB\HC-NTAS-EVOL\DATOS\SC-ARCHUSU.DAT" TO NOM-USU-W
006930
006940     OPEN INPUT ARCHIVO-USUNET
006950     EVALUATE OTR-STAT
006960       WHEN "00"  CONTINUE
006970       WHEN "35"  OPEN OUTPUT ARCHIVO-USUNET
006980                  INITIALIZE REG-USUNET
006990                  WRITE REG-USUNET
007000                  CLOSE ARCHIVO-USUNET
007010                  MOVE "Validacion de Usuario"       TO MENSAJE1-HTML
007020                  MOVE "Falta configurar usuarios"   TO MENSAJE2-HTML
007030                  MOVE "Sc"                          TO MENSAJE3-HTML
007040                  GO TO ENVIAR-ERROR
007050       WHEN OTHER GO TO CERRAR-SESION
007060     END-EVALUATE.
007070
007080     INITIALIZE LLAVE-USUNET.

007100
007110 LEER-USUARIO.
007120     READ ARCHIVO-USUNET NEXT AT END MOVE 0 TO SW-FIN.
007130
007140     CLOSE ARCHIVO-USUNET.
007200     
007210     IF NOMBRE-USUNET = SPACES
007220     OR NIT-USUNET = ZEROS
007230        MOVE "Validacion de Sesion"        TO MENSAJE1-HTML
007240        MOVE "Falta configurar usuarios"   TO MENSAJE2-HTML
007250        MOVE "Sc"                          TO MENSAJE3-HTML
007260        GO TO ENVIAR-ERROR
007270     END-IF.
007280 
007350

       ASIGNAR-NOMBRES.
           INITIALIZE NOM-USU-W NOM-USUAR-W NOM-REST-W NOM-PLANO-W NOM-HCAPE-W
                      

           INSPECT IP-DATOS-USUNET REPLACING FIRST "/" BY "\".
           MOVE "\\"  TO NOM-REST-W NOM-USUAR-W  NOM-PLANO-W  NOM-HCAPE-W
007150     INSPECT NOM-REST-W  REPLACING FIRST "                    "
007160                                      BY IP-DATOS-USUNET
007170     INSPECT NOM-REST-W  REPLACING FIRST " "
007180                                      BY "\"
007190     INSPECT NOM-REST-W  REPLACING FIRST "                          "
007200                                      BY "NEWCOBOL\DATOS\ARCHREST.SC".


           INSPECT NOM-USUAR-W REPLACING FIRST  "                    "
                                            BY  IP-DATOS-USUNET
           INSPECT NOM-USUAR-W REPLACING FIRST  " "
                                            BY  "\"
           INSPECT NOM-USUAR-W REPLACING FIRST  "                              "
007183                                      BY  DIRECTORIO-USUNET
           INSPECT NOM-USUAR-W REPLACING FIRST  "                "
                                            BY  "\CONTROL\ARCHUSU".

           MOVE NOM-USUAR-W  TO NOM-PACIE-W
           
           INSPECT NOM-PACIE-W  REPLACING FIRST "ARCHUSU     "
                                             BY "SC-PACIE.DAT".

           INSPECT NOM-HCAPE-W REPLACING FIRST  "                    "
                                            BY  IP-DATOS-USUNET

           INSPECT NOM-HCAPE-W REPLACING FIRST  " "
                                            BY  "\"

           INSPECT NOM-HCAPE-W REPLACING FIRST  "                               "
                                            BY  "NEWCOBOL\HC\DATOS\SC-HCAPER.S17".


007220     INSPECT NOM-PLANO-W  REPLACING FIRST "                    "
007230                                       BY IP-DATOS-USUNET
007240     INSPECT NOM-PLANO-W  REPLACING FIRST " "
007250                                       BY "\"
007260     INSPECT NOM-PLANO-W  REPLACING FIRST "                                                                 "
007280                                       BY "NEWCOBOL\DATOS\JSON\SC-ARCHPAC-XXXXXXXXXXXXXXXXXXXXXXXXXXXXX.JSON"
007281     INSPECT NOM-PLANO-W  REPLACING FIRST "XXXXXXXXXXXXXXXXXXXXXXXXXXXXX"
007282                                       BY DATO-LLEGADA-W.  

        ABRIR-USUARIOS.
           OPEN INPUT ARCHIVO-USUARIOS
           READ ARCHIVO-USUARIOS NEXT WITH NO LOCK AT END 
                CLOSE ARCHIVO-USUARIOS
           END-READ.
          
007660
       ABRIR-HC.

           OPEN OUTPUT ARCHIVO-JSON.
           OPEN INPUT ARCHIVO-PACIENTES
                      HISTORIA-CLINICA.

           INITIALIZE REG-HC.
           MOVE "{*Pacientes*:[" TO  DATOS-PLANO
           INSPECT DATOS-PLANO REPLACING ALL "*" BY CARAC-COMILLA
           WRITE REG-PLANO.

           MOVE 1     TO ESTADO-HC
           START HISTORIA-CLINICA KEY = ESTADO-HC
                 INVALID KEY 
007230                       MOVE "99"                    TO MENSAJE1-HTML
007240                       MOVE "No hay historias abiertas"   TO MENSAJE2-HTML
007250                       MOVE "HC-NTAS-A"             TO MENSAJE3-HTML
007260                       GO TO ENVIAR-ERROR
           END-START.

       LEER-HC.

           READ HISTORIA-CLINICA NEXT WITH NO LOCK AT END GO TO CERRAR-HC.


           IF ESTADO-HC = 1
              CONTINUE
           ELSE
              GO TO CERRAR-HC
           END-IF

           IF UNSERV-HC IS NOT EQUAL TO 09
              GO TO LEER-HC
           END-IF

           IF NIT-CONTABILIDAD-HC = "0900541158"
              GO TO LEER-HC 
           END-IF
      
           MOVE ID-HC             TO COD-PACI
           READ ARCHIVO-PACIENTES WITH NO LOCK
                INVALID KEY GO TO LEER-HC
           END-READ


           INITIALIZE LIN-2
           MOVE COD-PACI         TO PACI-EDIT     
           MOVE PACI-EDIT        TO COD-PACI-J
           MOVE TIPO-ID-PACI     TO TIPO-ID-PACI-J
           MOVE DESCRIP-PACI     TO DESCRIP-PACI-J
           MOVE EPS-PACI         TO ENT-PACI-J
           MOVE OCUP-V8-PACI     TO OCUPA-PACI-J
           MOVE SEXO-PACI        TO SEXO-PCI-J
           MOVE NACIM-PACI       TO FECHA-NACI-J
           MOVE CIUDAD-PACI      TO COD-CIUD-J
           MOVE ACOMPA-PACI      TO ACOMPA-PACI-J
           MOVE TELEFONO-PACI    TO EDITADO-W

           PERFORM EDITAR-NUMERO
           MOVE TABLA-COD2       TO TEL-PACI-J


           MOVE DIRECC-PACI      TO DIRECC-PACI-J
           INSPECT DIRECC-PACI-J REPLACING ALL "'" BY " "
           MOVE CRONICO-PACI     TO CRONIC-PACI-J
           MOVE NIT-FACT-PACI    TO NIT-PACI-J

007940     INSPECT LIN-2 REPLACING ALL "*" BY CARAC-COMILLA 
007950     MOVE "," TO CIERRE-LIN-2
007710     MOVE LIN-2 TO DATOS-PLANO
007720     WRITE REG-PLANO

           GO TO LEER-HC.

       CERRAR-HC.

           INITIALIZE CIERRE-LIN-2
008030     MOVE LIN-2 TO DATOS-PLANO
008040     WRITE REG-PLANO END-WRITE
008050
008060     MOVE "]}" TO DATOS-PLANO
008070     WRITE REG-PLANO END-WRITE
008080          
008090     CLOSE ARCHIVO-PACIENTES
008100           ARCHIVO-JSON.


010700 PAGINA-CONFIG.  
010720     MOVE "datosrecibidos" TO COBW3-CNV-NAME
010730     MOVE 00               TO COBW3-CNV-VALUE
010740     CALL "COBW3_SET_CNV" USING COBW3
010750
010760     MOVE "..\PAGINAS\RECIBIDOS.ASPX" TO SALIDA-HTML  
010770     PERFORM ABRIR-HTML.
007980   
007990 CERRAR-SESION.
008000     CALL "COBW3_FREE" USING COBW3.
008010     MOVE 1 TO PROGRAM-STATUS.
008020     EXIT PROGRAM.

       EDITAR-NUMERO.

           INSPECT EDITADO-W REPLACING FIRST  "ABCDEFGHIJKLMNOPQRSTUVWXYZ"
                                          BY  "                          ".

           MOVE EDITADO-W TO TABLA-COD1
           INITIALIZE TABLA-COD2 SW-ALFA
           MOVE 10    TO LP
           PERFORM MOVER-COD VARYING LN FROM 10 BY -1
                               UNTIL LN < 1 OR LP < 1.

           INSPECT TABLA-COD2 REPLACING ALL " " BY "0".

       MOVER-COD.
           IF COD1-PAC (LN) IS NUMERIC
           OR COD1-PAC (LN) = "-"
              MOVE COD1-PAC (LN)    TO COD2-PAC(LN)
              SUBTRACT 1 FROM LP
           END-IF.

007990
008030
008040 COPY "P:\PROG\PROYECT\FUENTES\SC-WEB.CBL".
0
