000020 IDENTIFICATION DIVISION.
000030 PROGRAM-ID. SC-RELOJ.
000050*********CALCULA FECHA APARTIR DE UNA FECHA Y SU INCREMENTO****
000060
000080 ENVIRONMENT     DIVISION.
000090 INPUT-OUTPUT SECTION.
000100 FILE-CONTROL.
000120* FS...
000130 DATA DIVISION.
000140 FILE SECTION.
000141* FD...
000150 WORKING-STORAGE SECTION.
000161 COPY "P:\PROG\PROYECT\FUENTES\WEB-CARAC.CBL".
000162
000170 01 CONT-W PIC 9(5).
000171
000172 01 DIA-MAX                PIC 99.
000180
000190
000200 LINKAGE SECTION.
000210 01 DATO-INICIO-W.
000220    02 FECHA-INI-W.
000230       03 ANO-INI-W        PIC 9(4).
000240       03 MES-INI-W        PIC 99.
000250       03 DIA-INI-W        PIC 99.
000260    02 HORA-INI-W.
000270       03 HR-INI-W         PIC 99.
000280       03 MN-INI-W         PIC 99.
000290       03 SG-INI-W         PIC 99.
000300 01 ADICION.
000310    02 TIPO PIC X.
000320    02 CANT PIC S9(4).
000330 01 DATO-RETURN.
000340    02 FECHA-RETURN.
000350       03 ANO-RETURN        PIC 9(4).
000360       03 MES-RETURN        PIC 99.
000370       03 DIA-RETURN        PIC 99.
000380    02 HORA-RETURN.
000390       03 HR-RETURN         PIC 99.
000400       03 MN-RETURN         PIC 99.
000410       03 SG-RETURN         PIC 99.
000411
000412
000413 01 SW-INVALID-W              PIC 99.
000414 01 MENSAJE-INDALID-W         PIC X(50).
000415
000420*TIPO=A=AÑOS,M=MESES,D=DIAS,H=HORAS,T=MINUTOS,S=SEGUNDOS
000430*SI CANT ES NEGATIVO(-)  SE HACE ES UN DECREMENTO
000440
000450 PROCEDURE DIVISION USING DATO-INICIO-W ADICION DATO-RETURN SW-INVALID-W MENSAJE-INDALID-W.
000470 PROCEDURAL SECTION.
000471
000480 INICIO.
000490     MOVE DATO-INICIO-W TO DATO-RETURN
000500     INITIALIZE SW-INVALID-W.
000520     IF CANT = 0
000530        GO TO SALIR
000540     ELSE
000550        EVALUATE TIPO
000560        WHEN "A" PERFORM ANO
000570        WHEN "M" PERFORM MES
000580        WHEN "D" PERFORM DIA
000590        WHEN "H" PERFORM HORA
000600        WHEN "T" PERFORM MINUTO
000610        WHEN "S" PERFORM SEGUNDO
000620        WHEN OTHER 
000621                 MOVE 37                     TO SW-INVALID-W
000622                 MOVE "Fecha fuera de rango" TO MENSAJE-INDALID-W
000632                 GO TO SALIR
000650        END-EVALUATE
000660     END-IF.
000661
000680 SALIR.
000690     EXIT PROGRAM.
000700
000730
000740 SEGUNDO.
000750     IF CANT < 0
000760        PERFORM RESTAR-SEGUNDO VARYING CONT-W FROM CANT BY -1
000770                               UNTIL CONT-W < 1
000780     ELSE
000790        PERFORM SUMAR-SEGUNDO VARYING CONT-W FROM 1 BY 1
000800                              UNTIL CONT-W > CANT
000810     END-IF.
000820
000830 MINUTO.
000840     IF CANT < 0
000850        PERFORM RESTAR-MINUTO VARYING CONT-W FROM CANT BY -1
000860                              UNTIL CONT-W < 1
000870     ELSE
000880        PERFORM SUMAR-MINUTO VARYING CONT-W FROM CANT BY 1
000890                             UNTIL CONT-W > CANT
000900     END-IF.
000901
000920 HORA.
000930     IF CANT < 0
000940        PERFORM RESTAR-HORA VARYING CONT-W FROM CANT BY -1
000950                            UNTIL CONT-W < 1
000960     ELSE
000970        PERFORM SUMAR-HORA VARYING CONT-W FROM 1 BY 1
000980                           UNTIL CONT-W > CANT
000990     END-IF.
001000
001010
001020 DIA.
001030     IF CANT < 0
001040        PERFORM RESTAR-DIA VARYING CONT-W FROM CANT BY -1
001050                       UNTIL CONT-W < 1
001060     ELSE
001070        PERFORM SUMAR-DIA VARYING CONT-W FROM 1 BY 1
001080                          UNTIL CONT-W > CANT
001090     END-IF.
001100
001110 MES.
001120     IF CANT < 0
001130        PERFORM RESTAR-MES VARYING CONT-W FROM CANT BY -1
001140                       UNTIL CONT-W < 1
001150     ELSE
001160        PERFORM SUMAR-MES VARYING CONT-W FROM 1 BY 1
001170                       UNTIL CONT-W > CANT
001180     END-IF.
001190
001200
001210
001220
001230 ANO.
001240     IF CANT < 0
001250     PERFORM RESTAR-ANO VARYING CONT-W FROM CANT BY -1
001260                       UNTIL CONT-W < 1
001270     ELSE
001280     PERFORM SUMAR-ANO VARYING CONT-W FROM 1 BY 1
001290                       UNTIL CONT-W > CANT
001300     END-IF.
001310
001320 RESTAR-SEGUNDO.
001330     IF SG-RETURN = 00
001340        MOVE 59 TO SG-RETURN
001350        PERFORM RESTAR-MINUTO
001360     ELSE
001370        SUBTRACT 1 FROM SG-RETURN
001380     END-IF.
001390
001400
001410 SUMAR-SEGUNDO.
001420     ADD 1 TO SG-RETURN
001430     IF SG-RETURN > 59
001440        MOVE 00 TO SG-RETURN
001450        PERFORM SUMAR-MINUTO
001460     END-IF.
001470
001480
001490 RESTAR-MINUTO.
001500     IF MN-RETURN = 00
001510        MOVE 59 TO MN-RETURN
001520        PERFORM RESTAR-HORA
001530     ELSE
001540        SUBTRACT 1 FROM MN-RETURN
001550     END-IF.
001560
001570 SUMAR-MINUTO.
001580     ADD 1 TO MN-RETURN
001590
001600     IF MN-RETURN > 59
001610        MOVE 00 TO MN-RETURN
001620        PERFORM SUMAR-HORA
001630     END-IF.
001640
001650
001660 RESTAR-HORA.
001670     IF HR-RETURN = 00
001680        MOVE 23 TO HR-RETURN
001690        PERFORM RESTAR-DIA
001700     ELSE
001710        SUBTRACT 1 FROM HR-RETURN
001720     END-IF.
001730
001740 SUMAR-HORA.
001750     ADD 1 TO HR-RETURN
001760     IF HR-RETURN > 23
001770        MOVE 00 TO HR-RETURN
001780        PERFORM SUMAR-DIA
001790     END-IF.
001800
001810
001820 RESTAR-DIA.
001830     SUBTRACT 1 FROM DIA-RETURN
001840
001850     IF DIA-RETURN < 1
001860       PERFORM RESTAR-MES
001870     END-IF.
001880
001890 SUMAR-DIA.
001900     PERFORM CALC-DIA-MAX
001910     ADD 1 TO DIA-RETURN
001920
001930     IF DIA-RETURN > DIA-MAX
001940       MOVE 1 TO DIA-RETURN
001950       PERFORM SUMAR-MES
001960     END-IF.
001970
001980 RESTAR-MES.
001990     SUBTRACT 1 FROM MES-RETURN
002000     IF MES-RETURN < 01
002010        MOVE 12 TO MES-RETURN
002020        PERFORM RESTAR-ANO
002030     END-IF.
002040     PERFORM CALC-DIA-MAX
002050     MOVE DIA-MAX TO DIA-RETURN.
002060
002070 SUMAR-MES.
002080     ADD 1 TO MES-RETURN
002090     IF MES-RETURN > 12
002100        MOVE 1 TO MES-RETURN
002110        PERFORM SUMAR-ANO
002120     END-IF.
002130
002140
002150 RESTAR-ANO.
002160     SUBTRACT 1 FROM ANO-RETURN.
002170
002180 SUMAR-ANO.
002190     ADD 1 TO ANO-RETURN.
002200
002210
002220 CALC-DIA-MAX.
002230      EVALUATE MES-RETURN
002240           WHEN 01 MOVE 31 TO DIA-MAX
002250           WHEN 02
002260                   IF ANO-RETURN = 2012 OR 2016 OR 2020 OR 2024
002270                                  OR 2028 OR 2032 OR 2036 OR 2040
002280                                  OR 2044 OR 2048 OR 2052 OR 2056
002290                       MOVE 29 TO DIA-MAX
002300                   ELSE
002310                       MOVE 28 TO DIA-MAX
002320                   END-IF
002330           WHEN 03 MOVE 31 TO DIA-MAX
002340           WHEN 04 MOVE 30 TO DIA-MAX
002350           WHEN 05 MOVE 31 TO DIA-MAX
002360           WHEN 06 MOVE 30 TO DIA-MAX
002370           WHEN 07 MOVE 31 TO DIA-MAX
002380           WHEN 08 MOVE 31 TO DIA-MAX
002390           WHEN 09 MOVE 30 TO DIA-MAX
002400           WHEN 10 MOVE 31 TO DIA-MAX
002410           WHEN 11 MOVE 30 TO DIA-MAX
002420           WHEN 12 MOVE 31 TO DIA-MAX
002430           END-EVALUATE.
