004820*=================================================================
700483*CREACION DE ARCHIVOS PLANO
004840*=================================================================
004850 IDENTIFICATION DIVISION.
004860 PROGRAM-ID. "HttpExtensionProc".
004870 ENVIRONMENT DIVISION.
004880 CONFIGURATION SECTION.
004890 INPUT-OUTPUT SECTION.
004900 FILE-CONTROL.
004910     COPY "P:\PROG\PROYECT\FUENTES\FS-USUNET.CBL".
004920     COPY "P:\PROG\PROYECT\FUENTES\FS-SESION.CBL".
004930
005020

           SELECT ARCHIVO-USUARIOS
                  ASSIGN NOM-USUAR-W
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC;
                  RECORD KEY IS NOMBRE-USU 
                  ALTERNATE RECORD KEY IS		
                  CLAVE-USU WITH DUPLICATES
                  ALTERNATE RECORD KEY IS
                  CTL-USU WITH DUPLICATES
                  ALTERNATE RECORD KEY IS
                  CLAVE-2-USU WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.


           SELECT ARCHIVO-RESTRICCION
                  ASSIGN NOM-REST-W
                  ORGANIZATION INDEXED;
                  ACCESS MODE DYNAMIC;
                  RECORD KEY LLAVE-REST
                  FILE STATUS OTR-STAT.


           SELECT ARCHIVO-PACIENTES
                  ASSIGN  NOM-PACIE-W
                  ORGANIZATION IS INDEXED;
                  ACCESS MODE  IS DYNAMIC;
                  RECORD KEY   IS COD-PACI
                  ALTERNATE RECORD KEY
                  DESCRIP-PACI WITH DUPLICATES
                  ALTERNATE RECORD KEY  
                  EPS-PACI  WITH DUPLICATES
                  ALTERNATE RECORD KEY  
                  ID-COTIZ-PACI WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.


005030     SELECT ARCHIVO-TEMPORAL
005040            ASSIGN NOM-TMP-W
005050            ORGANIZATION IS INDEXED;
                  ACCESS MODE  IS DYNAMIC;
                  RECORD KEY   IS LLAVE-TMP
                  ALTERNATE RECORD KEY 
                  FOLIO-TMP WITH DUPLICATES
                  ALTERNATE RECORD KEY 
                  FECHA-TMP WITH DUPLICATES
005060            FILE STATUS IS OTR-STAT.


005030     SELECT ARCHIVO-JSON
005040            ASSIGN NOM-PLANO2-W
005050            ORGANIZATION IS LINE SEQUENTIAL
005060            FILE STATUS IS OTR-STAT.
005070
005080 DATA DIVISION.
005090 FILE SECTION.
005100 COPY "P:\PROG\PROYECT\FUENTES\FD-USUNET.CBL".
005110 COPY "P:\PROG\PROYECT\FUENTES\FD-SESION.CBL".
005110 COPY "S:\NEWCOBOL\FUENTES\FD-USUAR.CBL".
005110 COPY "S:\NEWCOBOL\FUENTES\FD-RESTR.CBL".
005110 COPY "S:\NEWCOBOL\FUENTES\FD-PACIE.CBL".
005130
005140 FD  ARCHIVO-TEMPORAL
005150     LABEL RECORD STANDARD.
005160 01  REG-TMP.
005170     02 LLAVE-TMP.
              03 LLAVE-FECHA-TMP.
                 05 LLAVE-PACI-TMP.
                    07 ID-PACI-TMP     PIC X(15). 
                    07 FOLIO-TMP.
                       09 SUC-TMP      PIC XX.
                       09 NRO-TMP      PIC 9(6).
                 05 FECHA-TMP.
                    07 AÑO-TMP         PIC 9(4).
                    07 MES-TMP         PIC 99.
                    07 DIA-TMP         PIC 99.
              03 HORA-TMP.
                 05 HR-TMP             PIC 99.
                 05 MN-TMP             PIC 99.
              03 OPER-TMP              PIC X(4).
           02 ESTADO-TMP               PIC 9.
           02 DATOS-TMP                PIC X(900)  OCCURS 35.


005140 FD  ARCHIVO-JSON
005150     LABEL RECORD STANDARD.
005160 01  REG-PLANO2.
005170     02 DATOS-PLANO2     PIC X(1000).


005190 WORKING-STORAGE SECTION.
005200 COPY "P:\PROG\PROYECT\FUENTES\COBW3.CBL".
005210 COPY "P:\PROG\PROYECT\FUENTES\WEB-CARAC.CBL".
005220 


001000 77  NOM-TMP-W                 PIC X(90).
       77  NOM-PLANO2-W              PIC X(90).
       77  NOM-USUAR-W               PIC X(70).
       77  NOM-PACIE-W               PIC X(70).

       77  PACI-EDIT                 PIC ZZZZZZZZZZZZZZZ.
       77  EDITADO-W                 PIC X(10).
       77  NUMERO-EDIT               PIC ZZ.ZZ.
       77  HORAS-EDIT                PIC ZZZ.Z.


005230 77  SW-VAR                    PIC 9.
005240 77  K                         PIC 999.
       01  CONT-T                    PIC 999.
       01  CONT                      PIC 999.
       77  NRO-EDIT                  PIC ZZZZZZZZZZZZ.
       77  CANT-EDIT                 PIC ZZZZ.Z.
       77  PROCENTAJE-EDIT           PIC ZZ.Z.

000228 01 COD-TMP.
000229    02 SW-ALFA                 PIC 9.
000230    02 TABLA-COD1.
000231       03 COD1-PAC             PIC X OCCURS 10.
000232    02 TABLA-COD2.
000233       03 COD2-PAC             PIC X OCCURS 10.


       01 ID-EDIT                    PIC 9.
       01 ID-PACIENT-W               PIC X(15).

005270 01  DATO-LLEGADA-W.
           02 SESION-LLEGAD-W.
005280        03 ID-LLEGAD-W         PIC X(15).
              03 FECHA-LLEGAD-W      PIC X(8).
              03 HORA-LLEGAD-W       PIC X(6).


       01 LIN-01.
          02 FILLER                  PIC X(9)  VALUE "{*LLAVE*:".
          02 FILLER                  PIC X     VALUE "*".
          02 LLAVE-TMP-J             PIC X(39).
          02 FILLER                  PIC XX    VALUE "*,".
          02 FILLER                  PIC X(6)  VALUE "*EST*:".
          02 FILLER                  PIC X     VALUE "*".
          02 ESTADO-TMP-J            PIC X.
          02 FILLER                  PIC XX    VALUE "*,".
          02 FILLER                  PIC X(11) VALUE "*DETALLE*:[".



       01 TABLA-DEVO-W.
          02 COMA-W                   PIC X.
          02 NOM-REG-W                PIC X(11).
          02 FILLER                   PIC X     VALUE "*".
          02 RENG-DEVO-W              PIC X(900).
          02 FILLER                   PIC XX     VALUE "*}".


006310 LINKAGE SECTION.
006320 COPY "P:\PROG\PROYECT\FUENTES\ISAPICTX.CBL".
006330 PROCEDURE DIVISION WITH stdcall LINKAGE USING ISAPI-CTX-CNT.
006340
006350 DECLARATIVES.
002570 I-O-TEST SECTION.
002580     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUARIOS.         
002590 ESCR-EXCEPTIONES.
002600     IF OTR-STAT = "00" 
002610        CONTINUE 
002620     ELSE
002630        MOVE OTR-STAT         TO MENSAJE1-HTML
002640        MOVE NOM-USUAR-W      TO MENSAJE2-HTML
002650        MOVE "VERIFICAR-TMP"  TO MENSAJE3-HTML
002660        GO TO ENVIAR-ERROR
002670     END-IF.

006360 I-O-TEST SECTION.
006370     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUNET.         
006380 ESCR-EXCEPTIONES.
006390     IF OTR-STAT = "00"
006400        CONTINUE 
006410     ELSE
006420        MOVE OTR-STAT         TO MENSAJE1-HTML
006430        MOVE NOM-USU-W        TO MENSAJE2-HTML
006440        MOVE "VERIFICAR-TMP"  TO MENSAJE3-HTML
006450        GO TO ENVIAR-ERROR
006460     END-IF.
006470
006480 I-O-TEST SECTION.
006490     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SESION.
006500 ESCR-EXCEPTIONES.
006510     IF OTR-STAT = "00" 
006520        CONTINUE 
006530     ELSE
006540        MOVE OTR-STAT         TO MENSAJE1-HTML
006550        MOVE NOM-SESION-W     TO MENSAJE2-HTML
006560        MOVE "VERIFICAR-TMP"  TO MENSAJE3-HTML
006570        GO TO ENVIAR-ERROR
006580     END-IF.
006590  
006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-RESTRICCION.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MENSAJE1-HTML
006670        MOVE NOM-REST-W       TO MENSAJE2-HTML
006680        MOVE "VERIFICAR-TMP"  TO MENSAJE3-HTML
006690        GO TO ENVIAR-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-PACIENTES.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MENSAJE1-HTML
006670        MOVE NOM-PACIE-W      TO MENSAJE2-HTML
006680        MOVE "VERIFICAR-TMP"  TO MENSAJE3-HTML
006690        GO TO ENVIAR-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-TEMPORAL.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MENSAJE1-HTML
006670        MOVE NOM-TMP-W        TO MENSAJE2-HTML
006680        MOVE "VERIFICAR-TMP"  TO MENSAJE3-HTML
006690        GO TO ENVIAR-ERROR
006700     END-IF. 

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-JSON.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" OR "35"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MENSAJE1-HTML
006670        MOVE NOM-PLANO2-W     TO MENSAJE2-HTML
006680        MOVE "VERIFICAR-TMP"  TO MENSAJE3-HTML
006690        GO TO ENVIAR-ERROR
006700     END-IF.

006720  END DECLARATIVES.
006730
006740 INICIAR-IIS.
006750     MOVE LOW-VALUE TO COBW3.
006760     MOVE FUNCTION ADDR(ISAPI-CTX-CNT) TO COBW3-CONTEXT.
006770     CALL "COBW3_INIT" USING COBW3.
006780
006790 LEER-DATO-HTML.
           INITIALIZE DATO-LLEGADA-W
006800     MOVE "datosh" TO COBW3-SEARCH-DATA.
006810     CALL "COBW3_GET_VALUE" USING COBW3.
006820     MOVE COBW3-GET-DATA    TO DATO-LLEGADA-W.

001855     MOVE SESION-LLEGAD-W   TO LLAVE-SESION-W.
           MOVE FUNCTION CURRENT-DATE TO FECHA-TOTAL.

000797 INICIAR-SESION.
000806     MOVE "D:\WEB\HC-NTAS-EVOL\DATOS\SC-SESION.DAT" TO NOM-SESION-W
000820     MOVE FUNCTION CURRENT-DATE TO FECHA-TOTAL.
000830     ACCEPT HORA-TOTAL FROM TIME.
000810     GO TO VALIDAR-SESION.
000850
000860 FIN-VALIDAR-SESION.
006840
006900 ABRIR-USUARIO.
006910     INITIALIZE OTR-STAT.
006920     MOVE "D:\WEB\HC-NTAS-EVOL\DATOS\SC-ARCHUSU.DAT" TO NOM-USU-W
006930
006940     OPEN INPUT ARCHIVO-USUNET
006950     EVALUATE OTR-STAT
006960       WHEN "00"  CONTINUE
006970       WHEN "35"  OPEN OUTPUT ARCHIVO-USUNET
006980                  INITIALIZE REG-USUNET
006990                  WRITE REG-USUNET
007000                  CLOSE ARCHIVO-USUNET
007010                  MOVE "Validacion de Usuario"       TO MENSAJE1-HTML
007020                  MOVE "Falta configurar usuarios"   TO MENSAJE2-HTML
007030                  MOVE "Sc"                          TO MENSAJE3-HTML
007040                  GO TO ENVIAR-ERROR
007050       WHEN OTHER GO TO CERRAR-SESION
007060     END-EVALUATE.
007070
007080     INITIALIZE LLAVE-USUNET.

007100
007110 LEER-USUARIO.
007120     READ ARCHIVO-USUNET NEXT AT END MOVE 0 TO SW-FIN.
007130
007140     CLOSE ARCHIVO-USUNET.
007200     
007210     IF NOMBRE-USUNET = SPACES
007220     OR NIT-USUNET = ZEROS
007230        MOVE "Validacion de Sesion"        TO MENSAJE1-HTML
007240        MOVE "Falta configurar usuarios"   TO MENSAJE2-HTML
007250        MOVE "Sc"                          TO MENSAJE3-HTML
007260        GO TO ENVIAR-ERROR
007270     END-IF.
007280 
007350

       ASIGNAR-NOMBRES.
           INITIALIZE NOM-USUAR-W NOM-REST-W NOM-TMP-W NOM-PACIE-W NOM-PLANO2-W

           INSPECT IP-DATOS-USUNET REPLACING FIRST "/" BY "\".
           MOVE "\\"  TO NOM-REST-W  NOM-USUAR-W  NOM-PLANO2-W
007150     INSPECT NOM-REST-W  REPLACING FIRST "                    "
007160                                      BY IP-DATOS-USUNET
007170     INSPECT NOM-REST-W  REPLACING FIRST " "
007180                                      BY "\"
007190     INSPECT NOM-REST-W  REPLACING FIRST "                          "
007200                                      BY "NEWCOBOL\DATOS\ARCHREST.SC".


           INSPECT NOM-USUAR-W REPLACING FIRST  "                    "
                                            BY  IP-DATOS-USUNET
           INSPECT NOM-USUAR-W REPLACING FIRST  " "
                                            BY  "\"
           INSPECT NOM-USUAR-W REPLACING FIRST  "                              "
007183                                      BY  DIRECTORIO-USUNET
           INSPECT NOM-USUAR-W REPLACING FIRST  "                "
                                            BY  "\CONTROL\ARCHUSU".

           MOVE NOM-USUAR-W  TO NOM-PACIE-W
           
           INSPECT NOM-PACIE-W  REPLACING FIRST "ARCHUSU     "
                                             BY "SC-PACIE.DAT".


007220     INSPECT NOM-PLANO2-W  REPLACING FIRST "                    "
007230                                        BY IP-DATOS-USUNET
007240     INSPECT NOM-PLANO2-W  REPLACING FIRST " "
007250                                        BY "\"
007260     INSPECT NOM-PLANO2-W  REPLACING FIRST "                                      "
007280                                        BY "NEWCOBOL\DATOS\JSON\VERIFICAR-TMP.JSON".

           MOVE "C:\PROSOFT\TEMP\XXXXXXXX-HCEVO.TMP"   TO NOM-TMP-W

           INSPECT NOM-TMP-W REPLACING FIRST "XXXXXXXX"
                                          BY FECHA-TOTAL.


        ABRIR-USUARIOS.
           OPEN INPUT ARCHIVO-USUARIOS
           READ ARCHIVO-USUARIOS NEXT WITH NO LOCK AT END 
                CLOSE ARCHIVO-USUARIOS
           END-READ.
        
        ABRIR-PLANO.
           OPEN OUTPUT ARCHIVO-JSON.
           OPEN INPUT ARCHIVO-TEMPORAL.


           INITIALIZE CONT-T
           MOVE "{*TEMPORAL*:["   TO DATOS-PLANO2.
           INSPECT DATOS-PLANO2 REPLACING ALL "*" BY CARAC-COMILLA.
           WRITE REG-PLANO2.


       LEER-PLANO.

           READ ARCHIVO-TEMPORAL NEXT WITH NO LOCK AT END GO TO CERRAR-PLANO.

           MOVE LLAVE-TMP      TO LLAVE-TMP-J
           MOVE ESTADO-TMP     TO ESTADO-TMP-J

           INSPECT LIN-01 REPLACING ALL "*" BY CARAC-COMILLA 
           MOVE LIN-01 TO DATOS-PLANO2
           WRITE REG-PLANO2

           PERFORM ESCRIBIR-TABLA VARYING I FROM 1 BY 1
                                            UNTIL I > 35
           INITIALIZE I CONT-T
                      
           MOVE "]},"          TO DATOS-PLANO2
           WRITE REG-PLANO2.


           GO TO LEER-PLANO.

       CERRAR-PLANO.


           MOVE LIN-01 TO DATOS-PLANO2
           WRITE REG-PLANO2 END-WRITE

           MOVE "]}]}" TO DATOS-PLANO2
           WRITE REG-PLANO2 END-WRITE

           CLOSE ARCHIVO-JSON
                 ARCHIVO-TEMPORAL.



010700 PAGINA-CONFIG.
010720     MOVE "datosrecibidos" TO COBW3-CNV-NAME
010730     MOVE 00               TO COBW3-CNV-VALUE
010740     CALL "COBW3_SET_CNV" USING COBW3
010750
010760     MOVE "..\PAGINAS\RECIBIDOS.ASPX" TO SALIDA-HTML  
010770     PERFORM ABRIR-HTML.
007980   
007990 CERRAR-SESION.
008000     CALL "COBW3_FREE" USING COBW3.
008010     MOVE 1 TO PROGRAM-STATUS.
008020     EXIT PROGRAM.


       ESCRIBIR-TABLA.

           IF DATOS-TMP (I) =  SPACES OR LOW-VALUES
              CONTINUE
           ELSE
              ADD 1   TO CONT-T
              IF CONT-T  > 1 
                 MOVE ","  TO COMA-W
              ELSE
                 INITIALIZE   COMA-W
              END-IF

              MOVE "{*RENGXXX*:"  TO NOM-REG-W
              INSPECT NOM-REG-W  REPLACING FIRST "XXX" BY   CONT-T

              MOVE DATOS-TMP (I) TO RENG-DEVO-W
              INSPECT RENG-DEVO-W REPLACING ALL LOW-VALUES BY SPACES
              INSPECT TABLA-DEVO-W REPLACING ALL "*"  BY CARAC-COMILLA

              MOVE TABLA-DEVO-W  TO DATOS-PLANO2
              WRITE REG-PLANO2
           END-IF.




       EDITAR-NUMERO.

           INSPECT EDITADO-W REPLACING FIRST  "ABCDEFGHIJKLMNOPQRSTUVWXYZ"
                                          BY  "                          ".

           MOVE EDITADO-W TO TABLA-COD1
           INITIALIZE TABLA-COD2 SW-ALFA
           MOVE 10    TO LP
           PERFORM MOVER-COD VARYING LN FROM 10 BY -1
                               UNTIL LN < 1 OR LP < 1.

           INSPECT TABLA-COD2 REPLACING ALL " " BY "0".

       MOVER-COD.
           IF COD1-PAC (LN) IS NUMERIC
           OR COD1-PAC (LN) = "-"
              MOVE COD1-PAC (LN)    TO COD2-PAC(LN)
              SUBTRACT 1 FROM LP
           END-IF.

007990
008030
008040 COPY "P:\PROG\PROYECT\FUENTES\SC-WEB.CBL".
0
