004820*=================================================================
004830* GUARDA DATOS DE HISTORIA CLNICA POR PACIENTE.
004840*=================================================================
004850 IDENTIFICATION DIVISION.
004860 PROGRAM-ID. "HttpExtensionProc".
004870 ENVIRONMENT DIVISION.
004880 CONFIGURATION SECTION.
004890 INPUT-OUTPUT SECTION.
004900 FILE-CONTROL.
004910     COPY "P:\PROG\PROYECT\FUENTES\FS-USUNET.CBL".
004920     COPY "P:\PROG\PROYECT\FUENTES\FS-SESION.CBL".

           SELECT ARCHIVO-USUARIOS LOCK MODE IS AUTOMATIC
                  ASSIGN TO NOM-USUAR-W
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC;
                  RECORD KEY IS NOMBRE-USU
                  ALTERNATE RECORD KEY IS CTL-USU     WITH DUPLICATES
                  ALTERNATE RECORD KEY IS CLAVE-USU   WITH DUPLICATES
                  ALTERNATE RECORD KEY IS CLAVE-2-USU WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.


           SELECT HISTORIA-CLINICA LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-HCAPE-W
                  ORGANIZATION INDEXED;
                  ACCESS MODE DYNAMIC;
                  RECORD KEY IS LLAVE-HC
                  ALTERNATE RECORD KEY IS FOLIO-HC WITH DUPLICATES
                  ALTERNATE RECORD KEY IS FECHA-HC WITH DUPLICATES
                  ALTERNATE RECORD KEY IS MED-HC WITH DUPLICATES
                  ALTERNATE RECORD KEY IS ESTADO-HC WITH DUPLICATES
                  FILE STATUS OTR-STAT.

           SELECT HISTORIA-DETALLADA LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-HCDET-W
                  ORGANIZATION INDEXED;
                  ACCESS MODE DYNAMIC;
                  RECORD KEY IS LLAVE-DETHC
                  ALTERNATE RECORD KEY IS LLAVE-FOLIO-DETHC
                  WITH DUPLICATES
                  FILE STATUS OTR-STAT.

           SELECT ARCHIVO-PACIENTES
                  ASSIGN NOM-PACIE-W
                  ORGANIZATION IS INDEXED;
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS COD-PACI
                  ALTERNATE RECORD KEY  DESCRIP-PACI  WITH DUPLICATES
                  ALTERNATE RECORD KEY  EPS-PACI      WITH DUPLICATES
                  ALTERNATE RECORD KEY  ID-COTIZ-PACI WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.

           SELECT EVOLUCION-HISTORIA
                  ASSIGN NOM-HCEVO-W LOCK MODE IS AUTOMATIC
                  ORGANIZATION INDEXED;
                  ACCESS MODE DYNAMIC;
                  RECORD KEY IS LLAVE-EVO
                  ALTERNATE RECORD KEY IS FOLIO-EVO WITH DUPLICATES
                  ALTERNATE RECORD KEY IS FECHA-EVO WITH DUPLICATES
                  ALTERNATE RECORD KEY IS MED-EVO WITH DUPLICATES
                  FILE STATUS OTR-STAT.

           SELECT ARCHIVO-CAMAS-HOSP LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-CAMAS-W
                  ORGANIZATION INDEXED;
                  ACCESS MODE DYNAMIC;
                  RECORD KEY IS COD-CAM
                  ALTERNATE RECORD KEY IS UNSERV-CAM WITH DUPLICATES
                  ALTERNATE RECORD KEY IS SERVHO-CAM WITH DUPLICATES
                  ALTERNATE RECORD KEY IS FACT-CAM WITH DUPLICATES
                  ALTERNATE RECORD KEY IS PACI-CAM WITH DUPLICATES
                  ALTERNATE RECORD KEY IS NOM-PACI-CAM WITH DUPLICATES
                  ALTERNATE RECORD KEY IS FOLIO-CAM WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.

           SELECT ARCHIVO-SISVAN LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-SISVAN-W
                  ORGANIZATION IS INDEXED;
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS COD-SIS
                  ALTERNATE RECORD KEY FICHA-SIS     WITH DUPLICATES
                  ALTERNATE RECORD KEY FECHA-REG-SIS WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.

           SELECT FACTURA-SERVICIOS LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-SALUD
                  ORGANIZATION INDEXED;
                  ACCESS MODE DYNAMIC;
                  RECORD KEY IS LLAVE-FACT
                  ALTERNATE RECORD KEY NRO-FACT   WITH DUPLICATES
                  ALTERNATE RECORD KEY FECHA-FACT WITH DUPLICATES
                  ALTERNATE RECORD KEY CTA-FACT   WITH DUPLICATES
                  ALTERNATE RECORD KEY NIT-FACT   WITH DUPLICATES
                  ALTERNATE RECORD KEY ID-HISTORIA-FACT WITH DUPLICATES
                  ALTERNATE RECORD KEY FECHA-ING-ESTAD WITH DUPLICATES
                  ALTERNATE RECORD KEY FECHA-SAL-ESTAD WITH DUPLICATES
                  ALTERNATE RECORD KEY FECHA-ENTR-RX   WITH DUPLICATES				  
                  FILE STATUS IS OTR-STAT.

           SELECT ARCHIVO-CITAS LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-CITAS-W
                  ORGANIZATION INDEXED;
                  ACCESS MODE  DYNAMIC;
                  RECORD KEY LLAVE-CIT
                  ALTERNATE RECORD KEY IS FECHA-CIT WITH DUPLICATES
                  ALTERNATE RECORD KEY IS MEDICO-CIT WITH DUPLICATES
                  ALTERNATE RECORD KEY IS PACI-CIT         WITH DUPLICATES
                  ALTERNATE RECORD KEY IS LLAVE-ALT-CIT    WITH DUPLICATES
                  ALTERNATE RECORD KEY IS ATIENDE-PROF-CIT WITH DUPLICATES				  
                  ALTERNATE RECORD KEY IS FECHA-FACTU-CIT  WITH DUPLICATES
                  ALTERNATE RECORD KEY IS FECHA-SOLIC-CIT  WITH DUPLICATES				  
                  FILE STATUS IS OTR-STAT.

           SELECT ARCHIVO-UNID-SERV   LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-UNSERV-W
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS CODIGO-UNID-SERV
                   FILE STATUS IS OTR-STAT.

           SELECT ARCHIVO-PROFESIONALES LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-PROF-W
                  ORGANIZATION IS INDEXED;
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS COD-PROF
                  ALTERNATE RECORD KEY DESCRIP-PROF WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.


           SELECT ARCHIVO-TERCEROS  LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-TER-W
                  ORGANIZATION IS INDEXED;
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS COD-TERCERO
                  ALTERNATE RECORD KEY DESCRIP-TER WITH DUPLICATES
                  ALTERNATE RECORD KEY ACT-TER     WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.


	   SELECT ARCHIVO-ESPECIALIDAD LOCK MODE IS AUTOMATIC
	          ASSIGN NOM-ESPEC-W
                  ORGANIZATION IS INDEXED;
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS COD-ESP
                  ALTERNATE RECORD KEY IS NOMBRE-ESP WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.


           SELECT ARCHIVO-ENTIDADES
                  ASSIGN NOM-ENTID-W
                  ORGANIZATION IS INDEXED;
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS COD-ENT
                  ALTERNATE RECORD KEY IS NOMBRE-ENT WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.

           SELECT ARCHIVO-OCUPACIONES
                  ASSIGN NOM-OCUPA-W
                  ORGANIZATION IS INDEXED;
	          ACCESS MODE  IS DYNAMIC
	          RECORD KEY   IS COD-OCU
	          ALTERNATE RECORD KEY IS
	          NOMBRE-OCU WITH DUPLICATES
	          FILE STATUS OTR-STAT.

           SELECT ARCHIVO-PLANO
                  ASSIGN NOM-PLANO-W
                  ORGANIZATION IS LINE SEQUENTIAL
                  FILE STATUS IS OTR-STAT.

005070
005080 DATA DIVISION.
005090 FILE SECTION.
       COPY "P:\PROG\PROYECT\FUENTES\FD-USUNET.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-SESION.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-USUAR.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-HCAPER17.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-HCDETAL17.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-PACIE.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-HCEVO17.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-CAMAS17.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-SISVA.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-SALUD.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-CITAS.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-UNSER.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-PROFE.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-TERCE.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-ESPEC.CBL".
       
       COPY "P:\PROG\PROYECT\FUENTES\FD-ENTID.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-OCUPA.CBL".

       FD  ARCHIVO-PLANO
           LABEL RECORD STANDARD.
       01  REG-PLANO.
           02 DATOS-PLANO   PIC X(18000).

005190 WORKING-STORAGE SECTION.
005200 COPY "P:\PROG\PROYECT\FUENTES\COBW3.CBL".
005210 COPY "P:\PROG\PROYECT\FUENTES\WEB-CARAC.CBL".
005210 COPY "P:\PROG\PROYECT\FUENTES\WS-8001.CBL".
005210 COPY "P:\PROG\PROYECT\FUENTES\WS-8031.CBL".
005220 
       77 NOM-USUAR-W                PIC X(70).
       77 NOM-HCAPE-W                PIC X(70).
       77 NOM-HCDET-W                PIC X(70).
       77 NOM-PACIE-W                PIC X(70).
       77 NOM-HCEVO-W                PIC X(70).
       77 NOM-UNSERV-W               PIC X(70).
       77 NOM-CAMAS-W                PIC X(70).
       77 NOM-SISVAN-W               PIC X(70).
       77 NOM-CITAS-W                PIC X(70).
       77 NOM-PROF-W                 PIC X(70).
       77 NOM-TER-W                  PIC X(70).
       77 NOM-ENTID-W                PIC X(70).
       77 NOM-ESPEC-W                PIC X(70).
       77 NOM-OCUPA-W                PIC X(70).
       77 NOM-PLANO-W                PIC X(90).
       77 CONT                       PIC 99.
       77 OPER-W                     PIC X(4).
       77 SUCURSAL-W                 PIC X.
       77 SW-PYP                     PIC 999.
       77 SW-BLANCA                  PIC 999.
       77 SW-OPEN                    PIC X.

       01 LINEA-DATOS-HC-W.
          02 ESCALA-W                PIC X(15).
          02 LINEA-HC-W              PIC X(15000).

       01 ULT-FECHA-NUM.
          02 ULT-ANO-NUM             PIC 99.
          02 ULT-MES-NUM             PIC 99.
          02 ULT-DIA-NUM             PIC 99.

       01 PESO-W.
          02 PESO1-W                 PIC 9(5).
          02 PESO2-W                 PIC 9.

       01 IMC-CORP-W.
          02 IMC-CORP1-W             PIC 99.
          02 IMC-CORP2-W             PIC 99.

       01 SUP-CORP-W.
          02 SUP-CORP1-W             PIC 99.
          02 SUP-CORP2-W             PIC 99.

       01 TEMP-W.
          02 TEMP1-W                 PIC 99.
          02 TEMP2-W                 PIC 99.

       01 PER-CEF-W.
          02 PER-CEF1-W              PIC 9(3).
          02 PER-CEF2-W              PIC 9.

       01 PESO-ANT1-W.
          02 PESO-ANT1-W1            PIC 9(5).
          02 PESO-ANT1-W2            PIC 9.

       01 PESO-ANT2-W.
          02 PESO-ANT2-W1            PIC 9(5).
          02 PESO-ANT2-W2            PIC 9.

       01 PER-ABDO-W.
          02 PER-ABDO1-W             PIC 9(3).
          02 PER-ABDO2-W             PIC 9.

       01 ALT-UTER-W.
          02 ALT-UTER1-W             PIC 99.
          02 ALT-UTERW-W             PIC 9.

       01 PESO-PREV-W.
          02 PESO-PREV1-W            PIC 9(3).
          02 PESO-PREV3-W            PIC 9.

       01 CREATININA-W.
          02 CREATININA1-W           PIC 9.
          02 CREATININA2-W           PIC 9.

       01 PER-TORA-W.
          02 PER-TORA1-W             PIC 9(3).
          02 PER-TORA2-W             PIC 9.

       01 PER-MUNE-W.
          02 PER-MUNE1-W             PIC 99.
          02 PER-MUNE2-W             PIC 9.

       01 PER-BRAQ-W.
          02 PER-BRAQ1-W             PIC 99.
          02 PER-BRAQ2-W             PIC 9.

       01 HEMO-GLICOSILADA-W.
          02 HEMO-GLICOSILADA1-W     PIC 99.
          02 HEMO-GLICOSILADA2-W     PIC 99.

       01 MICROALBUMINURIA-W.
          02 MICROALBUMINURIA1-W     PIC 99.
          02 MICROALBUMINURIA2-W     PIC 99.

       01 DIAGN-W                    PIC X(60).

       01 FECHA-SIG-ACT-W.
          02 SIG-ACT-W         PIC 99.
          02 FECHA-ACT-W.
             03 ANO-ACT-W      PIC 99.
             03 MES-ACT-W      PIC 99.
             03 DIA-ACT-W      PIC 99.

       01 LINEA-LLEGAD-W             PIC X(200).
       01 LINEA-TTO-SIFI-W           PIC X(450).
       01 LINEA-SEGUI-SEROL-W        PIC X(170).

       01  DATO-LLEGADA-W.
           02 SESION-LLEGAD-W.
              03 ID-LLEGAD-W         PIC X(15).
              03 FECHA-LLEGAD-W      PIC X(8).
              03 HORA-LLEGAD-W       PIC X(6).
           02 DIRECTORIO-W           PIC X(30).
           02 MES-TRABAJO-W          PIC X(10).
           02 LLAVE-HC-W.
              05 ID-HC-W             PIC X(15).
              05 FOLIO-HC-W.
                 07 FOLIO-SUC-HC-W   PIC XX.
                 07 FOLIO-NRO-HC-W   PIC 9(6).


       01 DATOS-ENVIO.
          02 DAT0-ENV           PIC XX.
          02 FILLER             PIC X VALUE "|".
          02 DAT1-ENV           PIC X.
          02 FILLER             PIC X VALUE "|".
          02 DAT2-ENV           PIC X.

006310 LINKAGE SECTION.
006320 COPY "P:\PROG\PROYECT\FUENTES\ISAPICTX.CBL".
006330 PROCEDURE DIVISION WITH stdcall LINKAGE USING ISAPI-CTX-CNT.
006340
006350 DECLARATIVES.
006360 I-O-TEST SECTION.
006370     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUNET.         
006380 ESCR-EXCEPTIONES.
006390     IF OTR-STAT = "00"
006400        CONTINUE 
006410     ELSE
006420        MOVE OTR-STAT         TO MSJ1-HTML
006430        MOVE NOM-USU-W        TO MSJ2-HTML
006440        MOVE "HC811"          TO MSJ3-HTML
006450        GO TO ENVIAR2-ERROR
006460     END-IF.
006470
006480 I-O-TEST SECTION.
006490     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SESION.
006500 ESCR-EXCEPTIONES.
006510     IF OTR-STAT = "00" 
006520        CONTINUE 
006530     ELSE
006540        MOVE OTR-STAT         TO MSJ1-HTML
006550        MOVE NOM-SESION-W     TO MSJ2-HTML
006560        MOVE "HC811"          TO MSJ3-HTML
006570        GO TO ENVIAR2-ERROR
006580     END-IF.
006590  

006480 I-O-TEST SECTION.
006490     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUARIOS.
006500 ESCR-EXCEPTIONES.
006510     IF OTR-STAT = "00" 
006520        CONTINUE 
006530     ELSE
006540        MOVE OTR-STAT         TO MSJ1-HTML
006550        MOVE NOM-USUAR-W      TO MSJ2-HTML
006560        MOVE "HC811"          TO MSJ3-HTML
006570        GO TO ENVIAR2-ERROR
006580     END-IF.
006590  

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON HISTORIA-CLINICA.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-HCAPE-W      TO MSJ2-HTML
006680        MOVE "HC811"          TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR  
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON HISTORIA-DETALLADA.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-HCDET-W      TO MSJ2-HTML
006680        MOVE "HC811"          TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR  
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-PACIENTES.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-PACIE-W      TO MSJ2-HTML
006680        MOVE "HC811"          TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON EVOLUCION-HISTORIA.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-HCEVO-W      TO MSJ2-HTML
006680        MOVE "HC811"          TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-CAMAS-HOSP.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-CAMAS-W      TO MSJ2-HTML
006680        MOVE "HC811"          TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SISVAN.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-SISVAN-W     TO MSJ2-HTML
006680        MOVE "HC811"          TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON FACTURA-SERVICIOS.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-SALUD        TO MSJ2-HTML
006680        MOVE "HC811"          TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.


006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-CITAS.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-CITAS-W      TO MSJ2-HTML
006680        MOVE "HC811"          TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

       I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-UNID-SERV.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-UNSERV-W     TO MSJ2-HTML
006680        MOVE "HC811"          TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-PROFESIONALES.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-PROF-W       TO MSJ2-HTML
006680        MOVE "HC811"          TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-TERCEROS.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-TER-W        TO MSJ2-HTML
006680        MOVE "HC811"          TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-ESPECIALIDAD.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-ESPEC-W      TO MSJ2-HTML
006680        MOVE "HC811"          TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-ENTIDADES.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-ENTID-W      TO MSJ2-HTML
006680        MOVE "HC002"          TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

       I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-OCUPACIONES.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" OR "35"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-OCUPA-W      TO MSJ2-HTML
006680        MOVE "HC002"          TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

       I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-PLANO.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE                                                                                      
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-PLANO-W      TO MSJ2-HTML
006680        MOVE "HC002"          TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.
006710
006720  END DECLARATIVES.
006730
006740 INICIAR-IIS.
006750     MOVE LOW-VALUE TO COBW3.
006760     MOVE FUNCTION ADDR(ISAPI-CTX-CNT) TO COBW3-CONTEXT.
006770     CALL "COBW3_INIT" USING COBW3.
006780
006790 LEER-DATO-HTML.
006800     MOVE "datosh" TO COBW3-SEARCH-DATA.
006810     CALL "COBW3_GET_VALUE" USING COBW3.
006820     MOVE COBW3-GET-DATA    TO LINEA-LLEGAD-W.

           UNSTRING LINEA-LLEGAD-W DELIMITED BY "|"
              INTO SESION-LLEGAD-W, DIRECTORIO-W, MES-TRABAJO-W, LLAVE-HC-W
           END-UNSTRING.

001855     MOVE SESION-LLEGAD-W    TO LLAVE-SESION-W.
           MOVE FUNCTION CURRENT-DATE TO FECHA-TOTAL.

000797 INICIAR-SESION.
000806     MOVE "D:\PROGELECT\HICLIN\DATOS\SC-SESION.DAT" TO NOM-SESION-W
000820     MOVE FUNCTION CURRENT-DATE TO FECHA-TOTAL.
000830     ACCEPT HORA-TOTAL FROM TIME.
000810     GO TO VALIDAR-SESION.
000850
000860 FIN-VALIDAR-SESION.
006840
006900 ABRIR-USUARIO.
006910     INITIALIZE OTR-STAT.
006920     MOVE "D:\PROGELECT\HICLIN\DATOS\SC-ARCHUSU.DAT" TO NOM-USU-W
006930
006940     OPEN INPUT ARCHIVO-USUNET
006950     EVALUATE OTR-STAT
006960       WHEN "00"  CONTINUE
006970       WHEN "35"  OPEN OUTPUT ARCHIVO-USUNET
006980                  INITIALIZE REG-USUNET
006990                  WRITE REG-USUNET
007000                  CLOSE ARCHIVO-USUNET
007010                  MOVE "Validacion de Usuario"       TO MSJ1-HTML
007020                  MOVE "Falta configurar usuarios"   TO MSJ2-HTML
007030                  MOVE "Sc"                          TO MSJ3-HTML
007040                  GO TO ENVIAR2-ERROR
007050       WHEN OTHER GO TO CERRAR-SESION
007060     END-EVALUATE.
007070
007080     INITIALIZE LLAVE-USUNET.
007100
007110 LEER-USUARIO.
007120     READ ARCHIVO-USUNET NEXT AT END MOVE 0 TO SW-FIN.
007130
007140     CLOSE ARCHIVO-USUNET.
007200     
007210     IF NOMBRE-USUNET = SPACES
007220     OR NIT-USUNET = ZEROS
007230        MOVE "Validacion de Sesion"        TO MSJ1-HTML
007240        MOVE "Falta configurar usuarios"   TO MSJ2-HTML
007250        MOVE "Sc"                          TO MSJ3-HTML
007260        GO TO ENVIAR2-ERROR
007270     END-IF.
007280 
007350
       ASIGNAR-NOMBRES.
           ACCEPT ULT-FECHA-NUM FROM DATE.
           MOVE ULT-FECHA-NUM TO FECHA-ACT-W
           INITIALIZE NOM-USUAR-W NOM-PLANO-W
           INSPECT IP-DATOS-USUNET REPLACING FIRST "/" BY "\"
           MOVE "\\" TO NOM-USUAR-W NOM-ENTID-W

           INSPECT NOM-USUAR-W REPLACING FIRST "                    "
                                            BY IP-DATOS-USUNET

           INSPECT NOM-USUAR-W REPLACING FIRST " "
                                            BY "\"

           INSPECT NOM-USUAR-W REPLACING FIRST "                              "
                                            BY DIRECTORIO-W

           MOVE NOM-USUAR-W TO NOM-HCAPE-W NOM-HCDET-W NOM-PACIE-W NOM-UNSERV-W NOM-PROF-W 
                               NOM-TER-W 

           INSPECT NOM-USUAR-W REPLACING FIRST  "                       "
                                            BY  "\CONTROL\SC-ARCHUSU.DAT".

           INSPECT NOM-PACIE-W REPLACING FIRST  "                     "
                                           BY   "\CONTROL\SC-PACIE.DAT".

           INSPECT NOM-UNSERV-W REPLACING FIRST "                     "
                                             BY "\CONTROL\SC-UNSER.DAT".

           INSPECT NOM-PROF-W   REPLACING FIRST "                        "
                                             BY "\CONTROL\SC-ARCHPROF.DAT".

           INSPECT NOM-TER-W    REPLACING FIRST "                       "
                                             BY "\CONTROL\SC-ARCHTER.DAT".

           INSPECT NOM-ENTID-W  REPLACING FIRST "                    "
                                             BY IP-DATOS-USUNET

           INSPECT NOM-ENTID-W REPLACING FIRST " "
                                            BY "\"

           MOVE NOM-ENTID-W TO NOM-OCUPA-W NOM-HCAPE-W NOM-HCDET-W NOM-ESPEC-W NOM-HCEVO-W NOM-CAMAS-W 
                               NOM-SISVAN-W NOM-SALUD NOM-CITAS-W

           INSPECT NOM-ENTID-W REPLACING FIRST "                         "
                                            BY "PROG\DATOS\SC-ARCHENT.DAT".

           INSPECT NOM-ESPEC-W REPLACING FIRST "                         "
                                            BY "PROG\DATOS\SC-ARCHESP.DAT".

           INSPECT NOM-OCUPA-W REPLACING FIRST "                         "
                                            BY "PROG\DATOS\SC-ARCHOCU.DAT".

           INSPECT NOM-HCAPE-W REPLACING FIRST "                           "
                                            BY "PROG\HC\DATOS\SC-HCAPER.S17".

           INSPECT NOM-HCDET-W REPLACING FIRST "                             "
                                            BY "PROG\HC\DATOS\SC-HCDETA-X.S17".

           INSPECT NOM-HCEVO-W REPLACING FIRST "                            "
                                            BY "PROG\HC\DATOS\SC-HCEVOX1.S17"

           INSPECT NOM-HCEVO-W REPLACING FIRST "X1" BY ULT-ANO-NUM.


           INSPECT NOM-CAMAS-W REPLACING FIRST "                          "
                                            BY "PROG\HC\DATOS\SC-CAMAS.S17".

           INSPECT NOM-SISVAN-W REPLACING FIRST "                           "
                                             BY "PROG\HC\DATOS\SC-SISVAN.DAT".

           MOVE "C:\PROSOFT\TEMP\HCAPER17-XXXXXXXXXXXXXXXXXXXXXXXXXXXXX.TXT"  TO NOM-PLANO-W

           INSPECT NOM-PLANO-W REPLACING FIRST "XXXXXXXXXXXXXXXXXXXXXXXXXXXXX"
                                            BY SESION-LLEGAD-W.


       LEER-USUARIO.

           OPEN INPUT ARCHIVO-USUARIOS
           READ ARCHIVO-USUARIOS NEXT WITH NO LOCK AT END 
                CLOSE ARCHIVO-USUARIOS
           END-READ.

       LEER-PACIENTE.
           OPEN INPUT ARCHIVO-PACIENTES.
           MOVE LLAVE-HC-W    TO  COD-PACI.
           READ ARCHIVO-PACIENTES WITH NO LOCK
                INVALID KEY
                        MOVE "99"         TO MSJ1-HTML
                        MOVE "Paciente no existe" To MSJ2-HTML
                        MOVE "HC-01"      TO MSJ3-HTML
                        GO TO ENVIAR2-ERROR
           END-READ.
           CLOSE ARCHIVO-PACIENTES.
           OPEN INPUT ARCHIVO-PLANO.

       ABRIR-HISTORIA-CLINICA.
           OPEN I-O HISTORIA-CLINICA.

           MOVE LLAVE-HC-W   TO LLAVE-HC
           READ HISTORIA-CLINICA WITH NO LOCK
                INVALID KEY
                        INITIALIZE DATOS-HC
                        WRITE REG-HC END-WRITE
           END-READ.

       LEER-PLANO.
           READ ARCHIVO-PLANO NEXT WITH NO LOCK AT END GO TO CERRAR-PLANO.

           IF DATOS-PLANO = SPACES 
              CONTINUE
           ELSE
               MOVE DATOS-PLANO    TO LINEA-DATOS-HC-W
               EVALUATE ESCALA-W
                   WHEN "DATOS-P"
                        UNSTRING LINEA-HC-W DELIMITED BY "|"
                                 INTO FECHA-HC, HORA-HC, SERV-HC, OPER-ELAB-HC, MED-HC, ESQUEMA-HC, EDAD-HC, EDAD-DIAS-HC, NIV-ESTUD-HC, ACOMPA-HC,
                                      ID-ACOMPA-HC, HORA-TRANS-HC, EMBRIAGUEZ-TRANS-HC, PLANIFIC-HC, PROCEDEN-HC
                        END-UNSTRING
                   WHEN "MOTIVO-PRORROGA"
                        UNSTRING LINEA-HC-W DELIMITED BY "|"
                                 INTO MOTIV-HC, PRORROGA-INC-HC
                        END-UNSTRING
                   WHEN "SIGNOS"
                        UNSTRING LINEA-HC-W DELIMITED BY "|"
                                 INTO UND-PESO-HC, PESO-W, TALLA-HC, IMC-CORP-W, SUP-CORP-W, TEMP-W, FCARD-HC, FRESP-HC, TENS1-HC, TENS2-HC, TENS-MEDIA-HC, OXIMETRIA-HC, PVC-HC, 
                                      GLASG-HC, PER-CEF-W, SINTOM-RESPI-HC, PER-ABDO-W, TANNER-PUBICO-HC, TANNER-GENIT-HC, ALT-UTER-W, EST-NUTRI-HC, PESO-PREV-W, CREATININA-W, PER-TORA-W, 
                                      PER-MUNE-W, SINTOM-PIEL-HC, VICTI-MALTRATO-HC, VICTI-VIOLENCIA-HC, ENFER-MENTAL-HC, ENFER-ITS-HC, CANCER-SENO-HC, CANCER-CERVIS-HC, PER-BRAQ-W, 
                                      HEMO-GLICOSILADA-HC, HEMO-GLICO-FECHA-HC, MICROALBUMINURIA-W, FECHA-MICROALBUMINURIA-HC, RIESGO-CARDIO-HC
                        END-UNSTRING

                        MOVE PESO-W        TO PESO-HC
                        MOVE IMC-CORP-W    TO IMC-CORP-HC
                        MOVE SUP-CORP-W    TO SUP-CORP-HC
                        MOVE TEMP-W        TO TEMP-HC
                        MOVE PER-CEF-W     TO PER-CEF-HC
                        MOVE PER-ABDO-W    TO PER-ABDO-HC
                        MOVE ALT-UTER-W    TO ALT-UTER-HC
                        MOVE PESO-PREV-W   TO PESO-PREV-HC
                        MOVE CREATININA-W  TO CREATININA-HC
                        MOVE PER-TORA-W    TO PER-TORA-HC
                        MOVE PER-MUNE-W    TO PER-MUNE-HC
                        MOVE PER-BRAQ-W    TO PER-BRAQ-HC
                        MOVE HEMO-GLICOSILADA-W TO HEMO-GLICOSILADA-HC
                        MOVE MICROALBUMINURIA-W TO MICROALBUMINURIA-HC
                   WHEN "SIFILIS"
                        UNSTRING LINEA-HC-W DELIMITED BY "|"
                                 INTO LINEA-TTO-SIFI-W, LINEA-SEGUI-SEROL-W, NECE-RETTO-SIFI-HC, FECHA-RETTO-SIFI-HC, MEDICAMENTO-RETTO-HC, DOSIS-RETTO-HC, 
                                      PROFE-APLICO-RETTO-HC, CUANTOS-DIAS-RETTO-HC, DX-CONTACTO-HC, TTO-CONTACTO-HC, REMITIO-CONTACTO-HC
                        END-UNSTRING

                        UNSTRING LINEA-TTO-SIFI-W DELIMITED BY ";"
                                 INTO FECHA-TTO-SIFI-HC (1), MEDICAMENTO-SIFI-HC (1), DOSIS-SIFI-HC (1), PROFE-APLICO-SIFI-HC (1), FECHA-TTO-SIFI-HC (2), MEDICAMENTO-SIFI-HC (2), 
                                      DOSIS-SIFI-HC (2), PROFE-APLICO-SIFI-HC (2), FECHA-TTO-SIFI-HC (3), MEDICAMENTO-SIFI-HC (3), DOSIS-SIFI-HC (3), PROFE-APLICO-SIFI-HC (3)
                        END-UNSTRING

                        UNSTRING LINEA-SEGUI-SEROL-W DELIMITED BY ";"
                                 INTO TIPO-SEROL-HC (1), FECHA-SEROL-HC (1), RESUL-SEROL-HC (1), TIPO-SEROL-HC (2), FECHA-SEROL-HC (2), RESUL-SEROL-HC (2),
                                      TIPO-SEROL-HC (3), FECHA-SEROL-HC (3), RESUL-SEROL-HC (3), TIPO-SEROL-HC (4), FECHA-SEROL-HC (4), RESUL-SEROL-HC (4)
                        END-UNSTRING

                   WHEN "RIPS"
                        UNSTRING LINEA-HC-W DELIMITED BY "|"
                                 INTO ATIENDE-HC, TRIAGE-HC, CAUSA-HC, FINALID-HC, EMBARAZO-HC, ESTADO-SAL-HC, REMITIDO-HC, NIVEL-REMIT-HC, OBSERV-HC,
                                      CRONICO-HC, 1RA-VEZ-HC, NRO-CONTR-HC, TIPO-DIAG-HC, DIAGN-W
                        END-UNSTRING

                        UNSTRING DIAGN-W DELIMITED BY ";"
                                 INTO COD-DIAGN-HC (1), COD-DIAGN-HC (2), COD-DIAGN-HC (3), COD-DIAGN-HC (4), COD-DIAGN-HC (5), 
                                      COD-DIAGN-HC (6), COD-DIAGN-HC (7), COD-DIAGN-HC (8), COD-DIAGN-HC (9), COD-DIAGN-HC (10)
                        END-UNSTRING
                   WHEN "CIERRE"
                        UNSTRING LINEA-HC-W DELIMITED BY "|"
                                 INTO CLASE-HC, ESTADO-HC, TEMPORAL-HC, PREFIJO-HC, UNSERV-HC, DIAG-MUER-HC, PACIENTE-CRONIC-HC, FECHA-MI-HC, FECHA-ENDOCRI-HC, FECHA-CARDIO-HC, FECHA-OFTAMOL-HC,
                                      FECHA-NEFRO-HC, FECHA-PSICOL-HC, FECHA-NUTRI-HC, FECHA-TRABSOC-HC, RESUL-LABORAT-HC, FECHA-INI-TTO-HC, FECHA-FIN-TTO-HC, CTL-MAL-3DIA-HC, CTL-MAL-7DIA-HC,
                                      CTL-MAL-14DIA-HC, CTL-LEIS-45DIAS-HC, CTL-LEIS-6MESES-HC
                        END-UNSTRING

                   WHEN "CITOLOGIA"
                         UNSTRING LINEA-HC-W DELIMITED BY "|"
                                  INTO COLPOSCOPIA-HC, FECHA-COLPOSCOPIA-HC, BIOPSIA-HC, FECHA-BIOPSIA-HC, FECHA-PATOLOGIA-HC, DIAGN-CITOLOGIA-HC, VALORACION-MEDI-HC,
                                       FECHA-VALORACION-MEDI-HC, VALORACION-GINE-HC, FECHA-VALORACION-GINE-HC, CONTROL-CITOL-HC, FECHA-CONTROL-CITOL-HC, FECHA-CANCER-CUELLO-HC
                         END-UNSTRING

                   WHEN "VIOLENCIA"
                        UNSTRING LINEA-HC-W DELIMITED BY "|"
                                 INTO ORIENTACION-SEX-HC, DISCAPACIDAD-HC, VULNERABILIDAD-HC, RIESGO-PSICOS-HC, ACCIONES-REALI-HC, ACCIONES-REALI-HC, TIPO-VIOLENCIA-HC, PENETRACION-ANAL-HC, DILIGENCIA-VIOLE-HC,
                                      FECHA-REM-PSIQUIATRIA-HC, FECHA-ATE-MEDICGRAL-HC, TRABAJO-SOCIAL-HC, FECHA-ATE-PSICOLOGIA-HC, PSICOTERAPIA-INDIVIDUAL-HC, PSICOTERAPIA-IND-EJECU-HC, PSICOTERAPIA-FAMILIAR-HC,
                                      PSICOTERAPIA-FAM-EJECU-HC, FECHA-NOTIFICACION-HC, PREVENCION-ITS-VSX-HC, ANTICONCEPCION-EMER-HC, TIPO-METODO-HC, ASESORIA-CONSEJERIA-HC, CONSEJERIA-IVE-HC, RUTA-PROTECCION-HC,
                                      RUTA-JUSTICIA-HC, FECHA-SEGUI-RES459-SEM2-HC, FECHA-SEGUI-RES459-SEM4-HC, FECHA-SEGUI-RES459-3MES-HC, FECHA-SEGUI-RES459-6MES-HC, FECHA-SEGUI-RES459-1ANO-HC, 
                                      SEGUIMIENTO-MENOR-HC, SEGUIMIENTO-MUJER-HC, FECHA-CIERRE-RES459-HC, CAPTACION-POBLACION-HC, OBSERVACIONES-RES459-HC
                        END-UNSTRING

                   WHEN "TRASTORNO-MENT"
                        UNSTRING LINEA-HC-W DELIMITED BY "|"
                                 INTO ORIENTACION-SEX-MENT-HC, DISCAPACIDAD-MENT-HC, VULNERABILIDAD-MENT-HC, TIPO-EVENTO-MENT-HC, RECAIDAS-MENT-HC, RIESGO-PSICOS-MENT-HC, ACCIONES-REALI-MENT-HC, MEDICINA-GRAL-MENT-HC,
                                      PSICOLOGIA-MENT-HC, PSICOTE-IND-MENT-HC, PSICOTE-IND-EJEC-MENT-HC, PSICOTE-FAM-MENT-HC, PSICOTE-FAM-EJEC-MENT-HC, FECHA-REMISION-PSIQUI-HC, FECHA-NOTIFICA-OBLIG-HC, 
                                      FAMILIAR-CUIDA-MENT-HC, TAMIZAJES-MENT-HC, MANEJO-TAMIZAJE-MENT-HC, CAPTACION-MENT-HC, CONSUMO-SPA-MENT-HC, CANALIZA-DISPOS-MENT-HC, ACCIONES-SEGUI-MENT-HC, ADHERENCIA-TRAT-MENT-HC,
                                      SEGUI-CONTRA-MENT-HC, FECHA-CIERRE-CASO-HC, EVALUACION-MHGAP-HC, PRONOSTICO-TERA-MENT-HC, OBSERVACIONES-MENT-HC
                        END-UNSTRING

                   WHEN "MULTIDROGORESISTENTE" 
                        UNSTRING LINEA-HC-W DELIMITED BY "|"
                                 INTO MULTIDROGORESIS-HC, CUAL-MULTIDROGORESIS-HC
                        END-UNSTRING
                   WHEN "EXAMEN-VISUAL"
                        UNSTRING LINEA-HC-W DELIMITED BY "|"
                                 INTO AGUD-VISUAL-OI-1-HC, AGUD-VISUAL-OI-2-HC, AGUD-VISUAL-OD-1-HC, AGUD-VISUAL-OD-2-HC, ESTRUCTURAS-OCULARES-OI-HC, ESTRUCTURAS-OCULARES-OD-HC
                        END-UNSTRING

               END-EVALUATE
           END-IF

           GO TO LEER-PLANO.
       CERRAR-PLANO.
           CLOSE ARCHIVO-PLANO.

       BUSCAR-HISTORIAS.

           MOVE "N"     TO DAT1-ENV
           MOVE "N"     TO DAT2-ENV

           IF  (SERV-HC > 02 AND SERV-HC IS NOT = 08) OR  (SERV-HC = 01 AND OBSERV-HC = "S")
           OR  (SERV-HC = 01 AND ESTADO-SAL-HC = 3) OR  (SERV-HC = 01 AND ESTADO-SAL-HC = 4)
           OR  (SERV-HC = 02 AND OBSERV-HC = "S") OR  (SERV-HC = 02 AND ESTADO-SAL-HC = 4)
               MOVE 1 TO ESTADO-HC
           ELSE
              IF NIT-USU = 845000038
                 IF (SERV-HC = 02) AND ESTADO-SAL-HC = 4
                    MOVE 1 TO ESTADO-HC
                 ELSE
                    MOVE 2          TO ESTADO-HC
                    MOVE FECHA-HC   TO EGRESO-HC
                    ACCEPT HORA-EGRES-HC FROM TIME
                 END-IF
              ELSE
                 MOVE 2          TO ESTADO-HC
                 MOVE FECHA-HC   TO EGRESO-HC
                 ACCEPT HORA-EGRES-HC FROM TIME
              END-IF
           END-IF.

           IF ESTADO-HC = 2

              IF HAB-HC IS NOT = SPACES AND HAB-HC IS NOT = "SIN"
                 MOVE "S"    TO DAT1-ENV
              END-IF

           END-IF.

           MOVE 0 TO TEMPORAL-HC CLASE-HC
           REWRITE REG-HC END-REWRITE

           IF  UNID-EDAD-HC = "A" AND VLR-EDAD-HC > 18
                CONTINUE
           ELSE
              IF UNSERV-HC = 08
                 MOVE "S"    TO DAT2-ENV
              END-IF
           END-IF.

           MOVE 00     TO DAT0-ENV.

010700 PAGINA-CONFIG.

010720     MOVE "datosrecibidos"  TO COBW3-CNV-NAME
010730     MOVE  DATOS-ENVIO      TO COBW3-CNV-VALUE
010740     CALL "COBW3_SET_CNV"   USING COBW3
010750
010760     MOVE "..\PAGINAS\RECIBIDOS.ASPX" TO SALIDA-HTML  
010770     PERFORM ABRIR-HTML.
007980   
007990 CERRAR-SESION.
008000     CALL "COBW3_FREE" USING COBW3.
008010     MOVE 1 TO PROGRAM-STATUS.
008020     EXIT PROGRAM.

008040 COPY "P:\PROG\PROYECT\FUENTES\SC-WEB.CBL".
