004820*=================================================================
      * HISTORIAS CLINICAS - BUSCAR RESULTADOS SIN INTERPRETAR
004840*=================================================================
004850 IDENTIFICATION DIVISION.
004860 PROGRAM-ID. "HttpExtensionProc".
004870 ENVIRONMENT DIVISION.
004880 CONFIGURATION SECTION.
004890 INPUT-OUTPUT SECTION.
004900 
       FILE-CONTROL.
004910 COPY "P:\PROG\PROYECT\FUENTES\FS-USUNET.CBL".
004920 COPY "P:\PROG\PROYECT\FUENTES\FS-SESION.CBL".

           SELECT ARCHIVO-USUARIOS LOCK MODE IS AUTOMATIC
                  ASSIGN TO NOM-USUAR-LNK
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC;
                  RECORD KEY IS NOMBRE-USU
                  ALTERNATE RECORD KEY IS CTL-USU     WITH DUPLICATES
                  ALTERNATE RECORD KEY IS CLAVE-USU   WITH DUPLICATES
                  ALTERNATE RECORD KEY IS CLAVE-2-USU WITH DUPLICATES
                  FILE STATUS OTR-STAT.

            SELECT EVOLUCION-HISTORIA LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-HCEVO-LNK
                  ORGANIZATION INDEXED;
                  ACCESS MODE DYNAMIC;
                  RECORD KEY IS LLAVE-EVO
                  ALTERNATE RECORD KEY IS FOLIO-EVO WITH DUPLICATES
                  ALTERNATE RECORD KEY IS FECHA-EVO WITH DUPLICATES
                  ALTERNATE RECORD KEY IS MED-EVO   WITH DUPLICATES
                  FILE STATUS OTR-STAT.

005080 DATA DIVISION.
005090 FILE SECTION.
       COPY "P:\PROG\PROYECT\FUENTES\FD-USUNET.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-SESION.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-USUAR.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-HCEVO17.CBL".

005190 WORKING-STORAGE SECTION.
005200 COPY "P:\PROG\PROYECT\FUENTES\COBW3.CBL".
005210 COPY "P:\PROG\PROYECT\FUENTES\WEB-CARAC19.CBL".

       77 ANO-X             PIC 99.
       77 ANO-W             PIC 9(4).
       77 SW-BUSCAR-W       PIC 9.
       77 LINEA-LLEGADA-W   PIC X(200).
       77 DATOS-PLANO-W     PIC X(200).
       01 FECHA-INI.
          02 ANO-INI      PIC 9(4).
          02 MES-INI      PIC 99.
          02 DIA-INI      PIC 99.

       77 ID-PAC-W          PIC X(15).
       01 RESUL-PEND.
          02 TABLA-RESUL OCCURS 15.
             03 LLAVE-RES.
                05 LLAVE-PACI-RES.
                   07 ID-RES              PIC X(15).
                   07 FOLIO-RES.
                      09 FOLIO-SUC-RES PIC XX.
                      09 FOLIO-NRO-RES PIC 9(6).
                05 FECHA-RES.
                   07 ANO-RES             PIC X(4).
                   07 MES-RES             PIC XX.
                   07 DIA-RES             PIC XX.
                05 HORA-RES.
                   07 HR-RES              PIC XX.
                   07 MN-RES              PIC XX.
                05 OPER-ELAB-RES          PIC X(4).
             03 TABLA-CUPS-RES.
                05 CUPS-RES            PIC X(12) OCCURS 10.
             03 UNSERV-RES PIC 99.

006310 LINKAGE SECTION.

006320 COPY "P:\PROG\PROYECT\FUENTES\ISAPICTX.CBL".
006330 PROCEDURE DIVISION WITH stdcall LINKAGE USING ISAPI-CTX-CNT.

006350 DECLARATIVES.
006360 I-O-TEST SECTION.
006370     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUNET.         
006380 ESCR-EXCEPTIONES.
006390     IF OTR-STAT = "00"
006400        CONTINUE 
006410     ELSE
006420        MOVE OTR-STAT         TO MSJ1-HTML
006430        MOVE NOM-USU-W        TO MSJ2-HTML
006440        MOVE "HC002R"        TO MSJ3-HTML
006450        GO TO ENVIAR2-ERROR
006460     END-IF.
006470
006480 I-O-TEST SECTION.
006490     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SESION.
006500 ESCR-EXCEPTIONES.
006510     IF OTR-STAT = "00" 
006520        CONTINUE 
006530     ELSE
006540        MOVE OTR-STAT         TO MSJ1-HTML
006550        MOVE NOM-SESION-W     TO MSJ2-HTML
006560        MOVE "HC002R"        TO MSJ3-HTML
006570        GO TO ENVIAR2-ERROR
006580     END-IF.
006470
006480 I-O-TEST SECTION.
006490     USE AFTER EXCEPTION PROCEDURE ON EVOLUCION-HISTORIA.
006500 ESCR-EXCEPTIONES.
006510     IF OTR-STAT = "00" OR "35"
006520        CONTINUE 
006530     ELSE
006540        MOVE OTR-STAT          TO MSJ1-HTML
006550        MOVE NOM-HCEVO-LNK     TO MSJ2-HTML
006560        MOVE "HC002R"          TO MSJ3-HTML
006570        GO TO ENVIAR2-ERROR
006580     END-IF.
.

006480 I-O-TEST SECTION.
006490     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUARIOS.
006500 ESCR-EXCEPTIONES.
006510     IF OTR-STAT = "00" 
006520        CONTINUE 
006530     ELSE
006540        MOVE OTR-STAT         TO MSJ1-HTML
006550        MOVE NOM-USUAR-LNK      TO MSJ2-HTML
006560        MOVE "HC002R"        TO MSJ3-HTML
006570        GO TO ENVIAR2-ERROR
006580     END-IF.
006720  END DECLARATIVES.
 

006740 INICIAR-IIS.
006750     MOVE LOW-VALUE TO COBW3.
006760     MOVE FUNCTION ADDR(ISAPI-CTX-CNT) TO COBW3-CONTEXT.
006770     CALL "COBW3_INIT" USING COBW3.
006780
006790 LEER-DATO-HTML.
006800     MOVE "datosh" TO COBW3-SEARCH-DATA.
006810     CALL "COBW3_GET_VALUE" USING COBW3.
006820     MOVE COBW3-GET-DATA    TO LINEA-LLEGADA-W.


           UNSTRING LINEA-LLEGADA-W DELIMITED BY "|"
              INTO SESION-LLEGAD-W, DIRECTORIO-LLEGAD-W, CARPTA-LLEGAD-W
              ID-PAC-W
           END-UNSTRING.
001855     MOVE SESION-LLEGAD-W    TO LLAVE-SESION-W.
           MOVE FUNCTION CURRENT-DATE TO FECHA-TOTAL.

000797 INICIAR-SESION.
000806     MOVE "D:\WEB\MAIN-ELECT\DATOS\SC-SESION.DAT" TO NOM-SESION-W
000830     ACCEPT HORA-TOTAL FROM TIME.
000810     GO TO VALIDAR-SESION.
000850
000860 FIN-VALIDAR-SESION.
006840
006900 ABRIR-USUARIO.
006910     INITIALIZE OTR-STAT.
006920     MOVE "D:\WEB\MAIN-ELECT\DATOS\SC-ARCHUSU.DAT" TO NOM-USU-W
006930
006940     OPEN INPUT ARCHIVO-USUNET
006950     EVALUATE OTR-STAT
006960       WHEN "00"  CONTINUE
006970       WHEN "35"  OPEN OUTPUT ARCHIVO-USUNET
006980                  INITIALIZE REG-USUNET
006990                  WRITE REG-USUNET
007000                  CLOSE ARCHIVO-USUNET
007010                  MOVE "SC-1"                        TO MSJ1-HTML
007020                  MOVE "Falta configurar usuarios"   TO MSJ2-HTML
007030                  MOVE "HC002R"                     TO MSJ3-HTML
007040                  GO TO ENVIAR2-ERROR
007050       WHEN OTHER GO TO CERRAR-SESION
007060     END-EVALUATE.
007070
007080     INITIALIZE LLAVE-USUNET.
007100
007110 LEER-USUARIO.
007120     READ ARCHIVO-USUNET NEXT AT END MOVE 0 TO SW-FIN.
007130
007140     CLOSE ARCHIVO-USUNET.
007200     
007210     IF NOMBRE-USUNET = SPACES
007220     OR NIT-USUNET = ZEROS
007230        MOVE "Validacion de Sesion"        TO MSJ1-HTML
007240        MOVE "Falta configurar usuarios"   TO MSJ2-HTML
007250        MOVE "Sc"                          TO MSJ3-HTML
007260        GO TO ENVIAR2-ERROR
007270     END-IF.

       ASIGNAR-NOMBRES.
           INITIALIZE NOM-USUAR-LNK
           INSPECT IP-DATOS-USUNET REPLACING FIRST "/" BY "\"
           MOVE "\\" TO NOM-USUAR-LNK

           INSPECT NOM-USUAR-LNK REPLACING FIRST "                    "
                                            BY IP-DATOS-USUNET
           
           MOVE NOM-USUAR-LNK TO NOM-HCEVO-LNK

           INSPECT NOM-USUAR-LNK REPLACING FIRST " "
                                            BY "\"


           INSPECT NOM-USUAR-LNK REPLACING FIRST "                              "
                                              BY DIRECTORIO-LLEGAD-W

           INSPECT NOM-USUAR-LNK REPLACING FIRST  "                       "
                                              BY  "\CONTROL\SC-ARCHUSU.DAT".
           ACCEPT FECHA-INI FROM DATE.


       ABRIR-EVOLUCION.
           ADD 1 TO ANO-X
           IF ANO-X > ANO-INI
              GO TO CERRAR-EVOLUCION

           
       BUSCAR-EVOLUCION.
           MOVE ID-PAC-W TO ID-EVO  
           START EVOLUCION-HISTORIA KEY = ID-EVO
                 INVALID KEY
                  CLOSE EVOLUCION-HISTORIA
                  GO TO ABRIR-EVOLUCION
           END-START.

       PA.
           MOVE "SC-2" TO MSJ1-HTML
           MOVE LLAVE-EVO TO MSJ2-HTML
           MOVE "HC002R"  TO MSJ3-HTML
           GO TO ENVIAR2-ERROR.

       CERRAR-EVOLUCION.
           IF ID-RES (1) IS NOT = SPACES
              MOVE "SC-2"      TO MSJ1-HTML
              MOVE "9P"        TO MSJ2-HTML
              MOVE "HC002R"    TO MSJ2-HTML
              GO TO ENVIAR2-ERROR
           END-IF.

       

010700 PAGINA-CONFIG.
           MOVE "statuscode"    TO COBW3-CNV-NAME
010730     MOVE "00"            TO COBW3-CNV-VALUE
010740     CALL "COBW3_SET_CNV" USING COBW3

000570	   MOVE "datosrecibidos"      TO COBW3-CNV-NAME
000580      MOVE  DATOS-PLANO-W    TO COBW3-CNV-VALUE
000590	   CALL "COBW3_SET_CNV"  USING COBW3

010720     MOVE "programa-id" TO COBW3-CNV-NAME
010730     MOVE "HC002R" TO COBW3-CNV-VALUE
010740     CALL "COBW3_SET_CNV" USING COBW3

010760     MOVE "..\PAGINAS\RECIBIDOSPLANO.ASPX" TO SALIDA-HTML
010770     PERFORM ABRIR-HTML.
007980   
007990 CERRAR-SESION.
008000     CALL "COBW3_FREE" USING COBW3.
008010     MOVE 1 TO PROGRAM-STATUS.
008020     EXIT PROGRAM.

       VALIDAR-HCEVO.
           MOVE DIRECTORIO-LLEGAD-W  TO NOM-HCEVO-LNK
           IF (ANO-X = ZEROS) OR (ANO-X > 04)
              INSPECT NOM-HCEVO-LNK REPLACING FIRST "                          "
                                               BY "\PROG\DATOS\SC-HCEVOX1.S17"

              INSPECT NOM-HCEVO-LNK REPLACING FIRST "X1" BY ANO-X

              OPEN INPUT EVOLUCION-HISTORIA
              EVALUATE OTR-STAT
                  WHEN "00"  CLOSE  EVOLUCION-HISTORIA
                  WHEN "35"  OPEN OUTPUT EVOLUCION-HISTORIA
                             CLOSE  EVOLUCION-HISTORIA
              END-EVALUATE
           END-IF.       
       
008040 COPY "P:\PROG\PROYECT\FUENTES\SC-WEB19.CBL".
