004820*=================================================================
      * PO -13/11/2019 -> RECALCULO DE CENSO HOSPITALARIO
004840*=================================================================
004850 IDENTIFICATION DIVISION.
004860 PROGRAM-ID. "HttpExtensionProc".
004870 ENVIRONMENT DIVISION.
004880 CONFIGURATION SECTION.
004890 INPUT-OUTPUT SECTION.
004900 
       FILE-CONTROL.
004910 COPY "P:\PROG\PROYECT\FUENTES\FS-USUNET.CBL".
004920 COPY "P:\PROG\PROYECT\FUENTES\FS-SESION.CBL".      
           
           SELECT ARCHIVO-CAMAS-HOSP LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-CAMAS-LNK
                  ORGANIZATION INDEXED;
                  ACCESS MODE DYNAMIC;
                  RECORD KEY IS COD-CAM
                  ALTERNATE RECORD KEY IS UNSERV-CAM   WITH DUPLICATES
                  ALTERNATE RECORD KEY IS SERVHO-CAM   WITH DUPLICATES
                  ALTERNATE RECORD KEY IS FACT-CAM     WITH DUPLICATES
                  ALTERNATE RECORD KEY IS PACI-CAM     WITH DUPLICATES
                  ALTERNATE RECORD KEY IS NOM-PACI-CAM WITH DUPLICATES
                  ALTERNATE RECORD KEY IS FOLIO-CAM    WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.

           SELECT ARCHIVO-CENSO LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-CENSO-LNK
                  ORGANIZATION INDEXED;
                  ACCESS MODE DYNAMIC;
                  RECORD KEY IS LLAVE-CENSO
                  ALTERNATE RECORD KEY HAB-CENSO WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.

           SELECT ARCHIVO-USUARIOS LOCK MODE IS AUTOMATIC
                  ASSIGN TO NOM-USUAR-LNK
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC;
                  RECORD KEY IS NOMBRE-USU
                  ALTERNATE RECORD KEY IS CTL-USU     WITH DUPLICATES
                  ALTERNATE RECORD KEY IS CLAVE-USU   WITH DUPLICATES
                  ALTERNATE RECORD KEY IS CLAVE-2-USU WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.

           SELECT REGCONT LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-FECHA-LNK
                  FILE STATUS OTR-STAT.

005080 DATA DIVISION.
005090 FILE SECTION.
       COPY "P:\PROG\PROYECT\FUENTES\FD-USUNET.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-SESION.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-USUAR.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-CAMAS17.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-CENSO.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-FECHA.CBL".

005190 WORKING-STORAGE SECTION.
005200 COPY "P:\PROG\PROYECT\FUENTES\COBW3.CBL".
005210 COPY "P:\PROG\PROYECT\FUENTES\WEB-CARAC19.CBL".

       77 ATIENDE-PROF-W   PIC X.
       77 ESTADO-X         PIC X.
       77 SW-NUEVO         PIC 9.
       77 FECHA-SIG-W      PIC 9(8). 
       77 LINEA-LLEGADA-W  PIC X(200).
       
       01 LLAVE-JORN-W.
          02 FECHA-W           PIC 9(8).
          02 JORNADA-W         PIC 9.

006310 LINKAGE SECTION.

006320 COPY "P:\PROG\PROYECT\FUENTES\ISAPICTX.CBL".
006330 PROCEDURE DIVISION WITH stdcall LINKAGE USING ISAPI-CTX-CNT.

006350 DECLARATIVES.
006360 I-O-TEST SECTION.
006370     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUNET.         
006380 ESCR-EXCEPTIONES.
006390     IF OTR-STAT = "00"
006400        CONTINUE 
006410     ELSE
006420        MOVE OTR-STAT         TO MSJ1-HTML
006430        MOVE NOM-USU-W        TO MSJ2-HTML
006440        MOVE "HC904A"        TO MSJ3-HTML
006450        GO TO ENVIAR2-ERROR
006460     END-IF.
006470
006480 I-O-TEST SECTION.
006490     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SESION.
006500 ESCR-EXCEPTIONES.
006510     IF OTR-STAT = "00" 
006520        CONTINUE 
006530     ELSE
006540        MOVE OTR-STAT         TO MSJ1-HTML
006550        MOVE NOM-SESION-W     TO MSJ2-HTML
006560        MOVE "HC904A"        TO MSJ3-HTML
006570        GO TO ENVIAR2-ERROR
006580     END-IF.
006590  

006480 I-O-TEST SECTION.
006490     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-CENSO.
006500 ESCR-EXCEPTIONES.
006510     IF OTR-STAT = "00" OR "35"
006520        CONTINUE 
006530     ELSE
006540        MOVE OTR-STAT         TO MSJ1-HTML
006550        MOVE NOM-CENSO-LNK    TO MSJ2-HTML
006560        MOVE "HC904A"         TO MSJ3-HTML
006570        GO TO ENVIAR2-ERROR
006580     END-IF.         

006480 I-O-TEST SECTION.
006490     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-CAMAS-HOSP.
006500 ESCR-EXCEPTIONES.
006510     IF OTR-STAT = "00" 
006520        CONTINUE 
006530     ELSE
006540        MOVE OTR-STAT         TO MSJ1-HTML
006550        MOVE NOM-CAMAS-LNK    TO MSJ2-HTML
006560        MOVE "HC904A"         TO MSJ3-HTML
006570        GO TO ENVIAR2-ERROR
006580     END-IF.


006480 I-O-TEST SECTION.
006490     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUARIOS.
006500 ESCR-EXCEPTIONES.
006510     IF OTR-STAT = "00" 
006520        CONTINUE 
006530     ELSE
006540        MOVE OTR-STAT         TO MSJ1-HTML
006550        MOVE NOM-USUAR-LNK      TO MSJ2-HTML
006560        MOVE "HC904A"        TO MSJ3-HTML
006570        GO TO ENVIAR2-ERROR
006580     END-IF.
006720  END DECLARATIVES.


006740 INICIAR-IIS.
006750     MOVE LOW-VALUE TO COBW3.
006760     MOVE FUNCTION ADDR(ISAPI-CTX-CNT) TO COBW3-CONTEXT.
006770     CALL "COBW3_INIT" USING COBW3.
006780
006790 LEER-DATO-HTML.
006800     MOVE "datosh" TO COBW3-SEARCH-DATA.
006810     CALL "COBW3_GET_VALUE" USING COBW3.
006820     MOVE COBW3-GET-DATA    TO LINEA-LLEGADA-W.


           UNSTRING LINEA-LLEGADA-W DELIMITED BY "|"
              INTO SESION-LLEGAD-W, DIRECTORIO-LLEGAD-W, CARPTA-LLEGAD-W
              FECHA-SIG-W, NOVEDAD-W, ATIENDE-PROF-W
           END-UNSTRING.
001855     MOVE SESION-LLEGAD-W    TO LLAVE-SESION-W.
           MOVE FUNCTION CURRENT-DATE TO FECHA-TOTAL.

000797 INICIAR-SESION.
000806     MOVE "D:\WEB\MAIN-ELECT\DATOS\SC-SESION.DAT" TO NOM-SESION-W
000830     ACCEPT HORA-TOTAL FROM TIME.
000810     GO TO VALIDAR-SESION.
000850
000860 FIN-VALIDAR-SESION.
006840
006900 ABRIR-USUARIO.
006910     INITIALIZE OTR-STAT.
006920     MOVE "D:\WEB\MAIN-ELECT\DATOS\SC-ARCHUSU.DAT" TO NOM-USU-W
006930
006940     OPEN INPUT ARCHIVO-USUNET
006950     EVALUATE OTR-STAT
006960       WHEN "00"  CONTINUE
006970       WHEN "35"  OPEN OUTPUT ARCHIVO-USUNET
006980                  INITIALIZE REG-USUNET
006990                  WRITE REG-USUNET
007000                  CLOSE ARCHIVO-USUNET
007010                  MOVE "SC-1"                        TO MSJ1-HTML
007020                  MOVE "Falta configurar usuarios"   TO MSJ2-HTML
007030                  MOVE "HC904A"                     TO MSJ3-HTML
007040                  GO TO ENVIAR2-ERROR
007050       WHEN OTHER GO TO CERRAR-SESION
007060     END-EVALUATE.
007070
007080     INITIALIZE LLAVE-USUNET.
007100
007110 LEER-USUARIO.
007120     READ ARCHIVO-USUNET NEXT AT END MOVE 0 TO SW-FIN.
007130
007140     CLOSE ARCHIVO-USUNET.
007200     
007210     IF NOMBRE-USUNET = SPACES
007220     OR NIT-USUNET = ZEROS
007230        MOVE "Validacion de Sesion"        TO MSJ1-HTML
007240        MOVE "Falta configurar usuarios"   TO MSJ2-HTML
007250        MOVE "Sc"                          TO MSJ3-HTML
007260        GO TO ENVIAR2-ERROR
007270     END-IF.
007280 
007350
       ASIGNAR-NOMBRES.
           INITIALIZE NOM-USUAR-LNK
           INSPECT IP-DATOS-USUNET REPLACING FIRST "/" BY "\"
           MOVE "\\" TO NOM-USUAR-LNK

           INSPECT NOM-USUAR-LNK REPLACING FIRST "                    "
                                            BY IP-DATOS-USUNET.
                                            
           MOVE NOM-USUAR-LNK TO NOM-CENSO-LNK NOM-CAMAS-LNK

           INSPECT NOM-USUAR-LNK REPLACING FIRST "                              "
                                              BY DIRECTORIO-LLEGAD-W.

           INSPECT NOM-FECHA-LNK REPLACING  FIRST  "                       "
                                                BY "\CONTROL\SC-REGCONT.DAT".

           INSPECT  NOM-USUAR-LNK REPLACING FIRST  "                       "
                                             BY  "\CONTROL\SC-ARCHUSU.DAT".

           INSPECT NOM-CENSO-LNK REPLACING FIRST  "                        "
                                            BY    "\PROG\DATOS\SC-CENSO.DAT".

           INSPECT NOM-CAMAS-LNK REPLACING FIRST  "                        "
                                            BY    "\PROG\DATOS\SC-CAMAS.S17".
       
       ABRIR-CENSO.
           OPEN INPUT ARCHIVO-CENSO.
           EVALUATE OTR-STAT
           WHEN "00"   GO TO BUSCAR-JORANADA
           WHEN "35"
                  OPEN OUTPUT ARCHIVO-CENSO
                  CLOSE       ARCHIVO-CENSO
           END-EVALUATE

           MOVE FECHA-TOTAL TO FECHA-W.

       BUSCAR-JORANADA.
           IF HORA-TOTAL < 15
             MOVE 1 TO JORNADA-W
           ELSE
             MOVE 2 TO JORNADA-W
           END-IF
          
           MOVE LLAVE-JORN-W TO LLAVE-JORN-CENSO.
           START ARCHIVO-CENSO KEY = LLAVE-JORN-CENSO
              INVALID KEY
                 CONTINUE
              NOT INVALID KEY
                 IF NOVEDAD-W = 7
                    CLOSE ARCHIVO-CENSO
                 END-IF.
       
       ABRIR-CAMAS.
           CLOSE      ARCHIVO-CENSO
           OPEN I-O   ARCHIVO-CENSO
           OPEN INPUT ARCHIVO-CAMAS-HOSP
           IF ATIENDE-PROF-W = 3 OR 4
             CONTINUE
           ELSE
             GO TO CERRAR-ARCHIVOS
           END-IF.   

       LEER-CAMAS.
           READ ARCHIVO-CAMAS-HOSP NEXT AT END
                                   GO TO CERRAR-ARCHIVOS.

           IF COD-CAM = "SIN"
              GO TO LEER-CAMAS.

           MOVE LLAVE-JORN-W   TO LLAVE-JORN-CENSO
           MOVE COD-CAM        TO HAB-CENSO
           READ ARCHIVO-CENSO
                INVALID KEY
                   MOVE 7 TO SW-NUEVO
                   PERFORM  GRABAR-CENSO
                NOT INVALID KEY
                  IF NOVEDAD-W = 8
                   MOVE 8  TO SW-NUEVO
                   PERFORM GRABAR-CENSO
                  END-IF
            GO TO LEER-CAMAS.       
       
       GRABAR-CENSO.
             MOVE ESTADO-CAM   TO ESTADO-CENSO
           IF ESTADO-CAM = 1
             MOVE FACT-CAM    TO FACT-CENSO
             MOVE PACI-CAM       TO PACI-CENSO
             MOVE UNSERV-CAM     TO UNSERV-CENSO
             MOVE SERVHO-CAM     TO SERVHO-CENSO
             MOVE FECHA-ING-CAM  TO FECHA-ING-CENSO
             MOVE NIT-FACT-CAM   TO NIT-FACT-CENSO
             MOVE MED-APER-CAM   TO MED-APER-CENSO
             MOVE DIAGN-APER-CAM TO DIAGN-APER-CENSO
             MOVE SPACES         TO OBSERV-CENSO
            ELSE
              MOVE ESTADO-CENSO TO ESTADO-X
              INITIALIZE DATOS-CENSO
              MOVE ESTADO-X TO ESTADO-CENSO
            END-IF.
            IF SW-NUEVO = 8
              REWRITE REG-CENSO
            END-IF.     

       CERRAR-ARCHIVOS.
           CLOSE ARCHIVO-CENSO
                 ARCHIVO-CAMAS-HOSP.
                 
010700 PAGINA-CONFIG.
           MOVE "statuscode"    TO COBW3-CNV-NAME
010730     MOVE "00"            TO COBW3-CNV-VALUE
010740     CALL "COBW3_SET_CNV" USING COBW3

000570	   MOVE "datosrecibidos"      TO COBW3-CNV-NAME
000580      MOVE "datos completos!"    TO COBW3-CNV-VALUE
000590	   CALL "COBW3_SET_CNV"  USING COBW3

010720     MOVE "programa-id" TO COBW3-CNV-NAME
010730     MOVE "HC904A" TO COBW3-CNV-VALUE
010740     CALL "COBW3_SET_CNV" USING COBW3

010760     MOVE "..\PAGINAS\RECIBIDOSPLANO.ASPX" TO SALIDA-HTML
010770     PERFORM ABRIR-HTML.
007980   
007990 CERRAR-SESION.
008000     CALL "COBW3_FREE" USING COBW3.
008010     MOVE 1 TO PROGRAM-STATUS.
008020     EXIT PROGRAM.

       
008040 COPY "P:\PROG\PROYECT\FUENTES\SC-WEB19.CBL".
