004820*=================================================================
004830* CREA JSON DE CONSULTA DE DETALLES POR PACIENTE HC.
004840*=================================================================
004850 IDENTIFICATION DIVISION.
004860 PROGRAM-ID. "HttpExtensionProc".
004870 ENVIRONMENT DIVISION.
004880 CONFIGURATION SECTION.
004890 INPUT-OUTPUT SECTION.
004900 FILE-CONTROL.
004910     COPY "P:\PROG\PROYECT\FUENTES\FS-USUNET.CBL".
004920     COPY "P:\PROG\PROYECT\FUENTES\FS-SESION.CBL".
           COPY "P:\PROG\PROYECT\FUENTES\FS-PACIE.CBL".
           COPY "P:\PROG\PROYECT\FUENTES\FS-HCDETAL17.CBL".

           SELECT ARCHIVO-USUARIOS LOCK MODE IS AUTOMATIC
                  ASSIGN TO NOM-USUAR-W
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC;
                  RECORD KEY IS NOMBRE-USU
                  ALTERNATE RECORD KEY IS CTL-USU     WITH DUPLICATES
                  ALTERNATE RECORD KEY IS CLAVE-USU   WITH DUPLICATES
                  ALTERNATE RECORD KEY IS CLAVE-2-USU WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.

005080 DATA DIVISION.
005090 FILE SECTION.
       COPY "P:\PROG\PROYECT\FUENTES\FD-USUNET.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-SESION.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-USUAR.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-HCDETAL17.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-PACIE.CBL".
.
005190 WORKING-STORAGE SECTION.
005200 COPY "P:\PROG\PROYECT\FUENTES\COBW3.CBL".
005210 COPY "P:\PROG\PROYECT\FUENTES\WEB-CARAC19.CBL".

       77 NOM-USUAR-W                PIC X(70).
       77 SW-PYP                     PIC 999.
       77 SW-BLANCA                  PIC 999.
       77 SW-OPEN                    PIC 9.

       01 ID-EDIT.
          02 ID1-EDIT                PIC X(14).
          02 ID2-EDIT                PIC X.

       01 DATOS-PLANO-W              PIC X(1024).

       01 TABLA-EDIT.
          02 TABLA-EDIT-W            PIC X(1024) OCCURS 35.


       01 LLAVE-HC-W             PIC X(23).
       01 SW-DETALLE             PIC XX.
       01 SW-FOLIO               PIC XX.
       01 TABLA-W.
          02 TABLA-COD    OCCURS 25.
             03 COD-DETCH-W      PIC X(4).
             03 FILLER           PIC X.

       01 LIN-01.
          02 FILLER                  PIC X(12)  VALUE "{*LLAVE-HC*:".
          02 FILLER                  PIC X      VALUE "*".
          02 LLAVE-HC-DETHC-J        PIC X(23).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(12)  VALUE "*COD-DETHC*:".
          02 FILLER                  PIC X      VALUE "*".
          02 COD-DETHC-J             PIC X(4).
          02 FILLER                  PIC XX     VALUE "*,".
          02 FILLER                  PIC X(10)  VALUE "*DETALLE*:".
          02 FILLER                  PIC X      VALUE "*".
          02 DATOS-DETHC-J           PIC X(19000).
          02 FILLER                  PIC XX     VALUE "*}".
          02 CIERRE-LIN-01           PIC X.

006310 LINKAGE SECTION.
006320 COPY "P:\PROG\PROYECT\FUENTES\ISAPICTX.CBL".
006330 PROCEDURE DIVISION WITH stdcall LINKAGE USING ISAPI-CTX-CNT.
006340
006350 DECLARATIVES.
006360 I-O-TEST SECTION.
006370     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUNET.         
006380 ESCR-EXCEPTIONES.
006390     IF OTR-STAT = "00"
006400        CONTINUE 
006410     ELSE
006420        MOVE OTR-STAT         TO MSJ1-HTML
006430        MOVE NOM-USU-W        TO MSJ2-HTML
006440        MOVE "HCDETAL"        TO MSJ3-HTML
006450        GO TO ENVIAR2-ERROR
006460     END-IF.
006470
006480 I-O-TEST SECTION.
006490     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SESION.
006500 ESCR-EXCEPTIONES.
006510     IF OTR-STAT = "00" 
006520        CONTINUE 
006530     ELSE
006540        MOVE OTR-STAT         TO MSJ1-HTML
006550        MOVE NOM-SESION-W     TO MSJ2-HTML
006560        MOVE "HCDETAL"        TO MSJ3-HTML
006570        GO TO ENVIAR2-ERROR
006580     END-IF.
006590  

006480 I-O-TEST SECTION.
006490     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUARIOS.
006500 ESCR-EXCEPTIONES.
006510     IF OTR-STAT = "00" 
006520        CONTINUE 
006530     ELSE
006540        MOVE OTR-STAT         TO MSJ1-HTML
006550        MOVE NOM-USUAR-W      TO MSJ2-HTML
006560        MOVE "HCDETAL"        TO MSJ3-HTML
006570        GO TO ENVIAR2-ERROR
006580     END-IF.
006590  

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON HISTORIA-DETALLADA.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-HCDET        TO MSJ2-HTML
006680        MOVE "HCDETAL"        TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR  
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-PACIENTES.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-PACIE-LNK    TO MSJ2-HTML
006680        MOVE "HCDETAL"        TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006720  END DECLARATIVES.
006730
006740 INICIAR-IIS.
006750     MOVE LOW-VALUE TO COBW3.
006760     MOVE FUNCTION ADDR(ISAPI-CTX-CNT) TO COBW3-CONTEXT.
006770     CALL "COBW3_INIT" USING COBW3.
006780
006790 LEER-DATO-HTML.
006800     MOVE "datosh" TO COBW3-SEARCH-DATA.
006810     CALL "COBW3_GET_VALUE" USING COBW3.
006820     MOVE COBW3-GET-DATA    TO LINEA-LLEGAD-W.

           INITIALIZE DATO-LLEGADA-W
           UNSTRING LINEA-LLEGAD-W DELIMITED BY "|"
              INTO  SESION-LLEGAD-W, DIRECTORIO-LLEGAD-W, CARPTA-LLEGAD-W, 
                    LLAVE-HC-W, SW-DETALLE, SW-FOLIO, TABLA-W
           END-UNSTRING.

           MOVE LLAVE-HC-W         TO ID-EDIT
001855     MOVE SESION-LLEGAD-W    TO LLAVE-SESION-W.
           MOVE FUNCTION CURRENT-DATE TO FECHA-TOTAL FECHA-JSON-W.

           MOVE FUNCTION CURRENT-DATE TO FECHA-JSON-W.
           ACCEPT HORA-TOTAL FROM TIME.
           ACCEPT HORA-JSON-W FROM TIME.

000797 INICIAR-SESION.
000806     MOVE "D:\WEB\MAIN-ELECT\DATOS\SC-SESION.DAT" TO NOM-SESION-W
000810     GO TO VALIDAR-SESION.
000850
000860 FIN-VALIDAR-SESION.
006840
006900 ABRIR-USUARIO.
006910     INITIALIZE OTR-STAT.
006920     MOVE "D:\WEB\MAIN-ELECT\DATOS\SC-ARCHUSU.DAT" TO NOM-USU-W
006930
006940     OPEN INPUT ARCHIVO-USUNET
006950     EVALUATE OTR-STAT
006960       WHEN "00"  CONTINUE
006970       WHEN "35"  OPEN OUTPUT ARCHIVO-USUNET
006980                  INITIALIZE REG-USUNET
006990                  WRITE REG-USUNET
007000                  CLOSE ARCHIVO-USUNET
007010                  MOVE "Validacion de Usuario"       TO MSJ1-HTML
007020                  MOVE "Falta configurar usuarios"   TO MSJ2-HTML
007030                  MOVE "Sc"                          TO MSJ3-HTML
007040                  GO TO ENVIAR2-ERROR
007050       WHEN OTHER GO TO CERRAR-SESION
007060     END-EVALUATE.
007070
007080     INITIALIZE LLAVE-USUNET.
007100
007110 LEER-USUARIO.
007120     READ ARCHIVO-USUNET NEXT AT END MOVE 0 TO SW-FIN.
007130
007140     CLOSE ARCHIVO-USUNET.
007200     
007210     IF NOMBRE-USUNET = SPACES
007220     OR NIT-USUNET = ZEROS
007230        MOVE "Validacion de Sesion"        TO MSJ1-HTML
007240        MOVE "Falta configurar usuarios"   TO MSJ2-HTML
007250        MOVE "Sc"                          TO MSJ3-HTML
007260        GO TO ENVIAR2-ERROR
007270     END-IF.
007280 
007350
       ASIGNAR-NOMBRES.
           INITIALIZE NOM-USUAR-W
           INSPECT IP-DATOS-USUNET REPLACING FIRST "/" BY "\"
           MOVE "\\" TO NOM-USUAR-W NOM-HCDET

           INSPECT NOM-USUAR-W REPLACING FIRST "                    "
                                            BY IP-DATOS-USUNET

           INSPECT NOM-USUAR-W REPLACING FIRST " "
                                            BY "\"

           INSPECT NOM-USUAR-W REPLACING FIRST "                              "
                                            BY DIRECTORIO-LLEGAD-W

           MOVE NOM-USUAR-W TO NOM-PACIE-LNK

           INSPECT NOM-USUAR-W REPLACING FIRST  "                       "
                                            BY  "\CONTROL\SC-ARCHUSU.DAT".

           INSPECT NOM-PACIE-LNK REPLACING FIRST "                     "
                                             BY  "\CONTROL\SC-PACIE.DAT".


           INSPECT NOM-HCDET REPLACING FIRST "                    "
                                          BY IP-DATOS-USUNET

           INSPECT NOM-HCDET REPLACING FIRST " "
                                          BY "\"

           INSPECT NOM-HCDET REPLACING FIRST "                          "
                                          BY "PROG\DATOS\SC-HCDETA-X.S17"

           INSPECT NOM-HCDET REPLACING FIRST "X" BY ID2-EDIT.

       LEER-USUARIO.

           OPEN INPUT ARCHIVO-USUARIOS
           READ ARCHIVO-USUARIOS NEXT WITH NO LOCK AT END 
                CLOSE ARCHIVO-USUARIOS
           END-READ.

       LEER-PACIENTE.
           OPEN INPUT ARCHIVO-PACIENTES.
           MOVE LLAVE-HC-W    TO  COD-PACI.
           READ ARCHIVO-PACIENTES WITH NO LOCK
                INVALID KEY
                        MOVE "99"         TO MSJ1-HTML
                        MOVE "Paciente no existe" To MSJ2-HTML
                        MOVE "HC-01"      TO MSJ3-HTML
                        GO TO ENVIAR2-ERROR
           END-READ.
           CLOSE ARCHIVO-PACIENTES.

       BUSCAR-DETALLE.
           OPEN INPUT HISTORIA-DETALLADA.
           MOVE LLAVE-HC-W   TO LLAVE-DETHC

           START HISTORIA-DETALLADA KEY = LLAVE-HC-DETHC
                INVALID KEY
                        GO TO CERRAR-DETALLE
           END-START.

           MOVE "{*DETHC*:["   TO TABLA-EDIT
           INSPECT TABLA-EDIT  REPLACING ALL "*" BY CARAC-COMILLA
           PERFORM PASAR-LINEA VARYING I FROM 1 BY 1 UNTIL I > 35.

       LEER-DETALLE.
           INITIALIZE LIN-01 TABLA-EDIT
           READ HISTORIA-DETALLADA PREVIOUS AT END GO TO CERRAR-PLANO.

           IF ID-DETHC = ID-EDIT
              CONTINUE
           ELSE
              GO TO CERRAR-PLANO
           END-IF

           IF SW-FOLIO = "**"
              CONTINUE
           ELSE
              IF LLAVE-HC-W = LLAVE-HC-DETHC
                 CONTINUE
              ELSE
                 GO TO LEER-DETALLE
              END-IF
           END-IF


           INITIALIZE SW-OPEN I

           IF SW-DETALLE = "**"
              MOVE 1 TO SW-OPEN
           ELSE
              PERFORM VALIDAR-COD-DETHC VARYING I FROM 1 BY 1
                                                UNTIL   I > 25
           END-IF

           IF SW-OPEN = 1
              CONTINUE
           ELSE
              GO TO LEER-DETALLE
           END-IF

           MOVE LLAVE-HC-DETHC    TO LLAVE-HC-DETHC-J
           MOVE COD-DETHC         TO COD-DETHC-J

           MOVE DATOS-DETHC    TO DATOS-DETHC-J
           INSPECT DATOS-DETHC-J REPLACING ALL "*" BY "x"
           INSPECT DATOS-DETHC-J REPLACING ALL LOW-VALUES BY SPACES

           INSPECT LIN-01  REPLACING ALL "*" BY CARAC-COMILLA
           MOVE ","        TO CIERRE-LIN-01

           MOVE LIN-01     TO TABLA-EDIT

           PERFORM PASAR-LINEA VARYING I FROM 1 BY 1 UNTIL I > 35.
           GO TO LEER-DETALLE.

       CERRAR-PLANO.
           INITIALIZE LIN-01 TABLA-EDIT
           INSPECT LIN-01  REPLACING ALL "*" BY CARAC-COMILLA

           STRING LIN-01, "]}" DELIMITED BY SIZE
                  INTO TABLA-EDIT
           END-STRING

           PERFORM PASAR-LINEA VARYING I FROM 1 BY 1 UNTIL I > 35.

       CERRAR-DETALLE.
           CLOSE HISTORIA-DETALLADA.

010700 PAGINA-CONFIG.
010720     MOVE "statuscode" TO COBW3-CNV-NAME
010730     MOVE "00"         TO COBW3-CNV-VALUE
010740     CALL "COBW3_SET_CNV" USING COBW3

010720     MOVE "programa-id" TO COBW3-CNV-NAME
010730     MOVE "HCDETAL"    TO COBW3-CNV-VALUE
010740     CALL "COBW3_SET_CNV" USING COBW3

010760     MOVE "..\PAGINAS\RECIBIDOSLISTADO.ASPX" TO SALIDA-HTML
010770     PERFORM ABRIR-HTML.
007980   
       PASAR-LINEA.
           IF TABLA-EDIT-W (I) = SPACES OR LOW-VALUES
              CONTINUE
           ELSE
              INITIALIZE DATOS-PLANO-W
              MOVE TABLA-EDIT-W (I)   TO DATOS-PLANO-W
              PERFORM DATOS-ENVIO
           END-IF.

       DATOS-ENVIO.
010720     MOVE "datosrecibidos" TO COBW3-CNV-NAME
010730     MOVE DATOS-PLANO-W    TO COBW3-CNV-VALUE
010740     CALL "COBW3_SET_REPEAT" USING COBW3.

007990 CERRAR-SESION.
008000     CALL "COBW3_FREE" USING COBW3.
008010     MOVE 1 TO PROGRAM-STATUS.
008020     EXIT PROGRAM.

       VALIDAR-COD-DETHC.

           IF COD-DETCH-W (I) = COD-DETHC
              MOVE 1 TO SW-OPEN
           END-IF.

008040 COPY "P:\PROG\PROYECT\FUENTES\SC-WEB19.CBL".
