004820*=================================================================
004830* CONSULTA DE DATOS POR PACIENTE.
004840*=================================================================
004850 IDENTIFICATION DIVISION.
004860 PROGRAM-ID. "HttpExtensionProc".
004870 ENVIRONMENT DIVISION.
004880 CONFIGURATION SECTION.
004890 INPUT-OUTPUT SECTION.
004900 FILE-CONTROL.
004910     COPY "P:\PROG\PROYECT\FUENTES\FS-USUNET.CBL".
004920     COPY "P:\PROG\PROYECT\FUENTES\FS-SESION.CBL".

           SELECT ARCHIVO-USUARIOS LOCK MODE IS AUTOMATIC
                  ASSIGN TO NOM-USUAR-W
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC;
                  RECORD KEY IS NOMBRE-USU
                  ALTERNATE RECORD KEY IS CTL-USU     WITH DUPLICATES
                  ALTERNATE RECORD KEY IS CLAVE-USU   WITH DUPLICATES
                  ALTERNATE RECORD KEY IS CLAVE-2-USU WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.

           SELECT HISTORIA-CLINICA LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-HCAPE-W
                  ORGANIZATION INDEXED;
                  ACCESS MODE DYNAMIC;
                  RECORD KEY IS LLAVE-HC
                  ALTERNATE RECORD KEY IS FOLIO-HC WITH DUPLICATES
                  ALTERNATE RECORD KEY IS FECHA-HC WITH DUPLICATES
                  ALTERNATE RECORD KEY IS MED-HC WITH DUPLICATES
                  ALTERNATE RECORD KEY IS ESTADO-HC WITH DUPLICATES
                  FILE STATUS OTR-STAT.


           SELECT ARCHIVO-PACIENTES
                  ASSIGN NOM-PACIE-W
                  ORGANIZATION IS INDEXED;
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS COD-PACI
                  ALTERNATE RECORD KEY  DESCRIP-PACI  WITH DUPLICATES
                  ALTERNATE RECORD KEY  EPS-PACI      WITH DUPLICATES
                  ALTERNATE RECORD KEY  ID-COTIZ-PACI WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.

           SELECT ARCHIVO-UNID-SERV   LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-UNSERV-W
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS CODIGO-UNID-SERV
                   FILE STATUS IS OTR-STAT.


           SELECT ARCHIVO-ENTIDADES
                  ASSIGN NOM-ENTID-W
                  ORGANIZATION IS INDEXED;
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS COD-ENT
                  ALTERNATE RECORD KEY IS NOMBRE-ENT WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.

           SELECT ARCHIVO-OCUPACIONES
                  ASSIGN NOM-OCUPA-W
                  ORGANIZATION IS INDEXED;
	          ACCESS MODE  IS DYNAMIC
	          RECORD KEY   IS COD-OCU
	          ALTERNATE RECORD KEY IS
	          NOMBRE-OCU WITH DUPLICATES
	          FILE STATUS OTR-STAT.

005080 DATA DIVISION.
005090 FILE SECTION.
       COPY "P:\PROG\PROYECT\FUENTES\FD-USUNET.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-SESION.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-USUAR.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-HCAPER17.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-PACIE.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-UNSER.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-ENTID.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-OCUPA.CBL".

005190 WORKING-STORAGE SECTION.
005200 COPY "P:\PROG\PROYECT\FUENTES\COBW3.CBL".
005210 COPY "P:\PROG\PROYECT\FUENTES\WEB-CARAC.CBL".
005210 COPY "P:\PROG\PROYECT\FUENTES\WS-8001.CBL".
005210 COPY "P:\PROG\PROYECT\FUENTES\WS-8031.CBL".
005220 
       77 NOM-USUAR-W                PIC X(70).
       77 NOM-HCAPE-W                PIC X(70).
       77 NOM-PACIE-W                PIC X(70).
       77 NOM-UNSERV-W               PIC X(70).
       77 NOM-ENTID-W                PIC X(70).
       77 NOM-ESPEC-W                PIC X(70).
       77 NOM-OCUPA-W                PIC X(70).
       77 CONT                       PIC 99.
       77 OPER-W                     PIC X(4).
       77 SUCURSAL-W                 PIC X.
       77 SW-PYP                     PIC 999.
       77 SW-BLANCA                  PIC 999.
       77 SW-OPEN                    PIC X.

       01 LINEA-LLEGAD-W             PIC X(200).

005270 01  DATO-LLEGADA-W.
           02 SESION-LLEGAD-W.
005280        03 ID-LLEGAD-W         PIC X(15).
              03 FECHA-LLEGAD-W      PIC X(8).
              03 HORA-LLEGAD-W       PIC X(6).
           02 DIRECTORIO-W           PIC X(30).
           02 MES-TRABAJO-W          PIC X(10).
           02 LLAVE-HC-W.
              05 ID-HC-W             PIC X(15).
              05 SUC-HC-W            PIC XX.
              05 FOLIO-HC-W          PIC X(6).


       01 DATOS-ENVIO.
          02 DAT0-ENV                PIC XX.
          02 FILLER                  PIC X VALUE "|".
          02 CODIGO-UNID-ENV         PIC XX.
          02 FILLER                  PIC X VALUE "|".
          02 DESCRIP-UNID-ENV        PIC X(30).
          02 FILLER                  PIC X VALUE "|".
          02 EPS-ENV                 PIC X(6).
          02 FILLER                  PIC X VALUE "|".
          02 NOMBRE-ENT-ENV          PIC X(70).
          02 FILLER                  PIC X VALUE "|".
          02 FOLIO-SUC-ENV           PIC XX.
          02 FILLER                  PIC X VALUE "|".
          02 FOLIO-NRO-ENV           PIC X(6).
          02 FILLER                  PIC X VALUE "|".
          02 DESCRIP-PACI-ENV        PIC X(54).
          02 FILLER                  PIC X VALUE "|".
          02 SEXO-PACI-ENV           PIC X.
          02 FILLER                  PIC X VALUE "|".
          02 COD-OCUP-ENV            PIC X(4).
          02 FILLER                  PIC X VALUE "|".
          02 NOMBRE-OCU-ENV          PIC X(120).
          02 FILLER                  PIC X VALUE "|".
          02 TEMPORAL-ENV            PIC X.
          02 FILLER                  PIC X VALUE "|".
          02 ESTADO-ENV              PIC X.
          02 FILLER                  PIC X VALUE "|".
          02 FECHA-NACIM-ENV         PIC X(8).
          02 FILLER                  PIC X VALUE "|".
          02 FINALIDAD-ENV           PIC X.
          02 FILLER                  PIC X VALUE "|".
          02 SERV-ENV                PIC X.
          02 FILLER                  PIC X VALUE "|".
          02 ESQUEMA-ENV             PIC X(4).
          02 FILLER                  PIC X VALUE "|".
          02 NOVEDAD-ENV             PIC X.



006310 LINKAGE SECTION.
006320 COPY "P:\PROG\PROYECT\FUENTES\ISAPICTX.CBL".
006330 PROCEDURE DIVISION WITH stdcall LINKAGE USING ISAPI-CTX-CNT.
006340
006350 DECLARATIVES.
006360 I-O-TEST SECTION.
006370     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUNET.         
006380 ESCR-EXCEPTIONES.
006390     IF OTR-STAT = "00"
006400        CONTINUE 
006410     ELSE
006420        MOVE OTR-STAT         TO MSJ1-HTML
006430        MOVE NOM-USU-W        TO MSJ2-HTML
006440        MOVE "HC0002"          TO MSJ3-HTML
006450        GO TO ENVIAR2-ERROR
006460     END-IF.
006470
006480 I-O-TEST SECTION.
006490     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SESION.
006500 ESCR-EXCEPTIONES.
006510     IF OTR-STAT = "00" 
006520        CONTINUE 
006530     ELSE
006540        MOVE OTR-STAT         TO MSJ1-HTML
006550        MOVE NOM-SESION-W     TO MSJ2-HTML
006560        MOVE "HC0002"          TO MSJ3-HTML
006570        GO TO ENVIAR2-ERROR
006580     END-IF.
006590  

006480 I-O-TEST SECTION.
006490     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUARIOS.
006500 ESCR-EXCEPTIONES.
006510     IF OTR-STAT = "00" 
006520        CONTINUE 
006530     ELSE
006540        MOVE OTR-STAT         TO MSJ1-HTML
006550        MOVE NOM-USUAR-W      TO MSJ2-HTML
006560        MOVE "HC0002"          TO MSJ3-HTML
006570        GO TO ENVIAR2-ERROR
006580     END-IF.
006590  

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON HISTORIA-CLINICA.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-HCAPE-W      TO MSJ2-HTML
006680        MOVE "HC0002"          TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR  
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-PACIENTES.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-PACIE-W      TO MSJ2-HTML
006680        MOVE "HC0002"          TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

       I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-UNID-SERV.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-UNSERV-W     TO MSJ2-HTML
006680        MOVE "HC0002"          TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-ENTIDADES.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-ENTID-W      TO MSJ2-HTML
006680        MOVE "HC002"          TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

       I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-OCUPACIONES.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-OCUPA-W      TO MSJ2-HTML
006680        MOVE "HC002"          TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006720  END DECLARATIVES.
006730
006740 INICIAR-IIS.
006750     MOVE LOW-VALUE TO COBW3.
006760     MOVE FUNCTION ADDR(ISAPI-CTX-CNT) TO COBW3-CONTEXT.
006770     CALL "COBW3_INIT" USING COBW3.
006780
006790 LEER-DATO-HTML.
006800     MOVE "datosh" TO COBW3-SEARCH-DATA.
006810     CALL "COBW3_GET_VALUE" USING COBW3.
006820     MOVE COBW3-GET-DATA    TO LINEA-LLEGAD-W.


           UNSTRING LINEA-LLEGAD-W DELIMITED BY "|"
              INTO SESION-LLEGAD-W, DIRECTORIO-W, MES-TRABAJO-W, LLAVE-HC-W
           END-UNSTRING.

           MOVE SESION-LLEGAD-W    TO LLAVE-SESION-W.
           MOVE FUNCTION CURRENT-DATE TO FECHA-TOTAL.

000797 INICIAR-SESION.
000806     MOVE "D:\WEB\MAIN-ELECT\DATOS\SC-SESION.DAT" TO NOM-SESION-W
000820     MOVE FUNCTION CURRENT-DATE TO FECHA-TOTAL.
000830     ACCEPT HORA-TOTAL FROM TIME.
000810     GO TO VALIDAR-SESION.
000850
000860 FIN-VALIDAR-SESION.
006840
006900 ABRIR-USUARIO.
006910     INITIALIZE OTR-STAT.
006920     MOVE "D:\WEB\MAIN-ELECT\DATOS\SC-ARCHUSU.DAT" TO NOM-USU-W
006930
006940     OPEN INPUT ARCHIVO-USUNET
006950     EVALUATE OTR-STAT
006960       WHEN "00"  CONTINUE
006970       WHEN "35"  OPEN OUTPUT ARCHIVO-USUNET
006980                  INITIALIZE REG-USUNET
006990                  WRITE REG-USUNET
007000                  CLOSE ARCHIVO-USUNET
007010                  MOVE "Validacion de Usuario"       TO MSJ1-HTML
007020                  MOVE "Falta configurar usuarios"   TO MSJ2-HTML
007030                  MOVE "Sc"                          TO MSJ3-HTML
007040                  GO TO ENVIAR2-ERROR
007050       WHEN OTHER GO TO CERRAR-SESION
007060     END-EVALUATE.
007070
007080     INITIALIZE LLAVE-USUNET.
007100
007110 LEER-USUARIO.
007120     READ ARCHIVO-USUNET NEXT AT END MOVE 0 TO SW-FIN.
007130
007140     CLOSE ARCHIVO-USUNET.
007200     
007210     IF NOMBRE-USUNET = SPACES
007220     OR NIT-USUNET = ZEROS
007230        MOVE "Validacion de Sesion"        TO MSJ1-HTML
007240        MOVE "Falta configurar usuarios"   TO MSJ2-HTML
007250        MOVE "Sc"                          TO MSJ3-HTML
007260        GO TO ENVIAR2-ERROR
007270     END-IF.
007280 
007350
       ASIGNAR-NOMBRES.

           INITIALIZE NOM-USUAR-W
           INSPECT IP-DATOS-USUNET REPLACING FIRST "/" BY "\"
           MOVE "\\" TO NOM-USUAR-W NOM-ENTID-W

           INSPECT NOM-USUAR-W REPLACING FIRST "                    "
                                            BY IP-DATOS-USUNET

           INSPECT NOM-USUAR-W REPLACING FIRST " "
                                            BY "\"

           INSPECT NOM-USUAR-W REPLACING FIRST "                              "
                                            BY DIRECTORIO-W

           MOVE NOM-USUAR-W TO NOM-HCAPE-W NOM-PACIE-W NOM-UNSERV-W 
           


           INSPECT NOM-USUAR-W REPLACING FIRST  "                       "
                                            BY  "\CONTROL\SC-ARCHUSU.DAT".

           INSPECT NOM-PACIE-W REPLACING FIRST  "                     "
                                           BY   "\CONTROL\SC-PACIE.DAT".

           INSPECT NOM-UNSERV-W REPLACING FIRST "                     "
                                             BY "\CONTROL\SC-UNSER.DAT".

           INSPECT NOM-ENTID-W  REPLACING FIRST "                    "
                                             BY IP-DATOS-USUNET

           INSPECT NOM-ENTID-W REPLACING FIRST " "
                                            BY "\"

           MOVE NOM-ENTID-W TO NOM-OCUPA-W NOM-HCAPE-W 


           INSPECT NOM-ENTID-W REPLACING FIRST "                         "
                                            BY "PROG\DATOS\SC-ARCHENT.DAT".

           INSPECT NOM-OCUPA-W REPLACING FIRST "                         "
                                            BY "PROG\DATOS\SC-ARCHOCU.DAT".

           INSPECT NOM-HCAPE-W REPLACING FIRST "                        "
                                            BY "PROG\DATOS\SC-HCAPER.S17".

           INSPECT NOM-OCUPA-W REPLACING FIRST "                         "
                                            BY "PROG\DATOS\SC-ARCHOCU.DAT".

       LEER-USUARIO.

           OPEN INPUT ARCHIVO-USUARIOS
           READ ARCHIVO-USUARIOS NEXT WITH NO LOCK AT END 
                CLOSE ARCHIVO-USUARIOS
           END-READ.

       LEER-PACIENTE.
           OPEN INPUT ARCHIVO-PACIENTES.
           MOVE ID-HC-W    TO   COD-PACI.
           READ ARCHIVO-PACIENTES WITH NO LOCK
                INVALID KEY
                        MOVE "NO EXISTE PACIENTE!" TO DESCRIP-PACI
                        INITIALIZE DATOS-PACI
           END-READ.
           CLOSE ARCHIVO-PACIENTES.


       BUSCAR-HISTORIAS.
           OPEN INPUT HISTORIA-CLINICA.

           MOVE LLAVE-HC-W   TO LLAVE-HC
           READ HISTORIA-CLINICA WITH NO LOCK
                INVALID KEY
                        MOVE 0  TO ESTADO-HC
                        MOVE 00 TO UNSERV-HC
                        MOVE 7  TO NOVEDAD-ENV
                NOT INVALID KEY
                        IF UNSERV-HC = 00 OR UNSERV-HC = SPACES
                           MOVE SERV-HC TO UNSERV-HC
                        END-IF
                        MOVE 8  TO NOVEDAD-ENV
           END-READ.


       LEER-UNID-SERV.
           OPEN INPUT ARCHIVO-UNID-SERV.
           MOVE UNSERV-HC  TO CODIGO-UNID-SERV.
           READ ARCHIVO-UNID-SERV WITH NO LOCK
                INVALID KEY 
                        MOVE "NO EXISTE UNIDAD SERVICIO" TO DESCRIP-UNID-SERV
           END-READ
           CLOSE ARCHIVO-UNID-SERV.


       LEER-OCUPACION.
           OPEN INPUT ARCHIVO-OCUPACIONES.
           MOVE OCUP-V8-PACI TO COD-OCU
           READ ARCHIVO-OCUPACIONES WITH NO LOCK
                INVALID KEY MOVE "ERROR! NO EXISTE OCUPACION" TO NOMBRE-OCU
           END-READ
           CLOSE ARCHIVO-OCUPACIONES.

       LEER-EPS.
           MOVE EPS-PACI TO COD-ENT
           OPEN INPUT ARCHIVO-ENTIDADES
           READ ARCHIVO-ENTIDADES WITH NO LOCK
                INVALID KEY
                        MOVE "NO EXISTE ENTIDAD" TO NOMBRE-ENT
           END-READ
           CLOSE ARCHIVO-ENTIDADES.

           MOVE 00                TO DAT0-ENV
           MOVE CODIGO-UNID-SERV  TO CODIGO-UNID-ENV
           MOVE DESCRIP-UNID-SERV TO DESCRIP-UNID-ENV
           MOVE EPS-PACI          TO EPS-ENV
           MOVE NOMBRE-ENT        TO NOMBRE-ENT-ENV
           MOVE SUC-HC-W          TO FOLIO-SUC-ENV
           MOVE FOLIO-HC-W        TO FOLIO-NRO-ENV
           MOVE DESCRIP-PACI      TO DESCRIP-PACI-ENV
           MOVE SEXO-PACI         TO SEXO-PACI-ENV
           MOVE OCUP-V8-PACI      TO COD-OCUP-ENV
           MOVE NOMBRE-OCU        TO NOMBRE-OCU-ENV
           MOVE TEMPORAL-HC       TO TEMPORAL-ENV
           MOVE ESTADO-HC         TO ESTADO-ENV
           MOVE NACIM-PACI        TO FECHA-NACIM-ENV
           MOVE FINALID-HC        TO FINALIDAD-ENV
           MOVE ESQUEMA-HC        TO ESQUEMA-ENV
           MOVE SERV-HC           TO SERV-ENV.


010700 PAGINA-CONFIG.

010720     MOVE "datosrecibidos"  TO COBW3-CNV-NAME
010730     MOVE DATOS-ENVIO       TO COBW3-CNV-VALUE
010740     CALL "COBW3_SET_CNV"   USING COBW3
010750
010760     MOVE "..\PAGINAS\RECIBIDOS.ASPX" TO SALIDA-HTML  
010770     PERFORM ABRIR-HTML.
007980   
007990 CERRAR-SESION.
008000     CALL "COBW3_FREE" USING COBW3.
008010     MOVE 1 TO PROGRAM-STATUS.
008020     EXIT PROGRAM.

008040 COPY "P:\PROG\PROYECT\FUENTES\SC-WEB.CBL".