004820*=================================================================
004830* RETORNA ESTADO-HC,LLAVE-HC; VALIDA RESTRICCIONES
      * OPERADOR; CREA FOLIO DE LA HISTORIA -> EXTIENDE DE MUNU-HIS

      * PO -13/11/2019 -> ACTUALIZACION ESTRUCTURA Y COMENTARIOS
004840*=================================================================
004850 IDENTIFICATION DIVISION.
004860 PROGRAM-ID. "HttpExtensionProc".
004870 ENVIRONMENT DIVISION.
004880 CONFIGURATION SECTION.
004890 INPUT-OUTPUT SECTION.
004900 FILE-CONTROL.
004910     COPY "P:\PROG\PROYECT\FUENTES\FS-USUNET.CBL".
004920     COPY "P:\PROG\PROYECT\FUENTES\FS-SESION.CBL".

           SELECT ARCHIVO-USUARIOS LOCK MODE IS AUTOMATIC
                  ASSIGN TO NOM-USUAR-W
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC;
                  RECORD KEY IS NOMBRE-USU
                  ALTERNATE RECORD KEY IS CTL-USU     WITH DUPLICATES
                  ALTERNATE RECORD KEY IS CLAVE-USU   WITH DUPLICATES
                  ALTERNATE RECORD KEY IS CLAVE-2-USU WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.

           SELECT ARCHIVO-RESTRICCION LOCK MODE IS AUTOMATIC
                  ASSIGN TO NOM-RESTR-W
                  ORGANIZATION INDEXED;
                  ACCESS MODE DYNAMIC;
                  RECORD KEY LLAVE-REST
                  ALTERNATE RECORD KEY NOMBRE-REST WITH DUPLICATES
                  FILE STATUS OTR-STAT.

           SELECT HISTORIA-CLINICA LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-HCAPE-W
                  ORGANIZATION INDEXED;
                  ACCESS MODE DYNAMIC;
                  RECORD KEY IS LLAVE-HC
                  ALTERNATE RECORD KEY IS FOLIO-HC WITH DUPLICATES
                  ALTERNATE RECORD KEY IS FECHA-HC WITH DUPLICATES
                  ALTERNATE RECORD KEY IS MED-HC WITH DUPLICATES
                  ALTERNATE RECORD KEY IS ESTADO-HC WITH DUPLICATES
                  FILE STATUS OTR-STAT.

           SELECT HISTORIA-DETALLADA LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-HCDET-W
                  ORGANIZATION INDEXED;
                  ACCESS MODE DYNAMIC;
                  RECORD KEY IS LLAVE-DETHC
                  ALTERNATE RECORD KEY IS LLAVE-FOLIO-DETHC
                  WITH DUPLICATES
                  FILE STATUS OTR-STAT.

           SELECT ARCHIVO-PACIENTES
                  ASSIGN NOM-PACIE-W
                  ORGANIZATION IS INDEXED;
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS COD-PACI
                  ALTERNATE RECORD KEY  DESCRIP-PACI  WITH DUPLICATES
                  ALTERNATE RECORD KEY  EPS-PACI      WITH DUPLICATES
                  ALTERNATE RECORD KEY  ID-COTIZ-PACI WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.

           SELECT EVOLUCION-HISTORIA
                  ASSIGN NOM-HCEVO-W LOCK MODE IS AUTOMATIC
                  ORGANIZATION INDEXED;
                  ACCESS MODE DYNAMIC;
                  RECORD KEY IS LLAVE-EVO
                  ALTERNATE RECORD KEY IS FOLIO-EVO WITH DUPLICATES
                  ALTERNATE RECORD KEY IS FECHA-EVO WITH DUPLICATES
                  ALTERNATE RECORD KEY IS MED-EVO WITH DUPLICATES
                  FILE STATUS OTR-STAT.


           SELECT ARCHIVO-UNID-SERV   LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-UNSERV-W
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS CODIGO-UNID-SERV
                   FILE STATUS IS OTR-STAT.


           SELECT ARCHIVO-TERCEROS  LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-TER-W
                  ORGANIZATION IS INDEXED;
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS COD-TERCERO
                  ALTERNATE RECORD KEY DESCRIP-TER WITH DUPLICATES
                  ALTERNATE RECORD KEY ACT-TER     WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.


	   SELECT ARCHIVO-ESPECIALIDAD LOCK MODE IS AUTOMATIC
	          ASSIGN NOM-ESPEC-W
                  ORGANIZATION IS INDEXED;
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS COD-ESP
                  ALTERNATE RECORD KEY IS NOMBRE-ESP WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.


           SELECT ARCHIVO-ENTIDADES
                  ASSIGN NOM-ENTID-W
                  ORGANIZATION IS INDEXED;
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS COD-ENT
                  ALTERNATE RECORD KEY IS NOMBRE-ENT WITH DUPLICATES
                  FILE STATUS IS OTR-STAT.

           SELECT ARCHIVO-OCUPACIONES
                  ASSIGN NOM-OCUPA-W
                  ORGANIZATION IS INDEXED;
	          ACCESS MODE  IS DYNAMIC
	          RECORD KEY   IS COD-OCU
	          ALTERNATE RECORD KEY IS
	          NOMBRE-OCU WITH DUPLICATES
	          FILE STATUS OTR-STAT.

005080 DATA DIVISION.
005090 FILE SECTION.
       COPY "P:\PROG\PROYECT\FUENTES\FD-USUNET.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-SESION.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-USUAR.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-RESTR.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-HCAPER17.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-HCDETAL17.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-PACIE.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-HCEVO17.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-UNSER.CBL".
      * COPY "P:\PROG\PROYECT\FUENTES\FD-PROFE.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-TERCE.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-ESPEC.CBL".
       
       COPY "P:\PROG\PROYECT\FUENTES\FD-ENTID.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-OCUPA.CBL".

005190 WORKING-STORAGE SECTION.
005200 COPY "P:\PROG\PROYECT\FUENTES\COBW3.CBL".
005210 COPY "P:\PROG\PROYECT\FUENTES\WEB-CARAC19.CBL".
005210 COPY "P:\PROG\PROYECT\FUENTES\WS-8001.CBL".
005210 COPY "P:\PROG\PROYECT\FUENTES\WS-8031.CBL".
005220 
       77 NOM-USUAR-W                PIC X(70).
       77 NOM-RESTR-W                PIC X(70).
       77 NOM-HCAPE-W                PIC X(70).
       77 NOM-HCDET-W                PIC X(70).
       77 NOM-PACIE-W                PIC X(70).
       77 NOM-HCEVO-W                PIC X(70).
       77 NOM-UNSERV-W               PIC X(70).
       77 NOM-PROF-W                 PIC X(70).
       77 NOM-TER-W                  PIC X(70).
       77 NOM-ENTID-W                PIC X(70).
       77 NOM-ESPEC-W                PIC X(70).
       77 NOM-OCUPA-W                PIC X(70).
       77 CONT                       PIC 99.
       77 OPER-W                     PIC X(4).
       77 SUCURSAL-W                 PIC X.
       77 SW-PYP                     PIC 999.
       77 SW-BLANCA                  PIC 999.
       77 SW-OPEN                    PIC X.

       01 ULT-FECHA-NUM.
          02 ULT-ANO-NUM             PIC 99.
          02 ULT-MES-NUM             PIC 99.
          02 ULT-DIA-NUM             PIC 99.


       01 FECHA-SIG-ACT-W.
          02 SIG-ACT-W               PIC 99.
          02 FECHA-ACT-W.
             03 ANO-ACT-W            PIC 99.
             03 MES-ACT-W            PIC 99.
             03 DIA-ACT-W            PIC 99.

       01 DATOS-OPER-W.
          02 NOMBRE-OPER-W.
             03 NOMBRE1-OPER-W       PIC X(28).
             03 SUC-OPER-W           PIC X(2).
          02 IDENT-OPER-W            PIC 9(10).

       01 LLAVE-X.
          02 PACI-X                  PIC X(15).
          02 FOLIO-X.
             05 FOLIO-SUC-X          PIC XX.
             05 FOLIO-NRO-X          PIC 9(6).

       01 LINEA-LLEGADA-W            PIC X(200).

005270 01  DATO-LLEGADA-W.
           02 DIRECTORIO-W           PIC X(30).
           02 MES-TRABAJO-W          PIC X(10).
           02 LLAVE-PACI-W           PIC X(15).


       01 DATOS-ENVIO.
          02 DAT0-ENV                PIC XX.
          02 FILLER                  PIC X VALUE "|".
          02 DAT1-ENV                PIC X(15).
          02 FILLER                  PIC X VALUE "|".
          02 DAT2-ENV                PIC XX.
          02 FILLER                  PIC X VALUE "|".
          02 DAT3-ENV                PIC X(23).
          02 FILLER                  PIC X VALUE "|".


006310 LINKAGE SECTION.
006320 COPY "P:\PROG\PROYECT\FUENTES\ISAPICTX.CBL".
006330 PROCEDURE DIVISION WITH stdcall LINKAGE USING ISAPI-CTX-CNT.
006340
006350 DECLARATIVES.
006360 I-O-TEST SECTION.
006370     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUNET.         
006380 ESCR-EXCEPTIONES.
006390     IF OTR-STAT = "00"
006400        CONTINUE 
006410     ELSE
006420        MOVE OTR-STAT         TO MSJ1-HTML
006430        MOVE NOM-USU-W        TO MSJ2-HTML
006440        MOVE "HC000-1"        TO MSJ3-HTML
006450        GO TO ENVIAR2-ERROR
006460     END-IF.
006470
006480 I-O-TEST SECTION.
006490     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-SESION.
006500 ESCR-EXCEPTIONES.
006510     IF OTR-STAT = "00" 
006520        CONTINUE 
006530     ELSE
006540        MOVE OTR-STAT         TO MSJ1-HTML
006550        MOVE NOM-SESION-W     TO MSJ2-HTML
006560        MOVE "HC000-1"        TO MSJ3-HTML
006570        GO TO ENVIAR2-ERROR
006580     END-IF.
006590  

006480 I-O-TEST SECTION.
006490     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUARIOS.
006500 ESCR-EXCEPTIONES.
006510     IF OTR-STAT = "00" 
006520        CONTINUE 
006530     ELSE
006540        MOVE OTR-STAT         TO MSJ1-HTML
006550        MOVE NOM-USUAR-W      TO MSJ2-HTML
006560        MOVE "HC000-1"        TO MSJ3-HTML
006570        GO TO ENVIAR2-ERROR
006580     END-IF.
006590  

006480 I-O-TEST SECTION.
006490     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-RESTRICCION.
006500 ESCR-EXCEPTIONES.
006510     IF OTR-STAT = "00" 
006520        CONTINUE 
006530     ELSE
006540        MOVE OTR-STAT         TO MSJ1-HTML
006550        MOVE NOM-RESTR-W      TO MSJ2-HTML
006560        MOVE "HC000-1"        TO MSJ3-HTML
006570        GO TO ENVIAR2-ERROR
006580     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON HISTORIA-CLINICA.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-HCAPE-W      TO MSJ2-HTML
006680        MOVE "HC000-1"          TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR  
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON HISTORIA-DETALLADA.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-HCDET-W      TO MSJ2-HTML
006680        MOVE "HC000-1"          TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR  
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-PACIENTES.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-PACIE-W      TO MSJ2-HTML
006680        MOVE "HC000-1"          TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON EVOLUCION-HISTORIA.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-HCEVO-W      TO MSJ2-HTML
006680        MOVE "HC000-1"        TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

       I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-UNID-SERV.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-UNSERV-W     TO MSJ2-HTML
006680        MOVE "HC000-1"        TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-TERCEROS.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-TER-W        TO MSJ2-HTML
006680        MOVE "HC000-1"        TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-ESPECIALIDAD.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" 
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-ESPEC-W      TO MSJ2-HTML
006680        MOVE "HC000-1"        TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.



006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-ENTIDADES.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-ENTID-W      TO MSJ2-HTML
006680        MOVE "HC002"          TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

       I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-OCUPACIONES.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00" OR "35"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-OCUPA-W      TO MSJ2-HTML
006680        MOVE "HC002"          TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.

006720  END DECLARATIVES.
006730
006740 INICIAR-IIS.
006750     MOVE LOW-VALUE TO COBW3.
006760     MOVE FUNCTION ADDR(ISAPI-CTX-CNT) TO COBW3-CONTEXT.
006770     CALL "COBW3_INIT" USING COBW3.
006780
006790 LEER-DATO-HTML.
006800     MOVE "datosh" TO COBW3-SEARCH-DATA.
006810     CALL "COBW3_GET_VALUE" USING COBW3.
006820     MOVE COBW3-GET-DATA    TO LINEA-LLEGADA-W.


           UNSTRING LINEA-LLEGADA-W DELIMITED BY "|"
              INTO SESION-LLEGAD-W, DIRECTORIO-W, MES-TRABAJO-W, LLAVE-PACI-W, ADMIN-W
           END-UNSTRING.


001855     MOVE SESION-LLEGAD-W    TO LLAVE-SESION-W.
           MOVE FUNCTION CURRENT-DATE TO FECHA-TOTAL.

000797 INICIAR-SESION.
000806     MOVE "D:\WEB\MAIN-ELECT\DATOS\SC-SESION.DAT" TO NOM-SESION-W
000820     MOVE FUNCTION CURRENT-DATE TO FECHA-TOTAL.
000830     ACCEPT HORA-TOTAL FROM TIME.
000810     GO TO VALIDAR-SESION.
000850
000860 FIN-VALIDAR-SESION.
006840
006900 ABRIR-USUARIO.
006910     INITIALIZE OTR-STAT.
006920     MOVE "D:\WEB\MAIN-ELECT\DATOS\SC-ARCHUSU.DAT" TO NOM-USU-W
006930
006940     OPEN INPUT ARCHIVO-USUNET
006950     EVALUATE OTR-STAT
006960       WHEN "00"  CONTINUE
006970       WHEN "35"  OPEN OUTPUT ARCHIVO-USUNET
006980                  INITIALIZE REG-USUNET
006990                  WRITE REG-USUNET
007000                  CLOSE ARCHIVO-USUNET
007010                  MOVE "SC-1"                        TO MSJ1-HTML
007020                  MOVE "Falta configurar usuarios"   TO MSJ2-HTML
007030                  MOVE "HC000-1"                     TO MSJ3-HTML
007040                  GO TO ENVIAR2-ERROR
007050       WHEN OTHER GO TO CERRAR-SESION
007060     END-EVALUATE.
007070
007080     INITIALIZE LLAVE-USUNET.
007100
007110 LEER-USUARIO.
007120     READ ARCHIVO-USUNET NEXT AT END MOVE 0 TO SW-FIN.
007130
007140     CLOSE ARCHIVO-USUNET.
007200     
007210     IF NOMBRE-USUNET = SPACES
007220     OR NIT-USUNET = ZEROS
007230        MOVE "Validacion de Sesion"        TO MSJ1-HTML
007240        MOVE "Falta configurar usuarios"   TO MSJ2-HTML
007250        MOVE "Sc"                          TO MSJ3-HTML
007260        GO TO ENVIAR2-ERROR
007270     END-IF.
007280 
007350
       ASIGNAR-NOMBRES.
           ACCEPT ULT-FECHA-NUM FROM DATE.
           MOVE ULT-FECHA-NUM TO FECHA-ACT-W
           INITIALIZE NOM-USUAR-W
           INSPECT IP-DATOS-USUNET REPLACING FIRST "/" BY "\"
           MOVE "\\" TO NOM-USUAR-W NOM-ENTID-W

           INSPECT NOM-USUAR-W REPLACING FIRST "                    "
                                            BY IP-DATOS-USUNET

           INSPECT NOM-USUAR-W REPLACING FIRST " "
                                            BY "\"

           INSPECT NOM-USUAR-W REPLACING FIRST "                              "
                                            BY DIRECTORIO-W

           MOVE NOM-USUAR-W TO NOM-HCAPE-W NOM-HCDET-W NOM-PACIE-W NOM-UNSERV-W NOM-PROF-W 
                               NOM-TER-W 



           INSPECT NOM-USUAR-W REPLACING FIRST  "                       "
                                            BY  "\CONTROL\SC-ARCHUSU.DAT".

           INSPECT NOM-PACIE-W REPLACING FIRST  "                     "
                                           BY   "\CONTROL\SC-PACIE.DAT".

           INSPECT NOM-UNSERV-W REPLACING FIRST "                     "
                                             BY "\CONTROL\SC-UNSER.DAT".

           INSPECT NOM-PROF-W   REPLACING FIRST "                        "
                                             BY "\CONTROL\SC-ARCHPROF.DAT".

           INSPECT NOM-TER-W    REPLACING FIRST "                       "
                                             BY "\CONTROL\SC-ARCHTER.DAT".

           INSPECT NOM-ENTID-W  REPLACING FIRST "                    "
                                             BY IP-DATOS-USUNET

           INSPECT NOM-ENTID-W REPLACING FIRST " "
                                            BY "\"

           MOVE NOM-ENTID-W TO NOM-RESTR-W NOM-OCUPA-W NOM-HCAPE-W NOM-HCDET-W NOM-ESPEC-W NOM-HCEVO-W

           INSPECT NOM-RESTR-W  REPLACING FIRST "                         "
                                            BY "PROG\DATOS\SC-ARCHREST.SC".

           INSPECT NOM-ENTID-W REPLACING FIRST "                         "
                                            BY "PROG\DATOS\SC-ARCHENT.DAT".

           INSPECT NOM-ESPEC-W REPLACING FIRST "                         "
                                            BY "PROG\DATOS\SC-ARCHESP.DAT".

           INSPECT NOM-OCUPA-W REPLACING FIRST "                         "
                                            BY "PROG\DATOS\SC-ARCHOCU.DAT".

           INSPECT NOM-HCAPE-W REPLACING FIRST "                        "
                                            BY "PROG\DATOS\SC-HCAPER.S17".

           INSPECT NOM-HCDET-W REPLACING FIRST "                          "
                                            BY "PROG\DATOS\SC-HCDETA-X.S17".

           INSPECT NOM-HCEVO-W REPLACING FIRST "                         "
                                            BY "PROG\DATOS\SC-HCEVOX1.S17"

           INSPECT NOM-HCEVO-W REPLACING FIRST "X1" BY ULT-ANO-NUM.
                                               

       LEER-USUARIO.

           OPEN INPUT ARCHIVO-USUARIOS
           READ ARCHIVO-USUARIOS NEXT WITH NO LOCK AT END 
                CLOSE ARCHIVO-USUARIOS
           END-READ.

       LEER-PACIENTE.
           OPEN INPUT ARCHIVO-PACIENTES.
           MOVE LLAVE-PACI-W    TO   COD-PACI.
           READ ARCHIVO-PACIENTES WITH NO LOCK
                INVALID KEY
                        MOVE "NO EXISTE PACIENTE!" TO DESCRIP-PACI
                        INITIALIZE DATOS-PACI
           END-READ.
           CLOSE ARCHIVO-PACIENTES.


       INICIALIZAR-FOLIO.
           MOVE LLAVE-PACI-W  TO PACI-X
           IF NIT-USU = 900565371
              PERFORM BUSCAR-OPER
              IF SUC-OPER-W = "  "
                 MOVE 01 TO FOLIO-SUC-X
              ELSE
                 MOVE SUC-OPER-W TO FOLIO-SUC-X
              END-IF
           ELSE
              MOVE PREFIJO-USU TO FOLIO-SUC-X
           END-IF
           MOVE 999999 TO FOLIO-NRO-X.

       BUSCAR-HISTORIAS.
           OPEN INPUT HISTORIA-CLINICA.

           MOVE LLAVE-PACI-W   TO ID-HC
           START HISTORIA-CLINICA KEY = ID-HC
                 INVALID KEY
                      CLOSE HISTORIA-CLINICA
                      MOVE 0  TO SW-OPEN
                      PERFORM BUSCAR-EVOLUCIONES
                 NOT INVALID KEY
                     MOVE 1   TO SW-OPEN
                     CLOSE HISTORIA-CLINICA
           END-START.

           MOVE 00              TO DAT0-ENV
           MOVE ID-HC           TO DAT1-ENV
           MOVE SW-OPEN         TO DAT2-ENV
           MOVE LLAVE-X         TO DAT3-ENV.

010700 PAGINA-CONFIG.

           MOVE "statuscode" TO COBW3-CNV-NAME
010730     MOVE "00"         TO COBW3-CNV-VALUE
010740     CALL "COBW3_SET_CNV" USING COBW3

000570	   MOVE "datosrecibidos" TO COBW3-CNV-NAME
000580      MOVE DATOS-ENVIO      TO COBW3-CNV-VALUE
000590	   CALL "COBW3_SET_CNV"  USING COBW3

010720     MOVE "programa-id" TO COBW3-CNV-NAME
010730     MOVE "HC000-1" TO COBW3-CNV-VALUE
010740     CALL "COBW3_SET_CNV" USING COBW3

010760     MOVE "..\PAGINAS\RECIBIDOSPLANO.ASPX" TO SALIDA-HTML
010770     PERFORM ABRIR-HTML.
007980   
007990 CERRAR-SESION.
008000     CALL "COBW3_FREE" USING COBW3.
008010     MOVE 1 TO PROGRAM-STATUS.
008020     EXIT PROGRAM.

       BUSCAR-OPER.
           OPEN INPUT ARCHIVO-RESTRICCION
           IF ADMIN-W = "GEBC"
              MOVE "Prosoft E.A.T"  TO NOMBRE-REST
              MOVE 0017329215       TO ID-REST
           ELSE
              IF ADMIN-W = SPACES
                 MOVE SPACES TO NOMBRE-REST
                 MOVE 0      TO ID-REST
              ELSE
                 MOVE ADMIN-W TO COD-REST
                 READ ARCHIVO-RESTRICCION WITH NO LOCK
                      INVALID KEY
                              MOVE COD-REST TO NOMBRE-REST
                 END-READ
                 MOVE NOMBRE-REST   TO NOMBRE-OPER-W
                 MOVE ID-REST       TO IDENT-OPER-W
              END-IF
           END-IF
           CLOSE ARCHIVO-RESTRICCION.


       BUSCAR-EVOLUCIONES.
           OPEN INPUT EVOLUCION-HISTORIA.
           INITIALIZE FOLIO-NRO-EVO
           MOVE 20 TO SIG-ACT-W

           MOVE LLAVE-PACI-W    TO ID-EVO
           START EVOLUCION-HISTORIA KEY = LLAVE-PACI-EVO
                 INVALID KEY
                   IF NIT-USU = 900565371
                      CONTINUE
      *                MOVE SUC-OPER-W  TO FOLIO-SUC-HC
                   ELSE
                      MOVE PREFIJO-USU TO FOLIO-SUC-HC
                   END-IF
                   MOVE 000001 TO FOLIO-NRO-HC
                   MOVE 0 TO ESTADO-HC
                   CLOSE EVOLUCION-HISTORIA
                 NOT INVALID KEY
                         READ EVOLUCION-HISTORIA NEXT
                         CLOSE    EVOLUCION-HISTORIA
                         OPEN I-O HISTORIA-CLINICA
                         INITIALIZE REG-HC
                         MOVE "HC01"         TO ESQUEMA-HC
                         MOVE NIT-USU        TO NIT-CONTABILIDAD-HC
                         MOVE LLAVE-PACI-EVO TO LLAVE-HC
                         MOVE FECHA-EVO      TO FECHA-HC
                         MOVE HORA-EVO       TO HORA-HC
                         MOVE UNSERV-EVO     TO SERV-HC
                         MOVE OPER-ELAB-EVO  TO OPER-ELAB-HC
                         MOVE MED-EVO        TO MED-HC
                         MOVE
                         "EVOLUCIONES ANTERIORES SIN HOJA DE APERTURA"
                                             TO MOTIV-HC
                         MOVE 2 TO ESTADO-HC
                         MOVE FECHA-SIG-ACT-W TO EGRESO-HC
                         ACCEPT HORA-EGRES-HC FROM TIME

                         WRITE REG-HC END-WRITE
                         CLOSE HISTORIA-CLINICA
                         GO TO BUSCAR-HISTORIAS
           END-START.      

008040 COPY "P:\PROG\PROYECT\FUENTES\SC-WEB19.CBL".
