000020*=================================================================
000060*ACTUALIZAR CONFIGURACION    
000061* INDEX_CONFIG
000070*=================================================================
000130 IDENTIFICATION DIVISION.
000140 PROGRAM-ID. "HttpExtensionProc".
000150 ENVIRONMENT DIVISION.
000160 CONFIGURATION SECTION.
000170 INPUT-OUTPUT SECTION.
000171 FILE-CONTROL.
000172 COPY "P:\PROG\PROYECT\FUENTES\FS-USUNET.CBL".
000185 COPY "P:\PROG\PROYECT\FUENTES\FS-SESION.CBL".


           SELECT ARCHIVO-MODULO   LOCK MODE IS AUTOMATIC
                  ASSIGN NOM-MODULO-LNK
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS LLAVE-MODUL
                  FILE STATUS IS OTR-STAT.

           SELECT ARCHIVO-TEXTO
                  ASSIGN NOM-PLANO-W
                  ORGANIZATION IS LINE SEQUENTIAL
                  FILE STATUS IS OTR-STAT.

000186
000190 DATA DIVISION.
000191 FILE SECTION.
000192 COPY "P:\PROG\PROYECT\FUENTES\FD-USUNET.CBL".
000194 COPY "P:\PROG\PROYECT\FUENTES\FD-SESION.CBL".
       COPY "P:\PROG\PROYECT\FUENTES\FD-MODUL.CBL".

       FD  ARCHIVO-TEXTO
           LABEL RECORD STANDARD.
       01  REG-PLANO.
           02 DATOS-PLANO            PIC X(100). 


000200 WORKING-STORAGE SECTION.
000201 COPY "P:\PROG\PROYECT\FUENTES\COBW3.CBL".
000202 COPY "P:\PROG\PROYECT\FUENTES\WEB-CARAC.CBL".
000208
000209 01 EDITADO-W                  PIC X(12).
       01 NOM-PLANO-W                PIC X(90).
       01 NOM-MODULO-LNK             PIC X(70).
000210
000211 01 COD-TMP.
000212    02 SW-ALFA                 PIC 9.
000213    02 TABLA-COD1.
000214       03 COD1-PAC             PIC X OCCURS 10.
000215    02 TABLA-COD2.
000216       03 COD2-PAC             PIC X OCCURS 10.

       01 SW-VAR                     PIC 999.
       01 K                          PIC 999.
000217

       01 DATOS-LLEGAD-W.
          02 LINEA-LLEGAD-W          PIC X(500).

       01 FECHA-LLEGAD-W             PIC X(12).

001567 01  TABLA-W.
001568     02 CM-W          OCCURS 60     PIC X.

001567 01  TABLA2-W.
001568     02 CM2-W         OCCURS 60     PIC X.


       01 REG-USUNET-W.
          02 LLAVE-USUNET-W         PIC 9.
          02 NOMBRE-USUNET-W        PIC X(60).
          02 NIT-USUNET-W           PIC 9(10).
          02 DV-USUNET-W            PIC 9.
          02 DIRECC-USUNET-W.
             03 DIRECC1-USUNET-W    PIC X(30).
             03 DIRECC2-USUNET-W    PIC X(30).
          02 CLAVE-USUNET-W         PIC X(8).
          02 EMAIL-USUNET-W         PIC X(60).
          02 SERV-EMAIL-USUNET-W    PIC X(30).
          02 CLAVE-EMAIL-USUNET-W   PIC X(30).
          02 SSL-EMAIL-USUNET-W     PIC X.
          02 IP-DATOS-USUNET-W      PIC X(20).
          02 PUERTO-EMAIL-USUNET-W  PIC X(4).
          02 IP-DESCARGA-USUNET-W   PIC X(20).
          02 DIR-SITIO-USUNET-W     PIC X(10).
          02 GS128-PREDIAL-USUNET-W PIC X(13).
          02 GS128-INDUSTR-USUNET-W PIC X(13).
          02 SERV-SQL-USUNET-W      PIC X(20).
          02 DIRECTORIO-USUNET-W    PIC X(30).
          02 IVA-USUNET-W           PIC 99.
          02 IVA-2-USUNET-W         PIC 99.
          02 IVA-3-USUNET-W         PIC 99.
          02 SUC-USUNET-W           PIC 99.
          02 CONS-FACT-USUNET-W     PIC 9(6).
          02 ALM-USUNET-W           PIC X(5).
	  02 PSE-ANUAL-USUNET-W     PIC 9(4).
	  02 PSE-BIMES-USUNET-W     PIC 9(4).
	  02 PSE-PREDI-USUNET-W     PIC 9(4).
	  02 BANCO-PAGO-USUNET-W    PIC X(60).
	  02 TABLA-DIR-USUNET-W.
	     03 TAB-DIR-USUNET-W OCCURS 50.
                05 DIR-DIR-NET-W     PIC X(20).
	     03 TAB-NOM-USUNET-W OCCURS 30.
	        05 DIR-NOM-NET-W     PIC X(5).
	  02 TIEMPO-SESION-USUNET-W  PIC 9(4).
          02 UNIDAD-PROGRAM-USUNET-W PIC X.
	  02 FILLER                PIC X(644).

       01 REG-MODUL-W.
          02 LLAVE-MODUL-W.
             03 COD-MODUL-W       PIC X(3).
          02 FILLER               PIC X(10).
          02 DESCRIP-MODUL-W      PIC X(30).
          02 ACTIVAR-MODUL-W      PIC X.
          02 FILLER               PIC X(2000).

000376
000377
000450 LINKAGE SECTION.
000460 COPY "P:\PROG\PROYECT\FUENTES\ISAPICTX.CBL".
000470*
000480 PROCEDURE DIVISION WITH stdcall LINKAGE USING ISAPI-CTX-CNT.
000490
000491 DECLARATIVES.
000492 I-O-TEST1 SECTION.
000493     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-USUNET.         
000494 ESCR-EXCEPTIONES.
000495     IF OTR-STAT = "00" OR "35"
000496        CONTINUE 
000497     ELSE
000498        MOVE OTR-STAT                TO MSJ1-HTML
000499        MOVE NOM-USU-W               TO MSJ2-HTML
000500        MOVE "CONFG"                 TO MSJ3-HTML
000506        GO TO ENVIAR2-ERROR
000509     END-IF.

000492 I-O-TEST1 SECTION.
000493     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-MODULO.
000494 ESCR-EXCEPTIONES.
000495     IF OTR-STAT = "00"
000496        CONTINUE 
000497     ELSE
000498        MOVE OTR-STAT                TO MSJ1-HTML
000499        MOVE NOM-MODULO-LNK          TO MSJ2-HTML
000500        MOVE "CONFG"                 TO MSJ3-HTML
000506        GO TO ENVIAR2-ERROR
000509     END-IF.

006600 I-O-TEST SECTION.
006610     USE AFTER EXCEPTION PROCEDURE ON ARCHIVO-TEXTO.
006620 ESCR-EXCEPTIONES.
006630     IF OTR-STAT = "00"
006640        CONTINUE 
006650     ELSE
006660        MOVE OTR-STAT         TO MSJ1-HTML
006670        MOVE NOM-PLANO-W      TO MSJ2-HTML
006680        MOVE "CONFG"          TO MSJ3-HTML
006690        GO TO ENVIAR2-ERROR
006700     END-IF.
000510
000514  END DECLARATIVES.
000517
000518 INICIAR-IIS.
000530     MOVE LOW-VALUE TO COBW3.
000540     MOVE FUNCTION ADDR(ISAPI-CTX-CNT) TO COBW3-CONTEXT.
000760     CALL "COBW3_INIT" USING COBW3.

001851 LEER-DATO-HTML.
001852     MOVE "datosh" TO COBW3-SEARCH-DATA.
001853     CALL "COBW3_GET_VALUE" USING COBW3.
001854     MOVE COBW3-GET-DATA    TO DATOS-LLEGAD-W.

           INITIALIZE I REG-USUNET-W.

           UNSTRING LINEA-LLEGAD-W DELIMITED BY "|"
              INTO FECHA-LLEGAD-W, NOMBRE-USUNET-W, NIT-USUNET-W, DIRECC-USUNET-W, EMAIL-USUNET-W, CLAVE-EMAIL-USUNET-W, SERV-EMAIL-USUNET-W, 
                   PUERTO-EMAIL-USUNET-W, SSL-EMAIL-USUNET-W, IP-DATOS-USUNET-W, IP-DESCARGA-USUNET-W, UNIDAD-PROGRAM-USUNET-W
           END-UNSTRING.



           MOVE "D:\WEB\MAIN-ELECT\DATOS\SC-ARCHMODUL.DAT" TO NOM-MODULO-LNK

           MOVE "C:\PROSOFT\TEMP\CONTAB-XXXXXXXXXXXX.TXT"  TO NOM-PLANO-W

           INSPECT NOM-PLANO-W REPLACING FIRST "XXXXXXXXXXXX" BY FECHA-LLEGAD-W

           OPEN INPUT ARCHIVO-TEXTO.
           MOVE 0 TO SW-VAR I J
           INITIALIZE I TABLA-DIR-USUNET-W REG-MODUL-W.
       LEER-TABLA.
           READ ARCHIVO-TEXTO NEXT WITH NO LOCK AT END GO TO CERRAR-ARCHIVO.

           IF DATOS-PLANO = SPACES 
              CONTINUE
           ELSE
               IF DATOS-PLANO = "$|"
                  MOVE 1   TO SW-VAR
                  GO TO LEER-TABLA
               ELSE IF DATOS-PLANO = "$|$"
                       MOVE 2 TO SW-VAR
                       GO TO LEER-TABLA
               END-IF

               IF SW-VAR = 1
                  UNSTRING DATOS-PLANO DELIMITED BY "|"
                     INTO LLAVE-MODUL-W, DESCRIP-MODUL-W, ACTIVAR-MODUL-W
                  END-UNSTRING

                  OPEN I-O ARCHIVO-MODULO
                  INITIALIZE REG-MODUL

                  MOVE LLAVE-MODUL-W   TO LLAVE-MODUL
                  READ ARCHIVO-MODULO WITH NO LOCK
                       INVALID KEY
                               CONTINUE
                       NOT INVALID KEY 
                               MOVE REG-MODUL-W   TO REG-MODUL
                               REWRITE REG-MODUL END-REWRITE
                  END-READ
                  CLOSE ARCHIVO-MODULO
               ELSE IF SW-VAR = 2
                       ADD 1 TO J
                       IF J > 30
                          GO TO LEER-TABLA
                       ELSE
                          MOVE DATOS-PLANO  TO DIR-NOM-NET-W (J)
                       END-IF
               ELSE
                  ADD 1 TO I
                  IF I > 50
                     GO TO LEER-TABLA
                  ELSE
                     MOVE DATOS-PLANO    TO DIR-DIR-NET-W (I)
                     INSPECT DIR-DIR-NET-W (I) REPLACING ALL "/" BY "\"
                  END-IF
                  
               END-IF
           END-IF

           GO TO LEER-TABLA.


       CERRAR-ARCHIVO.
           CLOSE ARCHIVO-TEXTO.


       FIN-VALIDAR-SESION.
000890
001262 LEER-USUARIO.
001263     MOVE "D:\WEB\MAIN-ELECT\DATOS\SC-ARCHUSU.DAT" TO NOM-USU-W
001264
001265     OPEN INPUT ARCHIVO-USUNET
001266
001267     EVALUATE OTR-STAT
001268      WHEN "00"  CLOSE    ARCHIVO-USUNET
001269                 OPEN I-O ARCHIVO-USUNET
001270      WHEN "35"  OPEN OUTPUT ARCHIVO-USUNET
001271                 INITIALIZE REG-USUNET
001272                 WRITE REG-USUNET
001273                 CLOSE ARCHIVO-USUNET
001274                 GO TO LEER-USUARIO
001275      WHEN OTHER GO TO CERRAR-SESION.
001276
           INITIALIZE REG-USUNET
001277     MOVE REG-USUNET-W TO REG-USUNET
001278     READ ARCHIVO-USUNET  WITH NO LOCK
001279          INVALID KEY     WRITE REG-USUNET END-WRITE
001281          NOT INVALID KEY MOVE REG-USUNET-W TO REG-USUNET
                                REWRITE REG-USUNET END-REWRITE
001284     END-READ.
001285     CLOSE ARCHIVO-USUNET.
001286

002147 ENVIO-DATOS.
004378     MOVE "datosrecibidos"  TO COBW3-CNV-NAME
004393     MOVE 00                TO COBW3-CNV-VALUE
004403     CALL "COBW3_SET_CNV"   USING COBW3
004413     MOVE "../PAGINAS/RECIBIDOS.ASPX"  TO SALIDA-HTML
004430     PERFORM ABRIR-HTML. 

001292 CERRAR-SESION.
001293     CALL "COBW3_END_SESSION" using COBW3.
001307     CALL "COBW3_FREE" USING COBW3.
001311     MOVE 1 TO PROGRAM-STATUS.
001312     EXIT PROGRAM.
002120
002151 COPY "P:\PROG\PROYECT\FUENTES\SC-WEB.CBL".
002177
002187 EDITAR-NUMERO.
002188     INSPECT EDITADO-W  CONVERTING  "ABCDEFGHIJKLMNOPQRSTUVWXYZ"
002189                                 TO "                          ".
002190
002191     MOVE EDITADO-W  TO TABLA-COD1.
002192     INITIALIZE    TABLA-COD2 SW-ALFA.
002193     MOVE 10 TO LP.
002194     PERFORM MOVER-COD VARYING LN FROM 10 BY -1
002195                         UNTIL LN < 1 OR LP < 1.
002196
002197     INSPECT TABLA-COD2 REPLACING ALL " " BY "0".
002198         
002199 MOVER-COD.
002200     IF COD1-PAC (LN) IS NUMERIC
002201     OR COD1-PAC (LN) = "-"     
002202        MOVE COD1-PAC (LN) TO COD2-PAC (LP)
002203        SUBTRACT 1 FROM LP
002204     END-IF.
002205
002206
002370
